<!DOCTYPE html>
<!--[if lte IE 8 ]>
<html class="ie" xmlns="http://www.w3.org/1999/xhtml" xml:lang="en-US" lang="en-US">
<![endif]-->
<!--[if (gte IE 9)|!(IE)]><!-->
<!--
***************  *      *     *
      8          *    *       *
      8          *  *         *
      8          **           *
      8          *  *         *
      8          *    *       *
      8          *      *     *
      8          *        *   ***********    -----Theme By Kieran(http://go.kieran.top)
-->
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en-US" lang="en-US">
<!--<![endif]-->

<head>
  <title>从平凡到卓越 | 流城</title>
  <!-- Meta data -->
    <meta http-equiv="Content-Type" content="text/html" charset="UTF-8" >
    <meta http-equiv="X-UA-Compatible" content="IE=edge"/>
    <meta name="viewport" content="width=device-width, initial-scale=1.0" />
    <meta name="generator" content="流城">
    <meta name="author" content="吴白">
    <meta name="description" content="" />
    <meta name="keywords" content="" />

    <!-- Favicon, (keep icon in root folder) -->
    <link rel="Shortcut Icon" href="/img/favicon.ico" type="image/ico">

    <link rel="alternate" href="/atom.xml" title="流城" type="application/atom+xml">
    <link rel="stylesheet" href="/css/all.css" media="screen" type="text/css">
	
    <link rel="stylesheet" href="/highlightjs/vs.css" type="text/css">
    
    

    <!-- Custom stylesheet, (add custom styles here, always load last) -->
    <!-- Load our stylesheet for IE8 -->
    <!--[if IE 8]>
    <link rel="stylesheet" type="text/css" href="/css/ie8.css" />
    <![endif]-->

    <!-- Google Webfonts (Monserrat 400/700, Open Sans 400/600) -->
    <!--<link href='//fonts.useso.com/css?family=Montserrat:400,700' rel='stylesheet' type='text/css'>-->
    <!--<link href='//fonts.useso.com/css?family=Open+Sans:400,600' rel='stylesheet' type='text/css'>-->

    <!-- Load our fonts individually if IE8+, to avoid faux bold & italic rendering -->
    <!--[if IE]>
    <!--<link href='http://fonts.useso.com/css?family=Montserrat:400' rel='stylesheet' type='text/css'> -->
    <!--<link href='http://fonts.useso.com/css?family=Montserrat:700' rel='stylesheet' type='text/css'> -->
    <!--<link href='http://fonts.useso.com/css?family=Open+Sans:400' rel='stylesheet' type='text/css'>-->
    <!--<link href='http://fonts.useso.com/css?family=Open+Sans:600' rel='stylesheet' type='text/css'>-->
    <![endif]-->

    <!-- jQuery | Load our jQuery, with an alternative source fallback to a local version if request is unavailable -->
    <script src="/js/jquery-1.11.1.min.js"></script>
    <script>window.jQuery || document.write('<script src="js/jquery-1.11.1.min.js"><\/script>')</script>

    <!-- Load these in the <head> for quicker IE8+ load times -->
    <!-- HTML5 shim and Respond.js IE8 support of HTML5 elements and media queries -->
    <!--[if lt IE 9]>
    <script src="/js/html5shiv.min.js"></script>
    <script src="/js/respond.min.js"></script>
    <![endif]-->










  
  
  <link rel="alternate" type="application/atom+xml" title="Atom 0.3" href="atom.xml">
  
  

  
  <style>.col-md-8.col-md-offset-2.opening-statement img{display:none;}</style>
</head>

<!--
<body class="post-template">
-->
<body id="index" class="lightnav animsition">

      <!-- ============================ Off-canvas navigation =========================== -->

    <div class="sb-slidebar sb-right sb-style-overlay sb-momentum-scrolling">
        <div class="sb-close" aria-label="Close Menu" aria-hidden="true">
            <img src="/img/close.png" alt="Close"/>
        </div>
        <!-- Lists in Slidebars -->
        <ul class="sb-menu">
            <li><a href="/" class="animsition-link" title="Home">Home</a></li>
            <li><a href="/archives" class="animsition-link" title="archive">archives</a></li>
            <!-- Dropdown Menu -->
			 
            <li>
                <a class="sb-toggle-submenu">Works<span class="sb-caret"></span></a>
                <ul class="sb-submenu">
                    
                        <li><a href="http://www.gome.com.cn" target="_BLANK" class="animsition-link">Gome</a></li>
                    
                        <li><a href="http://www.yintai.com" target="_BLANK" class="animsition-link">YinTai</a></li>
                    
                </ul>
            </li>
            
            
            
            <li>
                <a class="sb-toggle-submenu">Links<span class="sb-caret"></span></a>
                <ul class="sb-submenu">
                    
                    <li><a href="http://www.jianshu.com/users/211925b3ca7c/latest_articles" class="animsition-link">吴白</a></li>
                    
                    <li><a href="http://www.jianshu.com/users/19f4bf67c705/latest_articles" class="animsition-link">吴禅</a></li>
                    
                </ul>
            </li>
            
        </ul>
        <!-- Lists in Slidebars -->
        <ul class="sb-menu secondary">
            <li><a href="/about" class="animsition-link" title="about">About</a></li>
            <li><a href="/atom.xml" class="animsition-link" title="rss">RSS</a></li>
        </ul>
    </div>
    
    <!-- ============================ END Off-canvas navigation =========================== -->

    <!-- ============================ #sb-site Main Page Wrapper =========================== -->

    <div id="sb-site">
        <!-- #sb-site - All page content should be contained within this id, except the off-canvas navigation itself -->

        <!-- ============================ Header & Logo bar =========================== -->

        <div id="navigation" class="navbar navbar-fixed-top">
            <div class="navbar-inner">
                <div class="container">
                    <!-- Nav logo -->
                    <div class="logo">
                        <a href="/" title="Logo" class="animsition-link">
                         <img src="/img/logo.png" alt="Logo" width="35px;"/> 
                        </a>
                    </div>
                    <!-- // Nav logo -->
                    <!-- Info-bar -->
                    <nav>
                        <ul class="nav">
                            <li><a href="/" class="animsition-link">流城</a></li>
                            <li class="nolink"><span>Always </span>Creative.</li>
                            
                            <li><a href="https://github.com/" title="Github" target="_blank"><i class="icon-github"></i></a></li>
                            
                            
                            <li><a href="https://twitter.com/" title="Twitter" target="_blank"><i class="icon-twitter"></i></a></li>
                            
                            
                            <li><a href="https://www.facebook.com/" title="Facebook" target="_blank"><i class="icon-facebook"></i></a></li>
                            
                            
                            <li><a href="https://google.com/" title="Google-Plus" target="_blank"><i class="icon-google-plus"></i></a></li>
                            
                            
                            <li><a href="http://weibo.com/" title="Sina-Weibo" target="_blank"><i class="icon-sina-weibo"></i></a></li>
                            
                            <li class="nolink"><span>Welcome!</span></li>
                        </ul>
                    </nav>
                    <!--// Info-bar -->
                </div>
                <!-- // .container -->
                <div class="learnmore sb-toggle-right">More</div>
                <button type="button" class="navbar-toggle menu-icon sb-toggle-right" title="More">
                <span class="sr-only">Toggle navigation</span>
                <span class="icon-bar before"></span>
                <span class="icon-bar main"></span>
                <span class="icon-bar after"></span>
                </button>
            </div>
            <!-- // .navbar-inner -->
        </div>

        <!-- ============================ Header & Logo bar =========================== -->


      
<section id="intro">
    <div class="container">
        <div class="row col-md-offset-2">
            <div class="col-md-8">
    			<span class="post-meta">
      <time datetime="2013-02-03T04:37:11.000Z" itemprop="datePublished">
          2013-02-03
      </time>
    
    
    | 
    <a href='/tags/杂谈/'>杂谈</a>
    
    
</span>
                <h1>从平凡到卓越</h1>
            </div>
        </div>
        <!--<div class="col-md-8 col-md-offset-2">-->
        <div class="col-md-offset-2">
      		<p>21&#x4E16;&#x7EAA;&#x521D;&#x671F;&#x6765;&#x770B;&#xFF0C;&#x65E0;&#x7591;&#x662F;&#x4E00;&#x4E2A;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x65F6;&#x4EE3;&#xFF0C;&#x4F5C;&#x4E3A;&#x4E92;&#x8054;&#x7F51;&#x4E2D;&#x575A;&#x529B;&#x91CF;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#xFF0C;&#x5728;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x7684;&#x9886;&#x57DF;&#x53D1;&#x6325;&#x4E86;&#x5DE8;&#x5927;&#x7684;&#x4F5C;&#x7528;&#x3002;21&#x4E16;&#x7EAA;&#xFF0C;&#x662F;&#x4E00;&#x4E2A;&#x5145;&#x6EE1;&#x4E86;&#x5947;&#x5E7B;&#x8272;&#x5F69;&#x7684;&#x65F6;&#x4EE3;&#xFF0C;&#x6280;&#x672F;&#x6539;&#x53D8;&#x7740;&#x4EBA;&#x4EEC;&#x7684;&#x751F;&#x6D3B;&#xFF0C;&#x4E5F;&#x6539;&#x53D8;&#x4E86;&#x4EBA;&#x7C7B;&#x7684;&#x601D;&#x8003;&#x6A21;&#x5F0F;&#x3002;&#x8FD9;&#x4E2A;&#x65F6;&#x4EE3;&#x662F;&#x4E0D;&#x7F3A;&#x7A0B;&#x5E8F;&#x5458;&#x7684;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x4EE3;&#x4E5F;&#x662F;&#x6700;&#x7F3A;&#x7A0B;&#x5E8F;&#x5458;&#x7684;&#xFF0C;&#x5982;&#x4F55;&#x5728;&#x8FD9;&#x4E2A;&#x65F6;&#x4EE3;&#x66F4;&#x597D;&#x7684;&#x53D1;&#x6325;&#x81EA;&#x5DF1;&#x7684;&#x6F5C;&#x529B;&#xFF0C;&#x4E5F;&#x6210;&#x4E86;&#x7A0B;&#x5E8F;&#x5458;&#x4E0D;&#x5F97;&#x4E0D;&#x9762;&#x5BF9;&#x7684;&#x8BDD;&#x9898;&#x3002;&#x5728;&#x73B0;&#x5B9E;&#x751F;&#x6D3B;&#x4E2D;&#x6211;&#x4EEC;&#x603B;&#x4F1A;&#x9047;&#x5230;&#x8FD9;&#x6837;&#x7684;&#x8BDD;&#x9898;&#xFF1A;&#x90A3;&#x4E9B;&#x201C;10&#x500D;&#x6548;&#x7387;&#x201D;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x662F;&#x5982;&#x4F55;&#x505A;&#x5230;&#x7684;&#xFF0C;&#x4ECA;&#x5929;&#x6211;&#x4EEC;&#x5C31;&#x6765;&#x6252;&#x4E00;&#x6252;&#x90A3;&#x4E9B;&#x4E0D;&#x4E3A;&#x4EBA;&#x77E5;&#x7684;&#x5C0F;&#x79D8;&#x5BC6;&#x3002;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1170656-65c1f80ad3535aae.jpg?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="&#x7A0B;&#x5E8F;&#x5458;"></p>
<h4 id="&#x7F16;&#x7A0B;&#x7684;&#x65E5;&#x5E38;"><a href="#&#x7F16;&#x7A0B;&#x7684;&#x65E5;&#x5E38;" class="headerlink" title="&#x7F16;&#x7A0B;&#x7684;&#x65E5;&#x5E38;"></a>&#x7F16;&#x7A0B;&#x7684;&#x65E5;&#x5E38;</h4><p>&#x6BD4;&#x5C14;.&#x76D6;&#x8328;&#x8BF4;&#x8FC7;&#xFF1A;&#x201C;&#x4E00;&#x4E2A;&#x5353;&#x8D8A;&#x7684;&#x8F66;&#x5E8A;&#x5DE5;&#x53EF;&#x4EE5;&#x8981;&#x6C42;&#x6BD4;&#x4E00;&#x4E2A;&#x4E00;&#x822C;&#x7684;&#x8F66;&#x5E8A;&#x5DE5;&#x591A;&#x62FF;&#x6570;&#x500D;&#x9AD8;&#x7684;&#x5DE5;&#x8D44;&#xFF0C;&#x4F46;&#x4E00;&#x4E2A;&#x5353;&#x8D8A;&#x7684;&#x8F6F;&#x4EF6;&#x5199;&#x624B;&#x7684;&#x4EF7;&#x503C;&#x4F1A;10000&#x500D;&#x4E8E;&#x4E00;&#x4E2A;&#x666E;&#x901A;&#x7684;&#x5199;&#x624B;&#x3002;&#x201D;&#x7F16;&#x7A0B;&#x662F;&#x4E2A;&#x5F88;&#x96BE;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x662F;&#x4E00;&#x79CD;&#x5267;&#x70C8;&#x7684;&#x8111;&#x529B;&#x52B3;&#x52A8;&#x3002;&#x597D;&#x7684;&#x7A0B;&#x5E8F;&#x5458;7&#xD7;24&#x5C0F;&#x65F6;&#x7684;&#x601D;&#x8003;&#x4ED6;&#x4EEC;&#x7684;&#x5DE5;&#x4F5C;&#x3002;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x5458;&#x7528;&#x5728;&#x5199;&#x7A0B;&#x5E8F;&#x4E0A;&#x7684;&#x65F6;&#x95F4;&#x5927;&#x6982;&#x5360;&#x4ED6;&#x7684;&#x5DE5;&#x4F5C;&#x65F6;&#x95F4;&#x7684;10-20%&#xFF0C;&#x597D;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x82B1;&#x53BB;90%&#x7684;&#x65F6;&#x95F4;&#x5728;&#x601D;&#x8003;&#x3001;&#x7814;&#x7A76;&#x548C;&#x5B9E;&#x9A8C;&#xFF0C;&#x6765;&#x627E;&#x51FA;&#x6700;&#x4F18;&#x65B9;&#x6848;&#x3002;&#x5DEE;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x82B1;&#x53BB;90%&#x7684;&#x65F6;&#x95F4;&#x5728;&#x8C03;&#x8BD5;&#x95EE;&#x9898;&#x7A0B;&#x5E8F;&#x3001;&#x76F2;&#x76EE;&#x7684;&#x4FEE;&#x6539;&#x7A0B;&#x5E8F;&#xFF0C;&#x671F;&#x671B;&#x67D0;&#x79CD;&#x5199;&#x6CD5;&#x80FD;&#x53EF;&#x884C;&#x3002;</p>
<p>&#x5353;&#x8D8A;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x53EA;&#x82B1;&#x5F88;&#x5C11;&#x7684;&#x65F6;&#x95F4;&#x53BB;&#x5199;&#x4EE3;&#x7801;&#x2014;&#x2014;&#x81F3;&#x5C11;&#x6307;&#x90A3;&#x4E9B;&#x6700;&#x7EC8;&#x5F62;&#x6210;&#x4EA7;&#x54C1;&#x7684;&#x4EE3;&#x7801;&#x3002;&#x90A3;&#x4E9B;&#x8981;&#x82B1;&#x6389;&#x5927;&#x91CF;&#x65F6;&#x95F4;&#x5199;&#x4EE3;&#x7801;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x90FD;&#x662F;&#x592A;&#x61D2;&#x60F0;&#xFF0C;&#x592A;&#x81EA;&#x5927;&#xFF0C;&#x592A;&#x50B2;&#x6162;&#xFF0C;&#x4E0D;&#x5C51;&#x7528;&#x73B0;&#x6709;&#x7684;&#x65B9;&#x6848;&#x53BB;&#x89E3;&#x51B3;&#x8001;&#x95EE;&#x9898;&#x3002;&#x5353;&#x8D8A;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x7684;&#x7CBE;&#x660E;&#x4E4B;&#x5904;&#x5728;&#x4E8E;&#x61C2;&#x5F97;&#x6B23;&#x8D4F;&#x548C;&#x91CD;&#x590D;&#x5229;&#x7528;&#x901A;&#x7528;&#x6A21;&#x5F0F;&#x3002;&#x597D;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x5E76;&#x4E0D;&#x5BB3;&#x6015;&#x7ECF;&#x5E38;&#x7684;&#x91CD;&#x6784;&#xFF08;&#x91CD;&#x5199;&#xFF09;&#x4ED6;&#x4EEC;&#x7684;&#x4EE3;&#x7801;&#x4EE5;&#x6C42;&#x8FBE;&#x5230;&#x6700;&#x597D;&#x6548;&#x679C;&#x3002;&#x5DEE;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x5199;&#x7684;&#x4EE3;&#x7801;&#x7F3A;&#x4E4F;&#x6574;&#x4F53;&#x6982;&#x5FF5;&#xFF0C;&#x5197;&#x4F59;&#xFF0C;&#x6CA1;&#x6709;&#x5C42;&#x6B21;&#xFF0C;&#x6CA1;&#x6709;&#x6A21;&#x5F0F;&#xFF0C;&#x5BFC;&#x81F4;&#x5F88;&#x96BE;&#x91CD;&#x6784;&#x3002;&#x628A;&#x8FD9;&#x4E9B;&#x4EE3;&#x7801;&#x6254;&#x6389;&#x91CD;&#x505A;&#x4E5F;&#x6BD4;&#x4FEE;&#x6539;&#x8D77;&#x6765;&#x5BB9;&#x6613;&#x3002;</p>
<p>&#x8F6F;&#x4EF6;&#x9075;&#x5FAA;&#x71B5;&#x7684;&#x5B9A;&#x5F8B;&#xFF0C;&#x8DDF;&#x5176;&#x5B83;&#x6240;&#x6709;&#x4E1C;&#x897F;&#x4E00;&#x6837;&#x3002;&#x6301;&#x7EED;&#x7684;&#x53D8;&#x66F4;&#x4F1A;&#x5BFC;&#x81F4;&#x8F6F;&#x4EF6;&#x8150;&#x70C2;&#xFF0C;&#x8150;&#x8680;&#x6389;&#x5BF9;&#x539F;&#x59CB;&#x8BBE;&#x8BA1;&#x7684;&#x5B8C;&#x6574;&#x6027;&#x6982;&#x5FF5;&#x3002;&#x8F6F;&#x4EF6;&#x7684;&#x8150;&#x70C2;&#x662F;&#x4E0D;&#x53EF;&#x907F;&#x514D;&#x7684;&#xFF0C;&#x4F46;&#x7A0B;&#x5E8F;&#x5458;&#x5728;&#x5F00;&#x53D1;&#x8F6F;&#x4EF6;&#x65F6;&#x6CA1;&#x6709;&#x8003;&#x8651;&#x5B8C;&#x6574;&#x6027;&#xFF0C;&#x5C06;&#x4F1A;&#x4F7F;&#x8F6F;&#x4EF6;&#x8150;&#x70C2;&#x7684;&#x66F4;&#x5FEB;&#xFF0C;&#x4EE5;&#x81F3;&#x4E8E;&#x8F6F;&#x4EF6;&#x5728;&#x8FD8;&#x6CA1;&#x6709;&#x5B8C;&#x6210;&#x4E4B;&#x524D;&#x5C31;&#x5DF2;&#x7ECF;&#x6BEB;&#x65E0;&#x4EF7;&#x503C;&#x4E86;&#x3002;&#x8F6F;&#x4EF6;&#x5B8C;&#x6574;&#x6027;&#x4E0A;&#x7684;&#x71B5;&#x53D8;&#x53EF;&#x80FD;&#x662F;&#x8F6F;&#x4EF6;&#x9879;&#x76EE;&#x5931;&#x8D25;&#x6700;&#x5E38;&#x89C1;&#x7684;&#x539F;&#x56E0;&#x3002;&#xFF08;&#x7B2C;&#x4E8C;&#x5927;&#x5E38;&#x89C1;&#x5931;&#x8D25;&#x539F;&#x56E0;&#x662F;&#x505A;&#x51FA;&#x7684;&#x4E0D;&#x662F;&#x5BA2;&#x6237;&#x60F3;&#x8981;&#x7684;&#x4E1C;&#x897F;&#x3002;&#xFF09;&#x8F6F;&#x4EF6;&#x8150;&#x70C2;&#x4F7F;&#x5F00;&#x53D1;&#x8FDB;&#x5EA6;&#x5448;&#x6307;&#x6570;&#x7EA7;&#x901F;&#x5EA6;&#x653E;&#x7F13;&#xFF0C;&#x5927;&#x91CF;&#x7684;&#x8F6F;&#x4EF6;&#x5728;&#x5931;&#x8D25;&#x4E4B;&#x524D;&#x90FD;&#x662F;&#x9762;&#x5BF9;&#x7740;&#x7A81;&#x589E;&#x7684;&#x65F6;&#x95F4;&#x8981;&#x6C42;&#x548C;&#x8D44;&#x91D1;&#x9884;&#x7B97;&#x3002;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#x4E0D;&#x53EF;&#x80FD;&#x4EC5;&#x4EC5;&#x901A;&#x8FC7;&#x589E;&#x52A0;&#x5728;&#x529E;&#x516C;&#x5BA4;&#x7684;&#x5DE5;&#x4F5C;&#x65F6;&#x95F4;&#x6216;&#x589E;&#x52A0;&#x4EBA;&#x624B;&#x6765;&#x52A0;&#x5FEB;&#x8FDB;&#x5EA6;&#x3002;</p>
<h4 id="&#x63D0;&#x9AD8;&#x6548;&#x7387;&#x7684;&#x5C0F;&#x8D34;&#x58EB;"><a href="#&#x63D0;&#x9AD8;&#x6548;&#x7387;&#x7684;&#x5C0F;&#x8D34;&#x58EB;" class="headerlink" title="&#x63D0;&#x9AD8;&#x6548;&#x7387;&#x7684;&#x5C0F;&#x8D34;&#x58EB;"></a>&#x63D0;&#x9AD8;&#x6548;&#x7387;&#x7684;&#x5C0F;&#x8D34;&#x58EB;</h4><p>&#x4E0D;&#x540C;&#x7684;&#x65F6;&#x95F4;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x8D28;&#x91CF;&#x7B49;&#x7EA7;&#x3002;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x53D8;&#x7684;&#x66F4;&#x52A0;&#x6709;&#x6548;&#x7387;&#xFF0C;&#x4F60;&#x5FC5;&#x987B;&#x610F;&#x8BC6;&#x5230;&#x8FD9;&#x4E2A;&#x4E8B;&#x5B9E;&#xFF0C;&#x5E76;&#x4E14;&#x5F88;&#x597D;&#x7684;&#x5904;&#x7406;&#x5B83;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x4F60;&#x5FC5;&#x987B;&#x5F88;&#x597D;&#x7684;&#x5229;&#x7528;&#x4E0D;&#x540C;&#x79CD;&#x7C7B;&#x7684;&#x65F6;&#x95F4;&#x3002;&#x5176;&#x6B21;&#xFF0C;&#x4F60;&#x5FC5;&#x987B;&#x8BA9;&#x4F60;&#x7684;&#x65F6;&#x95F4;&#x66F4;&#x6709;&#x6548;&#x7387;&#x3002;</p>
<p><strong>&#x628A;&#x4E8B;&#x60C5;&#x53D8;&#x5F97;&#x6709;&#x8DA3;</strong><br>&#x56F0;&#x96BE;&#x7684;&#x5DE5;&#x4F5C;&#x542C;&#x8D77;&#x6765;&#x4E0D;&#x4F1A;&#x4EE4;&#x4EBA;&#x611F;&#x5230;&#x6109;&#x60A6;&#xFF0C;&#x4F46;&#x662F;&#x4E00;&#x4E2A;&#x56F0;&#x96BE;&#x7684;&#x95EE;&#x9898;&#x80FD;&#x8BA9;&#x4F60;&#x96C6;&#x4E2D;&#x5168;&#x90E8;&#x6CE8;&#x610F;&#x529B;&#xFF0C;&#x800C;&#x4E14;&#x5F53;&#x4F60;&#x5B8C;&#x6210;&#x5B83;&#x7684;&#x65F6;&#x5019;&#x4F60;&#x4F1A;&#x611F;&#x5230;&#x5F88;&#x6709;&#x6210;&#x5C31;&#x611F;&#x3002;&#x5E2E;&#x52A9;&#x81EA;&#x5DF1;&#x5B8C;&#x6210;&#x4E00;&#x4EF6;&#x4E8B;&#x7684;&#x79D8;&#x5BC6;&#x4E0D;&#x662F;&#x8BF4;&#x670D;&#x81EA;&#x5DF1;&#x5FC5;&#x987B;&#x5B8C;&#x6210;&#x5B83;&#xFF0C;&#x800C;&#x662F;&#x8BF4;&#x670D;&#x81EA;&#x5DF1;&#x8FD9;&#x4EF6;&#x4E8B;&#x786E;&#x5B9E;&#x975E;&#x5E38;&#x6709;&#x610F;&#x601D;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4EF6;&#x4E8B;&#x6CA1;&#x6709;&#x610F;&#x601D;&#x7684;&#x8BDD;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x505A;&#x7684;&#x5C31;&#x662F;&#x8BA9;&#x5B83;&#x53D8;&#x5F97;&#x6709;&#x610F;&#x601D;&#x3002;</p>
<p><strong>&#x7406;&#x89E3;&#x4EFB;&#x52A1;</strong><br>&#x901A;&#x5E38;&#x6765;&#x8BF4;&#x89E3;&#x51B3;&#x4E00;&#x4E2A;&#x56F0;&#x96BE;&#x95EE;&#x9898;&#x9700;&#x8981;&#x4E00;&#x4E9B;&#x7075;&#x611F;&#x3002;&#x5982;&#x679C;&#x4F60;&#x5BF9;&#x90A3;&#x4E2A;&#x9886;&#x57DF;&#x5E76;&#x4E0D;&#x719F;&#x6089;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x4ECE;&#x7814;&#x7A76;&#x8FD9;&#x4E2A;&#x9886;&#x57DF;&#x5F00;&#x59CB;&#xFF0C;&#x501F;&#x9274;&#x4E00;&#x4E0B;&#x5176;&#x4ED6;&#x4EBA;&#x7684;&#x7ECF;&#x9A8C;&#xFF0C;&#x6162;&#x6162;&#x7684;&#x7814;&#x7A76;&#x7406;&#x89E3;&#x8FD9;&#x4E2A;&#x9886;&#x57DF;&#xFF0C;&#x5E76;&#x4E14;&#x505A;&#x4E00;&#x4E9B;&#x5C0F;&#x7684;&#x5C1D;&#x8BD5;&#x770B;&#x770B;&#x4F60;&#x80FD;&#x5426;&#x641E;&#x5B9A;&#x8FD9;&#x4E2A;&#x9886;&#x57DF;&#x3002;</p>
<p>&#x88AB;&#x6307;&#x6D3E;&#x7684;&#x4EFB;&#x52A1;&#x662F;&#x90A3;&#x4E9B;&#x4F60;&#x88AB;&#x8981;&#x6C42;&#x5B8C;&#x6210;&#x7684;&#x4EFB;&#x52A1;&#x3002;&#x5F88;&#x591A;&#x5FC3;&#x7406;&#x5B66;&#x5B9E;&#x9A8C;&#x90FD;&#x8868;&#x660E;&#xFF0C;&#x5F53;&#x4F60;&#x201D;&#x523A;&#x6FC0;&#x201D;&#x5176;&#x4ED6;&#x4EBA;&#x505A;&#x4EC0;&#x4E48;&#x4E8B;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4ED6;&#x4EEC;&#x53CD;&#x5012;&#x4E0D;&#x5BB9;&#x6613;&#x505A;&#x597D;&#x90A3;&#x4E2A;&#x4E8B;&#x3002;&#x5956;&#x52B1;&#xFF0C;&#x60E9;&#x7F5A;&#x7B49;&#x5916;&#x90E8;&#x523A;&#x6FC0;&#x4F1A;&#x627C;&#x6740;&#x201D;&#x5185;&#x5728;&#x52A8;&#x673A;&#x201D; &#x2014;&#x2014; &#x4F60;&#x5BF9;&#x4E8E;&#x67D0;&#x4E2A;&#x95EE;&#x9898;&#x53D1;&#x81EA;&#x5185;&#x5FC3;&#x7684;&#x5174;&#x8DA3;&#x3002;&#x4EBA;&#x7C7B;&#x7684;&#x5927;&#x8111;&#x5BF9;&#x4E8E;&#x88AB;&#x8981;&#x6C42;&#x505A;&#x7684;&#x4E8B;&#x6709;&#x5148;&#x5929;&#x7684;&#x6297;&#x62D2;&#x529B;&#x3002;</p>
<p>&#x5FC3;&#x7406;&#x6697;&#x793A;&#x662F;&#x5F3A;&#x5927;&#x7684;&#xFF0C;&#x5728;&#x9762;&#x5BF9;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x65F6;&#xFF0C;&#x5F53;&#x6211;&#x4EEC;&#x4E00;&#x6B65;&#x6B65;&#x7EC6;&#x5316;&#x4E4B;&#x540E;&#x53EA;&#x9700;&#x544A;&#x8BC9;&#x81EA;&#x5DF1;&#xFF0C;&#x201C;OK&#xFF0C;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x5F88;&#x7B80;&#x5355;&#x3002;&#x201D;&#x6162;&#x6162;&#x505A;&#x5C31;&#x505A;&#x51FA;&#x6765;&#x4E86;&#x3002;</p>
<p><strong>&#x628A;&#x4EFB;&#x52A1;&#x7EC6;&#x5206;</strong><br>&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#x5F88;&#x8270;&#x5DE8;&#x7684;&#x539F;&#x56E0;&#x4E4B;&#x4E00;&#x662F;&#x8FD9;&#x4E2A;&#x4EFB;&#x52A1;&#x5F88;&#x5B8F;&#x5927;&#x3002;&#x5BF9;&#x4E8E;&#x6BCF;&#x4E00;&#x4E2A;&#x6BD4;&#x8F83;&#x5927;&#x7684;&#x9879;&#x76EE;&#xFF0C;&#x6211;&#x90FD;&#x4F1A;&#x8003;&#x8651;&#x6211;&#x9700;&#x8981;&#x5B8C;&#x6210;&#x4E00;&#x8FDE;&#x4E32;&#x4EC0;&#x4E48;&#x6837;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x5E76;&#x4E14;&#x5C06;&#x8FD9;&#x4E9B;&#x4EFB;&#x52A1;&#x52A0;&#x5165;&#x5230;&#x6211;&#x7684;&#x5F85;&#x529E;&#x4E8B;&#x9879;&#x5217;&#x8868;&#x4E2D;&#x53BB;&#x3002;&#x540C;&#x6837;&#xFF0C;&#x5F53;&#x6211;&#x505A;&#x5B8C;&#x4E00;&#x4E9B;&#x4EFB;&#x52A1;&#x4E4B;&#x540E;&#x6211;&#x4F1A;&#x628A;&#x63A5;&#x4E0B;&#x6765;&#x9700;&#x8981;&#x5B8C;&#x6210;&#x7684;&#x4EFB;&#x52A1;&#x518D;&#x52A0;&#x5165;&#x4EFB;&#x52A1;&#x5217;&#x8868;&#x4E2D;&#x53BB;&#x3002;&#x4E00;&#x4E2A;&#x597D;&#x7684;&#x4EFB;&#x52A1;&#x662F;&#x4F60;&#x80FD;&#x591F;&#x7ACB;&#x5373;&#x62FF;&#x6765;&#x5B9E;&#x65BD;&#x7684;&#x3002;&#x5F53;&#x4F60;&#x5B8C;&#x6210;&#x4E86;&#x4E0A;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#x540E;&#xFF0C;&#x4E0B;&#x4E00;&#x6B65;&#x5C31;&#x4F1A;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x6E05;&#x6670;&#x3002;&#x8FD9;&#x6837;&#x4F60;&#x5C31;&#x6784;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;&#x5F15;&#x64CE;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#x90FD;&#x4F1A;&#x901A;&#x5411;&#x4E0B;&#x4E00;&#x4E2A;&#x4EFB;&#x52A1;&#x3002;<br>&#x3000;&#x3000;<br>&#x53E6;&#x4E00;&#x4E2A;&#x8BA9;&#x4EFB;&#x52A1;&#x53D8;&#x5F97;&#x8270;&#x5DE8;&#x7684;&#x539F;&#x56E0;&#x5C31;&#x662F;&#x5B83;&#x592A;&#x590D;&#x6742;&#x4E86;&#x3002;&#x63D0;&#x9AD8;&#x5B8C;&#x5584;&#x4E00;&#x4E9B;&#x5DF2;&#x6709;&#x7684;&#x4E1C;&#x897F;&#x6BD4;&#x4ECE;&#x5934;&#x521B;&#x5EFA;&#x4E1C;&#x897F;&#x66F4;&#x5BB9;&#x6613;&#x3002;&#x6700;&#x91CD;&#x8981;&#x7684;&#x662F;&#x771F;&#x6B63;&#x505A;&#x4E86;&#x4E00;&#x4E9B;&#x5DE5;&#x4F5C;&#xFF0C;&#x771F;&#x6B63;&#x7684;&#x6709;&#x8FDB;&#x5C55;&#x3002;&#x4E00;&#x65E6;&#x4F60;&#x660E;&#x786E;&#x4E86;&#x4F60;&#x7684;&#x4EFB;&#x52A1;&#x4E4B;&#x540E;&#xFF0C;&#x9010;&#x6B65;&#x7B80;&#x5316;&#xFF0C;&#x9010;&#x4E00;&#x5B8C;&#x5584;&#xFF0C;&#x4F60;&#x5C31;&#x53EF;&#x4EE5;&#x66F4;&#x6E05;&#x695A;&#x7684;&#x5224;&#x65AD;&#x5B83;&#xFF0C;&#x66F4;&#x5BB9;&#x6613;&#x7684;&#x7406;&#x89E3;&#x5B83;&#x3002;<br>&#x3000;<br><strong>&#x5217;&#x4E00;&#x4E2A;&#x6E05;&#x5355;</strong><br>&#x628A;&#x8981;&#x505A;&#x7684;&#x4E8B;&#x5217;&#x6210;&#x4E86;&#x4E00;&#x4E2A;&#x6E05;&#x5355;&#xFF0C;&#x4F60;&#x5C31;&#x53EF;&#x4EE5;&#x66F4;&#x597D;&#x7684;&#x5206;&#x7C7B;&#x7EC4;&#x7EC7;&#x5B83;&#x4EEC;&#x3002;&#x5927;&#x90E8;&#x5206;&#x9879;&#x76EE;&#x90FD;&#x5305;&#x62EC;&#x5F88;&#x591A;&#x4E0D;&#x540C;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x6240;&#x4EE5;&#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x5408;&#x9002;&#x7684;&#x65F6;&#x95F4;&#x53BB;&#x505A;&#x67D0;&#x4E00;&#x90E8;&#x5206;&#x3002;</p>
<p><strong>&#x4E00;&#x4E2A;&#x65F6;&#x95F4;&#x53EA;&#x505A;&#x4E00;&#x4EF6;&#x4E8B;</strong><br>&#x4E00;&#x4E2A;&#x5F88;&#x591A;&#x4EBA;&#x90FD;&#x77E5;&#x9053;&#x7684;&#x79D8;&#x5BC6;&#x662F;&#xFF1A;&#x5982;&#x679C;&#x4F60;&#x8BA4;&#x51C6;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x6295;&#x5165;&#x5168;&#x90E8;&#x7CBE;&#x529B;&#x53BB;&#x89E3;&#x51B3;&#x5B83;&#xFF0C;&#x8FD9;&#x6837;&#x4F60;&#x7684;&#x6548;&#x7387;&#x662F;&#x6700;&#x9AD8;&#x7684;&#x3002;&#x5BF9;&#x4E8E;&#x90A3;&#x4E9B;&#x9700;&#x8981;&#x96C6;&#x4E2D;&#x6CE8;&#x610F;&#x529B;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x5C3D;&#x91CF;&#x907F;&#x514D;&#x88AB;&#x6253;&#x6270;&#x3002;&#x4E00;&#x4E2A;&#x5F88;&#x7B80;&#x5355;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x53BB;&#x4E00;&#x4E2A;&#x6CA1;&#x4EBA;&#x80FD;&#x6253;&#x6270;&#x4F60;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#x662F;&#x544A;&#x8BC9;&#x5468;&#x56F4;&#x7684;&#x4EBA;&#x672A;&#x6765;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x4E0D;&#x8981;&#x6253;&#x6270;&#x4F60;&#x3002;</p>
<p><strong>&#x4E0D;&#x8981;&#x6298;&#x78E8;&#x81EA;&#x5DF1;</strong><br>&#x6548;&#x7387;&#x7684;&#x771F;&#x6B63;&#x79D8;&#x5BC6;&#x5728;&#x4E8E;&#x201D;&#x8046;&#x542C;&#x81EA;&#x5DF1;&#x201D;&#x3002;&#x5F53;&#x4F60;&#x611F;&#x5230;&#x5F88;&#x997F;&#xFF0C;&#x5F88;&#x7D2F;&#xFF0C;&#x5F88;&#x7126;&#x8E81;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x7684;&#x65F6;&#x95F4;&#x7684;&#x8D28;&#x91CF;&#x4F1A;&#x5F88;&#x4F4E;&#x3002;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x5C31;&#x662F;&#xFF1A;&#x53BB;&#x5403;&#xFF0C;&#x53BB;&#x7761;&#xFF0C;&#x53BB;&#x8FD0;&#x52A8;&#x3002;&#x5BF9;&#x81EA;&#x5DF1;&#x8BF4;&#x201C;&#x867D;&#x7136;&#x6211;&#x5F88;&#x7D2F;&#x4E86;&#xFF0C;&#x4F46;&#x6211;&#x4E0D;&#x80FD;&#x4F11;&#x606F;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x5FC5;&#x987B;&#x8981;&#x5DE5;&#x4F5C;&#x201D;&#x4F1A;&#x8BA9;&#x4F60;&#x611F;&#x5230;&#x81EA;&#x5DF1;&#x5F88;&#x52AA;&#x529B;&#xFF0C;&#x4F46;&#x4E8B;&#x5B9E;&#x4E0A;&#x4F11;&#x606F;&#x4E4B;&#x540E;&#x4F60;&#x7684;&#x6548;&#x7387;&#x4F1A;&#x66F4;&#x9AD8;&#x3002;&#x65E2;&#x7136;&#x4F60;&#x8FDF;&#x65E9;&#x90FD;&#x8981;&#x7761;&#x89C9;&#xFF0C;&#x8FD8;&#x4E0D;&#x5982;&#x5148;&#x4F11;&#x606F;&#x597D;&#xFF0C;&#x6765;&#x63D0;&#x9AD8;&#x5269;&#x4F59;&#x65F6;&#x95F4;&#x5185;&#x7684;&#x6548;&#x7387;&#x3002;</p>
<p>&#x8DDF;&#x5FEB;&#x4E50;&#x7684;&#x4EBA;&#x76F8;&#x5904;&#x4F1A;&#x4E5F;&#x4F1A;&#x8BA9;&#x4F60;&#x53D8;&#x5F97;&#x5FEB;&#x4E50;&#xFF0C;&#x4E5F;&#x4F1A;&#x8BA9;&#x4F60;&#x5FC3;&#x6001;&#x66F4;&#x653E;&#x677E;&#x3002;&#x4E5F;&#x8BB8;&#x5F88;&#x591A;&#x4EBA;&#x613F;&#x610F;&#x8EB2;&#x5728;&#x5C4B;&#x5B50;&#x91CC;&#xFF0C;&#x4E0D;&#x4E0E;&#x5176;&#x4ED6;&#x4EBA;&#x63A5;&#x89E6;&#xFF0C;&#x57CB;&#x5934;&#x5E72;&#x6D3B;&#xFF0C;&#x4ED6;&#x4EEC;&#x89C9;&#x5F97;&#x8FD9;&#x6837;&#x7684;&#x8BDD;&#x65F6;&#x95F4;&#x624D;&#x6CA1;&#x6709;&#x88AB;&#x201C;&#x6D6A;&#x8D39;&#x201D;&#xFF0C;&#x4F46;&#x4E8B;&#x5B9E;&#x4E0A;&#x8FD9;&#x4F1A;&#x8BA9;&#x4ED6;&#x4EEC;&#x53D8;&#x5F97;&#x60C5;&#x7EEA;&#x4F4E;&#x843D;&#xFF0C;&#x5DE5;&#x4F5C;&#x6548;&#x7387;&#x4E5F;&#x4F1A;&#x5927;&#x5927;&#x4E0B;&#x964D;&#x3002;&#x548C;&#x670B;&#x53CB;&#x4EEC;&#x5728;&#x4E00;&#x8D77;&#x5DE5;&#x4F5C;&#xFF0C;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x7CBE;&#x795E;&#x4E0A;&#x7684;&#x538B;&#x529B;&#x5927;&#x5BB6;&#x53EF;&#x4EE5;&#x4E92;&#x76F8;&#x5206;&#x62C5;&#xFF0C;&#x53E6;&#x4E00;&#x65B9;&#x9762;&#xFF0C;&#x548C;&#x5176;&#x4ED6;&#x4EBA;&#x5728;&#x4E00;&#x8D77;&#x53EF;&#x4EE5;&#x8BA9;&#x4F60;&#x4E13;&#x6CE8;&#x4E8E;&#x5DE5;&#x4F5C;&#x800C;&#x4E0D;&#x662F;&#x65F6;&#x5E38;&#x5206;&#x5FC3;&#x3002;</p>
<p><strong>&#x62D2;&#x7EDD;&#x62D6;&#x6C93;</strong><br>&#x5173;&#x4E8E;&#x6548;&#x7387;&#x5927;&#x5BB6;&#x6700;&#x5927;&#x7684;&#x95EE;&#x9898;&#x8FD8;&#x662F;&#x201C;&#x62D6;&#x6C93;&#x201D;&#x3002;&#x867D;&#x7136;&#x5F88;&#x591A;&#x4EBA;&#x4E0D;&#x627F;&#x8BA4;&#xFF0C;&#x4F46;&#x662F;&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x4EBA;&#x90FD;&#x6216;&#x591A;&#x6216;&#x5C11;&#x7684;&#x4F1A;&#x62D6;&#x6C93;&#x3002;&#x62D6;&#x6C93;&#x4ECE;&#x65C1;&#x89C2;&#x8005;&#x6765;&#x770B;&#xFF0C;&#x4F60;&#x5728;&#x505A;&#x597D;&#x73A9;&#x7684;&#x4E8B;(&#x5982;&#x73A9;&#x6E38;&#x620F;&#xFF0C;&#x770B;&#x65B0;&#x95FB;)&#x800C;&#x4E0D;&#x662F;&#x505A;&#x771F;&#x6B63;&#x7684;&#x5DE5;&#x4F5C;&#x3002;&#x62D2;&#x7EDD;&#x62D6;&#x6C93;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x8981;&#x56DE;&#x5230;&#x7B2C;&#x4E00;&#x70B9;&#x770B;&#x770B;&#x60A8;&#x5F53;&#x524D;&#x7684;&#x5DE5;&#x4F5C;&#x662F;&#x5426;&#x663E;&#x5F97;&#x6709;&#x8DA3;&#xFF0C;&#x662F;&#x5426;&#x88AB;&#x5408;&#x7406;&#x5B89;&#x6392;&#x3002;</p>
<p><strong>&#x4E0D;&#x8FFD;&#x6C42;&#x5B8C;&#x7F8E;</strong><br>&#x5B8C;&#x7F8E;&#x4E3B;&#x4E49;&#x662F;&#x751F;&#x4EA7;&#x529B;&#x7684;&#x7ECA;&#x811A;&#x77F3;&#xFF1A;&#x5B8C;&#x7F8E;&#x4E3B;&#x4E49;&#x8005;&#x5B8C;&#x6210;&#x4EFB;&#x52A1;&#x9700;&#x8981;&#x82B1;&#x8D39;&#x66F4;&#x591A;&#x7684;&#x65F6;&#x95F4;&#x3002;&#x5B8C;&#x7F8E;&#x4E3B;&#x4E49;&#x8005;&#x56E0;&#x4E3A;&#x7B49;&#x5F85;&#x5B8C;&#x7F8E;&#x65F6;&#x523B;&#x800C;&#x803D;&#x6401;&#x3002;&#x5C31;&#x5546;&#x4E1A;&#x800C;&#x8A00;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x7B49;&#x5230;&#x4E86;&#x5B8C;&#x7F8E;&#x65F6;&#x523B;&#x65F6;&#x95F4;&#x5DF2;&#x7ECF;&#x592A;&#x8FDF;&#x3002;&#x5B8C;&#x7F8E;&#x4E3B;&#x4E49;&#x5F80;&#x5F80;&#x56E0;&#x4E3A;&#x4E00;&#x53F6;&#x969C;&#x76EE;&#x800C;&#x4E0D;&#x89C1;&#x6CF0;&#x5C71;&#xFF0C;&#x56E0;&#x4E3A;&#x8FC7;&#x4E8E;&#x5173;&#x6CE8;&#x5C0F;&#x4E8B;&#x60C5;&#x800C;&#x9519;&#x5931;&#x4E86;&#x5927;&#x573A;&#x9762;&#x3002;</p>
<p>&#x4E0D;&#x8FFD;&#x6C42;&#x5B8C;&#x7F8E;&#x4E0D;&#x662F;&#x8BF4;&#x6577;&#x884D;&#x4E86;&#x4E8B;&#xFF0C;&#x800C;&#x662F;&#x5206;&#x6E05;&#x4E8B;&#x7269;&#x7684;&#x4E3B;&#x6B21;&#xFF0C;&#x5408;&#x7406;&#x7684;&#x5B89;&#x6392;&#x65F6;&#x95F4;&#xFF0C;&#x6709;&#x6761;&#x4E0D;&#x7D0A;&#x3002;&#x6700;&#x540E;&#xFF0C;&#x5E0C;&#x671B;&#x60A8;&#x80FD;&#x5728;&#x65B0;&#x7684;&#x4E00;&#x5E74;&#x9047;&#x5230;&#x6700;&#x597D;&#x7684;&#x81EA;&#x5DF1;&#x3002;</p>

            <div class="clearfix"></div>
            <hr class="nogutter">
        </div>


        <nav class="pagination" role="pagination">


<div class="ds-share flat" data-thread-key="2013/02/03/从平凡到卓越/" data-title="从平凡到卓越" data-images="https://avatars0.githubusercontent.com/u/10378248?v=3&s=460" data-content="从平凡到卓越 是最近写的文章，希望能帮到您！" data-url="https://dangdangfeng.github.io/2013/02/03/从平凡到卓越/">
    <div class="ds-share-inline">
      <ul  class="ds-share-icons-16">
        
        <li data-toggle="ds-share-icons-more"><a class="ds-more" href="javascript:void(0);">分享到：</a></li>
        <li><a class="ds-weibo" href="javascript:void(0);" data-service="weibo">微博</a></li>
        <li><a class="ds-qzone" href="javascript:void(0);" data-service="qzone">QQ空间</a></li>
        <li><a class="ds-qqt" href="javascript:void(0);" data-service="qqt">腾讯微博</a></li>
        <li><a class="ds-wechat" href="javascript:void(0);" data-service="wechat">微信</a></li>
        
      </ul>
      <div class="ds-share-icons-more">
      </div>
    </div>
 </div>

 <br/>

    
    <a class="pull-left" href="/2013/03/13/Mac上统计代码行数/" style="float: left;">
        ← Mac上统计代码行数
    </a>
    
    
    <a class="pull-right" href="/2013/01/01/iOS视图生命周期简析/">
        iOS视图生命周期简析 →
    </a>
    

    
</nav>



        
        <div class="duoshuo">


<div class="ds-thread" data-thread-key="2013/02/03/从平凡到卓越/" data-title="从平凡到卓越" data-url="https://dangdangfeng.github.io/2013/02/03/从平凡到卓越/"></div>



<script type="text/javascript">
var duoshuoQuery = {short_name:"deter"};
(function() {
	var ds = document.createElement('script');
	ds.type = 'text/javascript';ds.async = true;
	ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
	ds.charset = 'UTF-8';
	(document.getElementsByTagName('head')[0] 
	 || document.getElementsByTagName('body')[0]).appendChild(ds);
})();
</script>
</div>
    </div>
</section>


      
<!-- ============================ Footer =========================== -->

<footer>
    <div class="container">
            <div class="copy">
                <p>
                    &copy; 2010<script>new Date().getFullYear()>2010&&document.write("-"+new Date().getFullYear());</script>, Content By 吴白. All Rights Reserved.
                </p>
                <p>Theme By <a href="//go.kieran.top" style="color: #767D84">Kieran</a></p>
            </div>
            <div class="social">
                <ul>
                    
                    <li><a href="https://github.com/" title="Github" target="_blank"><i class="icon-github"></i></a>&nbsp;</li>
                    
                    
                    <li><a href="https://twitter.com/" title="Twitter" target="_blank"><i class="icon-twitter"></i></a>&nbsp;</li>
                    
                    
                    <li><a href="https://www.facebook.com/" title="Facebook" target="_blank"><i class="icon-facebook"></i></a>&nbsp;</li>
                    
                    
                    <li><a href="https://google.com/" title="Google-Plus" target="_blank"><i class="icon-google-plus"></i></a>&nbsp;</li>
                    
                    
                    <li><a href="http://weibo.com/" title="Sina-Weibo" target="_blank"><i class="icon-sina-weibo"></i></a>&nbsp;</li>
                    
                </ul>
            </div>
            <div class="clearfix"> </div>
        </div>
</footer>

<!-- ============================ END Footer =========================== -->
      <!-- Load our scripts -->
        
<!-- Resizable 'on-demand' full-height hero -->
<script type="text/javascript">
    
    var resizeHero = function () {
        var hero = $(".cover,.heightblock"),
            window1 = $(window);
        hero.css({
            "height": window1.height()
        });
    };
    
    resizeHero();
    
    $(window).resize(function () {
        resizeHero();
    });
</script>
<script src="/js/plugins.min.js"></script><!-- Bootstrap core and concatenated plugins always load here -->
<script src="/js/jquery.flexslider-min.js"></script><!-- Flexslider plugin -->
<script src="/js/scripts.js"></script><!-- Theme scripts -->

<!-- Initiate flexslider plugin -->
<script type="text/javascript">
    $(document).ready(function($) {
      $('.flexslider').flexslider({
        animation: "fade",
        prevText: "",
        nextText: "",
        directionNav: true
      });
    });
</script>

</body>
</html>
