<!DOCTYPE html>
<!--[if lte IE 8 ]>
<html class="ie" xmlns="http://www.w3.org/1999/xhtml" xml:lang="en-US" lang="en-US">
<![endif]-->
<!--[if (gte IE 9)|!(IE)]><!-->
<!--
***************  *      *     *
      8          *    *       *
      8          *  *         *
      8          **           *
      8          *  *         *
      8          *    *       *
      8          *      *     *
      8          *        *   ***********    -----Theme By Kieran(http://go.kieran.top)
-->
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en-US" lang="en-US">
<!--<![endif]-->

<head>
  <title>程序员进阶的五个瞬间 | 流城</title>
  <!-- Meta data -->
    <meta http-equiv="Content-Type" content="text/html" charset="UTF-8" >
    <meta http-equiv="X-UA-Compatible" content="IE=edge"/>
    <meta name="viewport" content="width=device-width, initial-scale=1.0" />
    <meta name="generator" content="流城">
    <meta name="author" content="吴白">
    <meta name="description" content="" />
    <meta name="keywords" content="" />

    <!-- Favicon, (keep icon in root folder) -->
    <link rel="Shortcut Icon" href="/img/favicon.ico" type="image/ico">

    <link rel="alternate" href="/atom.xml" title="流城" type="application/atom+xml">
    <link rel="stylesheet" href="/css/all.css" media="screen" type="text/css">
	
    <link rel="stylesheet" href="/highlightjs/vs.css" type="text/css">
    
    

    <!-- Custom stylesheet, (add custom styles here, always load last) -->
    <!-- Load our stylesheet for IE8 -->
    <!--[if IE 8]>
    <link rel="stylesheet" type="text/css" href="/css/ie8.css" />
    <![endif]-->

    <!-- Google Webfonts (Monserrat 400/700, Open Sans 400/600) -->
    <!--<link href='//fonts.useso.com/css?family=Montserrat:400,700' rel='stylesheet' type='text/css'>-->
    <!--<link href='//fonts.useso.com/css?family=Open+Sans:400,600' rel='stylesheet' type='text/css'>-->

    <!-- Load our fonts individually if IE8+, to avoid faux bold & italic rendering -->
    <!--[if IE]>
    <!--<link href='http://fonts.useso.com/css?family=Montserrat:400' rel='stylesheet' type='text/css'> -->
    <!--<link href='http://fonts.useso.com/css?family=Montserrat:700' rel='stylesheet' type='text/css'> -->
    <!--<link href='http://fonts.useso.com/css?family=Open+Sans:400' rel='stylesheet' type='text/css'>-->
    <!--<link href='http://fonts.useso.com/css?family=Open+Sans:600' rel='stylesheet' type='text/css'>-->
    <![endif]-->

    <!-- jQuery | Load our jQuery, with an alternative source fallback to a local version if request is unavailable -->
    <script src="/js/jquery-1.11.1.min.js"></script>
    <script>window.jQuery || document.write('<script src="js/jquery-1.11.1.min.js"><\/script>')</script>

    <!-- Load these in the <head> for quicker IE8+ load times -->
    <!-- HTML5 shim and Respond.js IE8 support of HTML5 elements and media queries -->
    <!--[if lt IE 9]>
    <script src="/js/html5shiv.min.js"></script>
    <script src="/js/respond.min.js"></script>
    <![endif]-->










  
  
  <link rel="alternate" type="application/atom+xml" title="Atom 0.3" href="atom.xml">
  
  

  
  <style>.col-md-8.col-md-offset-2.opening-statement img{display:none;}</style>
</head>

<!--
<body class="post-template">
-->
<body id="index" class="lightnav animsition">

      <!-- ============================ Off-canvas navigation =========================== -->

    <div class="sb-slidebar sb-right sb-style-overlay sb-momentum-scrolling">
        <div class="sb-close" aria-label="Close Menu" aria-hidden="true">
            <img src="/img/close.png" alt="Close"/>
        </div>
        <!-- Lists in Slidebars -->
        <ul class="sb-menu">
            <li><a href="/" class="animsition-link" title="Home">Home</a></li>
            <li><a href="/archives" class="animsition-link" title="archive">archives</a></li>
            <!-- Dropdown Menu -->
			 
            <li>
                <a class="sb-toggle-submenu">Works<span class="sb-caret"></span></a>
                <ul class="sb-submenu">
                    
                        <li><a href="http://www.gome.com.cn" target="_BLANK" class="animsition-link">Gome</a></li>
                    
                        <li><a href="http://www.yintai.com" target="_BLANK" class="animsition-link">YinTai</a></li>
                    
                </ul>
            </li>
            
            
            
            <li>
                <a class="sb-toggle-submenu">Links<span class="sb-caret"></span></a>
                <ul class="sb-submenu">
                    
                    <li><a href="http://www.jianshu.com/users/211925b3ca7c/latest_articles" class="animsition-link">吴白</a></li>
                    
                    <li><a href="http://www.jianshu.com/users/19f4bf67c705/latest_articles" class="animsition-link">吴禅</a></li>
                    
                </ul>
            </li>
            
        </ul>
        <!-- Lists in Slidebars -->
        <ul class="sb-menu secondary">
            <li><a href="/about" class="animsition-link" title="about">About</a></li>
            <li><a href="/atom.xml" class="animsition-link" title="rss">RSS</a></li>
        </ul>
    </div>
    
    <!-- ============================ END Off-canvas navigation =========================== -->

    <!-- ============================ #sb-site Main Page Wrapper =========================== -->

    <div id="sb-site">
        <!-- #sb-site - All page content should be contained within this id, except the off-canvas navigation itself -->

        <!-- ============================ Header & Logo bar =========================== -->

        <div id="navigation" class="navbar navbar-fixed-top">
            <div class="navbar-inner">
                <div class="container">
                    <!-- Nav logo -->
                    <div class="logo">
                        <a href="/" title="Logo" class="animsition-link">
                         <img src="/img/logo.png" alt="Logo" width="35px;"/> 
                        </a>
                    </div>
                    <!-- // Nav logo -->
                    <!-- Info-bar -->
                    <nav>
                        <ul class="nav">
                            <li><a href="/" class="animsition-link">流城</a></li>
                            <li class="nolink"><span>Always </span>Creative.</li>
                            
                            <li><a href="https://github.com/" title="Github" target="_blank"><i class="icon-github"></i></a></li>
                            
                            
                            <li><a href="https://twitter.com/" title="Twitter" target="_blank"><i class="icon-twitter"></i></a></li>
                            
                            
                            <li><a href="https://www.facebook.com/" title="Facebook" target="_blank"><i class="icon-facebook"></i></a></li>
                            
                            
                            <li><a href="https://google.com/" title="Google-Plus" target="_blank"><i class="icon-google-plus"></i></a></li>
                            
                            
                            <li><a href="http://weibo.com/" title="Sina-Weibo" target="_blank"><i class="icon-sina-weibo"></i></a></li>
                            
                            <li class="nolink"><span>Welcome!</span></li>
                        </ul>
                    </nav>
                    <!--// Info-bar -->
                </div>
                <!-- // .container -->
                <div class="learnmore sb-toggle-right">More</div>
                <button type="button" class="navbar-toggle menu-icon sb-toggle-right" title="More">
                <span class="sr-only">Toggle navigation</span>
                <span class="icon-bar before"></span>
                <span class="icon-bar main"></span>
                <span class="icon-bar after"></span>
                </button>
            </div>
            <!-- // .navbar-inner -->
        </div>

        <!-- ============================ Header & Logo bar =========================== -->


      
<section id="intro">
    <div class="container">
        <div class="row col-md-offset-2">
            <div class="col-md-8">
    			<span class="post-meta">
      <time datetime="2012-12-01T13:52:03.000Z" itemprop="datePublished">
          2012-12-01
      </time>
    
    
    | 
    <a href='/tags/杂谈/'>杂谈</a>
    
    
</span>
                <h1>程序员进阶的五个瞬间</h1>
            </div>
        </div>
        <!--<div class="col-md-8 col-md-offset-2">-->
        <div class="col-md-offset-2">
      		<blockquote>
<p>&#x201C;&#x5F53;&#x4F60;&#x4E0D;&#x521B;&#x9020;&#x4E1C;&#x897F;&#x65F6;&#xFF0C;&#x4F60;&#x53EA;&#x4F1A;&#x6839;&#x636E;&#x81EA;&#x5DF1;&#x7684;&#x611F;&#x89C9;&#x800C;&#x4E0D;&#x662F;&#x80FD;&#x529B;&#x53BB;&#x770B;&#x5F85;&#x95EE;&#x9898;&#x3002;&#x201D; </p>
</blockquote>
<p>&#x4E4B;&#x524D;&#x6709;&#x4E2A;&#x8BA8;&#x8BBA;&#xFF1A;&#x5B9E;&#x73B0;&#x540C;&#x6837;&#x529F;&#x80FD;&#xFF0C;&#x7B80;&#x6D01;&#x4EE3;&#x7801;&#x4E00;&#x5B9A;&#x6BD4;&#x590D;&#x6742;&#x4EE3;&#x7801;&#x6548;&#x7387;&#x9AD8;&#x5417;&#xFF1F;&#x6709;&#x7684;&#x8BF4;&#xFF0C;&#x8FD8;&#x5F97;&#x770B;&#x7B97;&#x6CD5;&#xFF0C;&#x5982;&#x679C;&#x7B97;&#x6CD5;&#x76F8;&#x540C;&#xFF0C;&#x7B80;&#x6D01;&#x4EE3;&#x7801;&#x6548;&#x7387;&#x5E94;&#x8BE5;&#x4F1A;&#x9AD8;&#x4E00;&#x4E9B;&#x3002;&#x6709;&#x7684;&#x8BF4;&#xFF0C;&#x5373;&#x4F7F;&#x7B97;&#x6CD5;&#x76F8;&#x540C;&#xFF0C;&#x7B80;&#x6D01;&#x4EE3;&#x7801;&#x4E5F;&#x4E0D;&#x89C1;&#x5F97;&#x6BD4;&#x590D;&#x6742;&#x4EE3;&#x7801;&#x6548;&#x7387;&#x9AD8;&#xFF0C;&#x800C;&#x5E94;&#x5C3D;&#x53EF;&#x80FD;&#x51CF;&#x5C11;&#x5FAA;&#x73AF;&#x7684;&#x4F7F;&#x7528;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5C11;&#x7528;&#x591A;&#x91CD;&#x5FAA;&#x73AF;&#xFF0C;&#x6216;&#x8005;&#x5C3D;&#x53EF;&#x80FD;&#x5728;&#x4E00;&#x4E2A;&#x5FAA;&#x73AF;&#x4E2D;&#x505A;&#x66F4;&#x591A;&#x7684;&#x4E8B;&#x3002;&#x5982;&#x6B64;&#xFF0C;&#x4FBF;&#x60F3;&#x8D77;&#x4E86;&#x5F88;&#x4E45;&#x4EE5;&#x524D;&#x7684;&#x4E00;&#x4E2A;&#x6BB5;&#x5B50;&#xFF0C;&#x8BB2;&#x7684;&#x662F;&#x7A0B;&#x5E8F;&#x5458;&#x5982;&#x4F55;&#x4E00;&#x6B65;&#x6B65;&#x5728;&#x5FAA;&#x73AF;&#x4E2D;&#x91CD;&#x65B0;&#x56DE;&#x5230;&#x8D77;&#x70B9;&#x7684;&#xFF0C;&#x4EC5;&#x4F9B;&#x5927;&#x5BB6;&#x4E00;&#x7B11;&#x3002;</p>
<p>&#x7B2C;&#x4E00;&#x5E74;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1170656-b45f7f73054c14a9.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt=""></p>
<p>&#x7B2C;&#x4E8C;&#x5E74;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1170656-a2308d46264333f5.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt=""></p>
<p>&#x7B2C;&#x4E09;&#x5E74;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1170656-c600d68b24718b5c.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt=""></p>
<p>&#x7B2C;&#x4E94;&#x5E74;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1170656-30652348fc85df81.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt=""></p>
<p>&#x7B2C;&#x5341;&#x5E74;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1170656-935318e83b5f3fc9.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt=""></p>
<p>&#x5F53;&#x7136;&#x4E86;&#xFF0C;&#x8FD9;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x6BB5;&#x5B50;&#x3002;&#x4E0D;&#x7BA1;&#x4F60;&#x591A;&#x559C;&#x6B22;&#x6216;&#x662F;&#x591A;&#x4F1A;&#x7F16;&#x7A0B;&#xFF0C;&#x5728;&#x5B66;&#x4E60;&#x548C;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x4E0A;&#x603B;&#x4F1A;&#x78B0;&#x5230;&#x969C;&#x788D;&#x3002;&#x5DE5;&#x4F5C;&#x7684;&#x65F6;&#x95F4;&#x8D8A;&#x4E45;&#x5C31;&#x8D8A;&#x80FD;&#x660E;&#x767D;&#x8FD9;&#x4E2A;&#x9053;&#x7406;&#x3002;&#x6B63;&#x5E38;&#x7684;&#x7F16;&#x7A0B;&#x8FC7;&#x7A0B;&#x90FD;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF1A;&#x5C1D;&#x8BD5;&#x3001;&#x5931;&#x8D25;&#x3001;&#x5B66;&#x4E60;&#x3001;&#x601D;&#x8003;&#x3001;&#x7075;&#x611F;&#x3001;&#x6210;&#x529F;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x6F2B;&#x957F;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x5E38;&#x6709;&#x4EBA;&#x4F1A;&#x611F;&#x5230;&#x6CAE;&#x4E27;&#xFF0C;&#x8FD9;&#x5F88;&#x6B63;&#x5E38;&#xFF0C;&#x53EA;&#x6709;&#x7A81;&#x7834;&#x540E;&#x7684;&#x90A3;&#x79CD;&#x6109;&#x60A6;&#x611F;&#x624D;&#x80FD;&#x8BC1;&#x660E;&#x81EA;&#x5DF1;&#x7684;&#x8FDB;&#x6B65;&#x3002;&#x4E0D;&#x8981;&#x6EE1;&#x8DB3;&#x4E8E;&#x73B0;&#x72B6;&#xFF0C;&#x56E0;&#x4E3A;&#x4F60;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x662F;&#x6700;&#x597D;&#x7684;&#x3002;&#x6216;&#x8BB8;&#x5728;&#x67D0;&#x4E2A;&#x77AC;&#x95F4;&#xFF0C;&#x60A8;&#x4E0D;&#x77E5;&#x4E0D;&#x89C9;&#xFF0C;&#x4F46;&#x60A8;&#x5DF2;&#x7ECF;&#x7A81;&#x7834;&#x4E86;&#x7384;&#x5173;&#x3002;&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x5C31;&#x6765;&#x8C08;&#x4E00;&#x8C08;&#x7A0B;&#x5E8F;&#x5458;&#x8FDB;&#x9636;&#x7684;&#x4E94;&#x4E2A;&#x77AC;&#x95F4;&#x3002;</p>
<h4 id="&#x7B2C;&#x4E00;&#x4E2A;&#x77AC;&#x95F4;&#xFF1A;&#x5192;&#x9669;&#x7684;&#x51B2;&#x52A8;"><a href="#&#x7B2C;&#x4E00;&#x4E2A;&#x77AC;&#x95F4;&#xFF1A;&#x5192;&#x9669;&#x7684;&#x51B2;&#x52A8;" class="headerlink" title="&#x7B2C;&#x4E00;&#x4E2A;&#x77AC;&#x95F4;&#xFF1A;&#x5192;&#x9669;&#x7684;&#x51B2;&#x52A8;"></a>&#x7B2C;&#x4E00;&#x4E2A;&#x77AC;&#x95F4;&#xFF1A;&#x5192;&#x9669;&#x7684;&#x51B2;&#x52A8;</h4><p>&#x521A;&#x521A;&#x5B66;&#x4E60;&#x4E86;&#x4E00;&#x95E8;&#x8BED;&#x8A00;&#xFF0C;&#x4E86;&#x89E3;&#x57FA;&#x672C;&#x7684;&#x8BED;&#x6CD5;&#xFF0C;&#x53EF;&#x4EE5;&#x5199;&#x77ED;&#x7684;&#x4EE3;&#x7801;&#x7247;&#x6BB5;&#x4E86;&#xFF0C;&#x5FC3;&#x4E2D;&#x96BE;&#x63A9;&#x4E00;&#x79CD;&#x8DC3;&#x8DC3;&#x4E00;&#x8BD5;&#x7684;&#x51B2;&#x52A8;&#x3002;&#x5F53;&#x60A8;&#x60F3;&#x7740;&#x5F00;&#x542F;&#x5F81;&#x7A0B;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x60A8;&#x8FDB;&#x5165;&#x4E86;&#x7B2C;&#x4E00;&#x79CD;&#x5883;&#x754C;&#xFF0C;&#x4E1A;&#x754C;&#x53EB;&#x505A;&#x65B0;&#x624B;&#xFF0C;&#x81EA;&#x5DF1;&#x79F0;&#x4E4B;&#x4E3A;&#x65E0;&#x754F;&#x3002;&#x4E00;&#x822C;&#x8FDB;&#x5165;&#x8FD9;&#x4E2A;&#x9636;&#x6BB5;&#xFF0C;&#x5DEE;&#x4E0D;&#x591A;&#x534A;&#x53EA;&#x811A;&#x8FDB;&#x5165;&#x4E86;&#x8FD9;&#x4E2A;&#x884C;&#x4E1A;&#xFF0C;&#x6709;&#x8DA3;&#x591A;&#x8FC7;&#x804C;&#x8D23;&#xFF0C;&#x773C;&#x524D;&#x5145;&#x6EE1;&#x7740;&#x795E;&#x79D8;&#xFF0C;&#x4F46;&#x5374;&#x4E0D;&#x4E00;&#x5B9A;&#x4EE5;&#x6B64;&#x4E3A;&#x751F;&#x3002;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x5BF9;&#x60A8;&#x6765;&#x8BF4;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x90FD;&#x662F;&#x795E;&#x79D8;&#x7684;&#xFF0C;&#x5947;&#x5E7B;&#x7684;&#xFF0C;&#x611F;&#x89C9;&#x81EA;&#x5DF1;&#x7684;&#x524D;&#x9014;&#x4E00;&#x7247;&#x5149;&#x660E;&#xFF0C;&#x4F46;&#x662F;&#xFF0C;&#x4E5F;&#x4EC5;&#x662F;&#x611F;&#x89C9;&#x800C;&#x5DF2;&#x3002;</p>
<p>&#x8FD9;&#x65F6;&#x7684;&#x4F60;&#x9700;&#x8981;&#x6307;&#x5BFC;&#xFF0C;&#x53EF;&#x4EE5;&#x8BF4;&#x5904;&#x5728;&#x8FD9;&#x4E2A;&#x5883;&#x9047;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x6BEB;&#x65E0;&#x7ECF;&#x9A8C;&#xFF0C;&#x800C;&#x7ECF;&#x9A8C;&#x6070;&#x6070;&#x662F;&#x901A;&#x8FC7;&#x5B9E;&#x65BD;&#x8FD9;&#x9879;&#x6280;&#x672F;&#x800C;&#x4FC3;&#x8FDB;&#x7684;&#x601D;&#x7EF4;&#x6539;&#x53D8;&#xFF0C;&#x5373;&#x60A8;&#x5BF9;&#x672A;&#x6765;&#x5168;&#x65E0;&#x6240;&#x77E5;&#x3002;&#x8FD9;&#x65F6;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x6700;&#x5728;&#x610F;&#x7684;&#x4E0D;&#x662F;&#x5B66;&#x4E60;&#xFF0C;&#x800C;&#x662F;&#x60F3;&#x5B9E;&#x73B0;&#x4E00;&#x4E2A;&#x7ACB;&#x7AFF;&#x89C1;&#x5F71;&#x7684;&#x76EE;&#x6807;&#x3002;&#x4ED6;&#x4EEC;&#x4E0D;&#x77E5;&#x9053;&#x5982;&#x4F55;&#x5E94;&#x4ED8;&#x9519;&#x8BEF;&#xFF0C;&#x6240;&#x4EE5;&#x51FA;&#x9519;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F1A;&#x975E;&#x5E38;&#x5BB9;&#x6613;&#x614C;&#x4E71;&#x3002;&#x4F46;&#x662F;&#x7A0D;&#x52A0;&#x6307;&#x5BFC;&#xFF0C;&#x4ED6;&#x4EEC;&#x5C31;&#x4F1A;&#x53D8;&#x5F97;&#x80FD;&#x5E72;&#x8D77;&#x6765;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x65B0;&#x624B;&#x591A;&#x9762;&#x4E34;&#x7684;&#x95EE;&#x9898;&#x662F;&#xFF0C;&#x5F53;&#x4E00;&#x4E9B;&#x610F;&#x60F3;&#x4E0D;&#x5230;&#x7684;&#x4E8B;&#x524D;&#x53D1;&#x751F;&#x65F6;&#xFF0C;&#x4ED6;&#x4EEC;&#x5C31;&#x4F1A;&#x4E0D;&#x77E5;&#x6240;&#x63AA;&#x3002;&#x4E0D;&#x8FC7;&#xFF0C;&#x603B;&#x6709;&#x89E3;&#x51B3;&#x529E;&#x6CD5;&#xFF0C;&#x4E00;&#x4E2A;&#x6307;&#x5BFC;&#x624B;&#x518C;&#xFF0C;&#x6216;&#x662F;&#x8001;&#x7A0B;&#x5E8F;&#x5458;&#x7684;&#x4E00;&#x4E9B;&#x6307;&#x70B9;&#x4FBF;&#x8C41;&#x7136;&#x5F00;&#x6717;&#x4E86;&#xFF0C;&#x4F46;&#x8FD9;&#x53EA;&#x80FD;&#x8BA9;&#x4F60;&#x542F;&#x7A0B;&#xFF0C;&#x5374;&#x4E0D;&#x4F1A;&#x8BA9;&#x4F60;&#x8D70;&#x7684;&#x66F4;&#x8FDC;&#x3002;</p>
<h4 id="&#x7B2C;&#x4E8C;&#x4E2A;&#x77AC;&#x95F4;&#xFF1A;&#x559C;&#x60A6;&#x540E;&#x7684;&#x5E73;&#x9759;"><a href="#&#x7B2C;&#x4E8C;&#x4E2A;&#x77AC;&#x95F4;&#xFF1A;&#x559C;&#x60A6;&#x540E;&#x7684;&#x5E73;&#x9759;" class="headerlink" title="&#x7B2C;&#x4E8C;&#x4E2A;&#x77AC;&#x95F4;&#xFF1A;&#x559C;&#x60A6;&#x540E;&#x7684;&#x5E73;&#x9759;"></a>&#x7B2C;&#x4E8C;&#x4E2A;&#x77AC;&#x95F4;&#xFF1A;&#x559C;&#x60A6;&#x540E;&#x7684;&#x5E73;&#x9759;</h4><p>&#x8FD9;&#x65F6;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x7ECF;&#x5386;&#x4E86;&#x7B2C;&#x4E00;&#x4E2A;&#x9636;&#x6BB5;&#x5DF2;&#x7ECF;&#x53EF;&#x4EE5;&#x5199;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x7684;&#x7A0B;&#x5E8F;&#x4E86;&#xFF0C;&#x4F46;&#x771F;&#x6B63;&#x5BF9;&#x8BED;&#x8A00;&#x4E86;&#x89E3;&#x591A;&#x5C11;&#xFF0C;&#x6216;&#x8BB8;&#x81EA;&#x5DF1;&#x5FC3;&#x4E2D;&#x4F1A;&#x6709;&#x4E00;&#x4E2A;&#x4F53;&#x4F1A;&#x3002;&#x8FD9;&#x65F6;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x5DF2;&#x7ECF;&#x6709;&#x4E9B;&#x7ECF;&#x9A8C;&#x4E86;&#xFF0C;&#x867D;&#x7136;&#x53EF;&#x80FD;&#x5BF9;&#x4E00;&#x4E9B;&#x9AD8;&#x7EA7;&#x7528;&#x6CD5;&#x4E0D;&#x751A;&#x4E86;&#x4E86;&#xFF0C;&#x4F46;&#x5E94;&#x4ED8;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#x8FD8;&#x662F;&#x53EF;&#x4EE5;&#x7684;&#x3002;&#x4E00;&#x79CD;&#x7A81;&#x7834;&#x540E;&#x7684;&#x559C;&#x60A6;&#x6CB9;&#x7136;&#x800C;&#x751F;&#xFF0C;&#x8D70;&#x5230;&#x8FD9;&#x4E2A;&#x5730;&#x6B65;&#xFF0C;&#x53EF;&#x4EE5;&#x8BF4;&#x5DF2;&#x7ECF;&#x662F;&#x4E00;&#x4E2A;&#x6B63;&#x5F0F;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x4E86;&#xFF0C;&#x5F53;&#x4E00;&#x79CD;&#x6280;&#x672F;&#x4F5C;&#x4E3A;&#x5FD7;&#x4E1A;&#xFF0C;&#x4E00;&#x79CD;&#x8D23;&#x4EFB;&#x548C;&#x7126;&#x8651;&#x4E5F;&#x4F1A;&#x968F;&#x4E4B;&#x800C;&#x6765;&#xFF0C;&#x6211;&#x80FD;&#x575A;&#x6301;&#x8D70;&#x4E0B;&#x53BB;&#x5417;&#xFF1F;&#x6211;&#x4F1A;&#x505A;&#x7684;&#x66F4;&#x597D;&#x5417;&#xFF1F;&#x5404;&#x79CD;&#x95EE;&#x9898;&#x968F;&#x4E4B;&#x800C;&#x6765;&#x3002;</p>
<p>&#x8FD9;&#x65F6;&#x5019;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x8FD8;&#x4E0D;&#x4F1A;&#x60F3;&#x7740;&#x5168;&#x5C40;&#x601D;&#x7EF4;&#xFF0C;&#x4ED6;&#x4EEC;&#x53EF;&#x4EE5;&#x72EC;&#x81EA;&#x5C1D;&#x8BD5;&#x4EFB;&#x52A1;&#xFF0C;&#x4F46;&#x4ECD;&#x7136;&#x96BE;&#x4EE5;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x3002;&#x4ED6;&#x4EEC;&#x60F3;&#x8981;&#x5FEB;&#x901F;&#x83B7;&#x53D6;&#x4FE1;&#x606F;&#xFF0C;&#x5F53;&#x5B66;&#x4E60;&#x4E00;&#x95E8;&#x65B0;&#x8BED;&#x8A00;&#x6216;&#x8005;API&#x65F6;&#xFF0C;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x4F1A;&#x5FEB;&#x901F;&#x6D4F;&#x89C8;&#x6587;&#x6863;&#x4EE5;&#x5BFB;&#x627E;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#x5B9A;&#x4E49;&#x6216;&#x53C2;&#x6570;&#x5217;&#x8868;&#xFF0C;&#x800C;&#x4E0D;&#x60F3;&#x5728;&#x6B64;&#x523B;&#x5BFB;&#x6839;&#x95EE;&#x5E95;&#xFF0C;&#x6216;&#x8005;&#x91CD;&#x65B0;&#x6E29;&#x4E60;&#x4E00;&#x904D;&#x57FA;&#x7840;&#x77E5;&#x8BC6;&#x3002;&#x4ED6;&#x4EEC;&#x6CA1;&#x6709;&#x5168;&#x9762;&#x7684;&#x7406;&#x89E3;&#xFF0C;&#x6216;&#x8BB8;&#x7684;&#x786E;&#x4E0D;&#x60F3;&#x6709;&#x3002;&#x5982;&#x679C;&#x4F60;&#x8BD5;&#x56FE;&#x628A;&#x4E00;&#x4E2A;&#x66F4;&#x5927;&#x7684;&#x60C5;&#x666F;&#x5F3A;&#x52A0;&#x7ED9;&#x4ED6;&#x4EEC;&#xFF0C;&#x4ED6;&#x4EEC;&#x53EF;&#x80FD;&#x4F1A;&#x8BA4;&#x4E3A;&#x8BE5;&#x60C5;&#x666F;&#x4E0D;&#x76F8;&#x5173;&#x800C;&#x5FFD;&#x7565;&#x6389;&#xFF0C;&#x5F53;&#x7136;&#x662F;&#x6709;&#x5173;&#x7CFB;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#xFF0C;&#x4ED6;&#x4EEC;&#x770B;&#x4E0D;&#x5230;&#x8FD9;&#x79CD;&#x8054;&#x7CFB;&#xFF0C;&#x56E0;&#x4E3A;&#x5C42;&#x6B21;&#x8FD8;&#x4E0D;&#x591F;&#xFF0C;&#x53EA;&#x662F;&#x5904;&#x4E8E;&#x6BD4;&#x8F83;&#x4F4E;&#x7684;&#x6280;&#x80FD;&#x6C34;&#x5E73;&#x3002;</p>
<h4 id="&#x7B2C;&#x4E09;&#x4E2A;&#x77AC;&#x95F4;&#xFF1A;&#x535A;&#x89C8;&#x901A;&#x8BC6;&#xFF0C;&#x611F;&#x89C9;&#xFF08;&#x5E0C;&#x671B;&#xFF09;&#x81EA;&#x5DF1;&#x65E0;&#x6240;&#x4E0D;&#x80FD;"><a href="#&#x7B2C;&#x4E09;&#x4E2A;&#x77AC;&#x95F4;&#xFF1A;&#x535A;&#x89C8;&#x901A;&#x8BC6;&#xFF0C;&#x611F;&#x89C9;&#xFF08;&#x5E0C;&#x671B;&#xFF09;&#x81EA;&#x5DF1;&#x65E0;&#x6240;&#x4E0D;&#x80FD;" class="headerlink" title="&#x7B2C;&#x4E09;&#x4E2A;&#x77AC;&#x95F4;&#xFF1A;&#x535A;&#x89C8;&#x901A;&#x8BC6;&#xFF0C;&#x611F;&#x89C9;&#xFF08;&#x5E0C;&#x671B;&#xFF09;&#x81EA;&#x5DF1;&#x65E0;&#x6240;&#x4E0D;&#x80FD;"></a>&#x7B2C;&#x4E09;&#x4E2A;&#x77AC;&#x95F4;&#xFF1A;&#x535A;&#x89C8;&#x901A;&#x8BC6;&#xFF0C;&#x611F;&#x89C9;&#xFF08;&#x5E0C;&#x671B;&#xFF09;&#x81EA;&#x5DF1;&#x65E0;&#x6240;&#x4E0D;&#x80FD;</h4><p>&#x8FD9;&#x65F6;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x5DF2;&#x7ECF;&#x80FD;&#x719F;&#x7EC3;&#x7684;&#x4F7F;&#x7528;&#x4E00;&#x95E8;&#x8BED;&#x8A00;&#x4E86;, &#x80FD;&#x591F;&#x7528;&#x8BED;&#x8A00;&#x53BB;&#x89E3;&#x51B3;&#x751F;&#x4EA7;&#x73AF;&#x5883;&#x4E2D;&#x4E00;&#x4E2A;&#x5177;&#x4F53;&#x548C;&#x5B8C;&#x6574;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x80FD;&#x591F;&#x5EFA;&#x7ACB;&#x95EE;&#x9898;&#x57DF;&#x7684;&#x6982;&#x5FF5;&#x6A21;&#x578B;&#xFF0C;&#x5E76;&#x6709;&#x6548;&#x5730;&#x4F7F;&#x7528;&#x5B83;&#x4EEC;&#xFF0C;&#x5DF2;&#x7ECF;&#x5F62;&#x6210;&#x4E86;&#x4E00;&#x5957;&#x81EA;&#x5DF1;&#x7684;&#x60EF;&#x7528;&#x6CD5;&#x548C;&#x5E38;&#x7528;&#x4EE3;&#x7801;&#x5E93;&#x3002;&#x5728;&#x4F60;&#x7684;&#x7F16;&#x7801;&#x65B9;&#x6848;&#x4E2D;&#x5F53;&#x524D;&#x7684;&#x7A0B;&#x5E8F;&#x8BED;&#x8A00;&#x662F;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x597D;&#x7528;&#x7684;&#x5DE5;&#x5177;&#x3002;</p>
<p>&#x8FD9;&#x65F6;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x4F1A;&#x63A2;&#x5BFB;&#x548C;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#xFF0C;&#x4ED6;&#x4EEC;&#x7684;&#x5DE5;&#x4F5C;&#x57FA;&#x4E8E;&#x8C28;&#x614E;&#x7684;&#x8BA1;&#x5212;&#x548C;&#x8FC7;&#x53BB;&#x7684;&#x7ECF;&#x9A8C;&#x3002;&#x4ED6;&#x4EEC;&#x5F80;&#x5F80;&#x5728;&#x56E2;&#x961F;&#x4E2D;&#x53D1;&#x6325;&#x9886;&#x5BFC;&#x4F5C;&#x7528;&#xFF08;&#x65E0;&#x8BBA;&#x662F;&#x5426;&#x6709;&#x6B63;&#x5F0F;&#x7684;&#x5934;&#x8854;&#xFF09;&#x3002;&#x4ED6;&#x4EEC;&#x662F;&#x56E2;&#x961F;&#x91CC;&#x7684;&#x597D;&#x4EBA;&#xFF0C;&#x65E2;&#x53EF;&#x4EE5;&#x6307;&#x5BFC;&#x65B0;&#x624B;&#xFF0C;&#x4E5F;&#x4E0D;&#x4F1A;&#x7ECF;&#x5E38;&#x9A9A;&#x6270;&#x66F4;&#x9AD8;&#x5C42;&#x6B21;&#x7684;&#x5458;&#x5DE5;&#x3002;&#x4F46;&#x662F;&#x5373;&#x4F7F;&#x5728;&#x8FD9;&#x4E00;&#x6C34;&#x5E73;&#xFF0C;&#x4EBA;&#x4EEC;&#x4ECD;&#x7136;&#x65E0;&#x6CD5;&#x6309;&#x7167;&#x6211;&#x4EEC;&#x6240;&#x5E0C;&#x671B;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x654F;&#x6377;&#x5E94;&#x5BF9;&#x6240;&#x6709;&#x7684;&#x5DE5;&#x4F5C;&#x2013;&#x5927;&#x5BB6;&#x8FD8;&#x6CA1;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x80FD;&#x529B;&#x53CD;&#x601D; &#x548C;&#x81EA;&#x6211;&#x7EA0;&#x6B63;&#x3002;&#x4E3A;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x53D6;&#x5F97;&#x7A81;&#x7834;&#xFF0C;&#x8FBE;&#x5230;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x6C34;&#x5E73;&#x3002;</p>
<h4 id="&#x7B2C;&#x56DB;&#x4E2A;&#x77AC;&#x95F4;&#xFF1A;&#x65E0;&#x5F80;&#x4E0D;&#x590D;"><a href="#&#x7B2C;&#x56DB;&#x4E2A;&#x77AC;&#x95F4;&#xFF1A;&#x65E0;&#x5F80;&#x4E0D;&#x590D;" class="headerlink" title="&#x7B2C;&#x56DB;&#x4E2A;&#x77AC;&#x95F4;&#xFF1A;&#x65E0;&#x5F80;&#x4E0D;&#x590D;"></a>&#x7B2C;&#x56DB;&#x4E2A;&#x77AC;&#x95F4;&#xFF1A;&#x65E0;&#x5F80;&#x4E0D;&#x590D;</h4><p>&#x4E8B;&#x7269;&#x7684;&#x8FD0;&#x52A8;&#x662F;&#x5FAA;&#x73AF;&#x53CD;&#x590D;&#x7684;&#xFF0C;&#x672A;&#x6709;&#x5F80;&#x800C;&#x4E0D;&#x8FD4;&#x7684;&#x3002;&#x8FD9;&#x4E2A;&#x9636;&#x6BB5;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x5DF2;&#x7ECF;&#x975E;&#x5E38;&#x6E05;&#x695A;&#x6240;&#x7528;&#x8BED;&#x8A00;&#x7684;&#x8BBE;&#x8BA1;&#x9009;&#x62E9;&#x548C;&#x80CC;&#x540E;&#x7684;&#x52A8;&#x673A;&#xFF0C;&#x80FD;&#x7406;&#x89E3;&#x7684;&#x7B80;&#x6D01;&#x548C;&#x53EF;&#x7EC4;&#x5408;&#x6027;&#x54F2;&#x5B66;&#xFF0C;&#x5E76;&#x80FD;&#x591F;&#x81EA;&#x6211;&#x7EA0;&#x6B63;&#x3002;&#x5904;&#x4E8E;&#x8FD9;&#x4E2A;&#x6C34;&#x5E73;&#x7684;&#x4ECE;&#x4E1A;&#x4EBA;&#x5458;&#x6709;&#x4E00;&#x9879;&#x91CD;&#x5927;&#x7A81;&#x7834;&#xFF1A;&#x4ED6;&#x4EEC;&#x4F1A;&#x53CD;&#x601D;&#x4EE5;&#x524D;&#x7684;&#x505A;&#x6CD5;&#xFF0C;&#x5E76;&#x4FEE;&#x6539;&#x5176;&#x505A;&#x6CD5;&#xFF0C;&#x671F;&#x671B;&#x4E0B;&#x4E00;&#x6B21;&#x8868;&#x73B0;&#x7684;&#x66F4;&#x597D;&#x3002;&#x4ED6;&#x80FD;&#x591F;&#x9605;&#x8BFB;&#x6848;&#x4F8B;&#x7814;&#x7A76;&#xFF0C;&#x503E;&#x542C;&#x6709;&#x5173;&#x5931;&#x8D25;&#x9879;&#x76EE;&#x7684;&#x6D41;&#x8A00;&#x871A;&#x8BED;&#xFF0C;&#x89C2;&#x5BDF;&#x522B;&#x4EBA;&#x600E;&#x4E48;&#x505A;&#xFF0C;&#x4ECE;&#x6545;&#x4E8B;&#x4E2D;&#x8BA4;&#x771F;&#x7684;&#x5B66;&#x4E60;&#x3002;</p>
<p>&#x9AD8;&#x7EA7;&#x7A0B;&#x5E8F;&#x5458;&#x662F;&#x7ECF;&#x5E38;&#x4F1A;&#x5BF9;&#x9700;&#x6C42;&#x8BF4;&#x201C;No&#x201D;&#x7684;&#x4EBA;&#xFF0C;&#x5BF9;&#x884C;&#x4E1A;&#x7684;&#x6DF1;&#x5165;&#x8BA4;&#x8BC6;&#x548C;&#x5BF9;&#x7CFB;&#x7EDF;&#x53CA;&#x5E94;&#x7528;&#x5168;&#x5C40;&#x7684;&#x628A;&#x63E1;&#x80FD;&#x529B;&#x4F7F;&#x4ED6;&#x5177;&#x6709;&#x771F;&#x6B63;&#x6307;&#x5BFC;&#x7528;&#x6237;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x89C4;&#x8303;&#x7528;&#x6237;&#x7684;&#x5DE5;&#x4F5C;&#x3001;&#x601D;&#x60F3;&#x5E76;&#x7528;&#x8BA1;&#x7B97;&#x673A;&#x8FD9;&#x4E2A;&#x5DE5;&#x5177;&#x771F;&#x6B63;&#x5BF9;&#x884C;&#x4E1A;&#x4EA7;&#x751F;&#x5F15;&#x9886;&#x4F5C;&#x7528;&#x3002;&#x5904;&#x4E8E;&#x5F53;&#x524D;&#x6C34;&#x5E73;&#x7684;&#x4EBA;&#x5458;&#x77E5;&#x9053;&#x4EC0;&#x4E48;&#x5730;&#x65B9;&#x6709;&#x5751;&#xFF0C;&#x6216;&#x8005;&#x66F4;&#x786E;&#x5207;&#x5730;&#x8BF4;&#xFF0C;&#x4EC0;&#x4E48;&#x5730;&#x65B9;&#x975E;&#x5E38;&#x6709;&#x53EF;&#x80FD;&#x51FA;&#x9519;&#x3002;&#x4ED6;&#x4EEC;&#x5177;&#x6709;&#x7ECF;&#x9A8C;&#x548C;&#x5224;&#x65AD;&#x529B;&#xFF0C;&#x80FD;&#x591F;&#x7406;&#x89E3;&#x8FD9;&#x53E5;&#x8BDD;&#x5728;&#x60C5;&#x666F;&#x4E2D;&#x610F;&#x5473;&#x7740;&#x4EC0;&#x4E48;&#x3002;&#x4E8B;&#x5B9E;&#x8BC1;&#x660E;&#xFF0C;&#x7406;&#x89E3;&#x60C5;&#x666F;&#x662F;&#x6210;&#x4E3A;&#x4E13;&#x5BB6;&#x7684;&#x5173;&#x952E;&#x3002;&#x540C;&#x6837;&#xFF0C;&#x5F53;&#x524D;&#x6C34;&#x5E73;&#x7684;&#x4EBA;&#x53EF;&#x4EE5;&#x6709;&#x6548;&#x5730;&#x8FD0;&#x7528;&#x8F6F;&#x4EF6;&#x6A21;&#x5F0F;&#xFF0C;&#x53EF;&#x4EE5;&#x5145;&#x5206;&#x5229;&#x7528;&#x601D;&#x8003;&#x548C;&#x53CD;&#x9988;&#xFF0C;&#x8FD9;&#x4E9B;&#x90FD;&#x662F;&#x654F;&#x6377;&#x884C;&#x4E3A;&#x7684;&#x6838;&#x5FC3;&#x3002;</p>
<h4 id="&#x7B2C;&#x4E94;&#x4E2A;&#x77AC;&#x95F4;&#xFF1A;&#x4E07;&#x6CD5;&#x5F52;&#x4E00;"><a href="#&#x7B2C;&#x4E94;&#x4E2A;&#x77AC;&#x95F4;&#xFF1A;&#x4E07;&#x6CD5;&#x5F52;&#x4E00;" class="headerlink" title="&#x7B2C;&#x4E94;&#x4E2A;&#x77AC;&#x95F4;&#xFF1A;&#x4E07;&#x6CD5;&#x5F52;&#x4E00;"></a>&#x7B2C;&#x4E94;&#x4E2A;&#x77AC;&#x95F4;&#xFF1A;&#x4E07;&#x6CD5;&#x5F52;&#x4E00;</h4><p>&#x6280;&#x672F;&#x548C;&#x793E;&#x4F1A;&#x662F;&#x7D27;&#x5BC6;&#x8054;&#x7CFB;&#x5728;&#x4E00;&#x8D77;&#x7684;&#x3002;&#x793E;&#x4F1A;&#x7684;&#x8FDB;&#x6B65;&#x53D1;&#x5C55;&#x51B3;&#x5B9A;&#x4E86;&#x9700;&#x6C42;&#x548C;&#x6280;&#x672F;&#x7684;&#x53D1;&#x5C55;&#xFF0C;&#x4E00;&#x4E2A;&#x5BF9;&#x6280;&#x672F;&#x53D1;&#x5C55;&#x6709;&#x7740;&#x654F;&#x9510;&#x611F;&#x89C9;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x5FC5;&#x987B;&#x5BF9;&#x793E;&#x4F1A;&#x6709;&#x7740;&#x6DF1;&#x523B;&#x7684;&#x8BA4;&#x8BC6;&#x3002;&#x8FD9;&#x65F6;&#x5E94;&#x8BE5;&#x79EF;&#x6781;&#x5730;&#x4E0E;&#x4ED6;&#x4EBA;&#x5206;&#x4EAB;&#x5173;&#x4E8E;&#x7279;&#x5B9A;&#x8BED;&#x8A00;&#x77E5;&#x8BC6;&#x548C;&#x5BF9;&#x6B64;&#x8BED;&#x8A00;&#x7684;&#x7406;&#x89E3;&#xFF0C;&#x5728;&#x5404;&#x79CD;&#x5408;&#x9002;&#x7684;&#x573A;&#x6240;&#x53D1;&#x51FA;&#x81EA;&#x5DF1;&#x7684;&#x58F0;&#x97F3;, &#x53C2;&#x4E0E;&#x90AE;&#x4EF6;&#x5217;&#x8868;&#x3001;&#x5EFA;&#x7ACB;QQ&#x7FA4;&#x3001;&#x505A;&#x4E13;&#x9898;&#x62A5;&#x544A;&#xFF0C;&#x8457;&#x4E66;&#xFF0C;&#x5199;&#x6587;&#x7AE0;&#xFF0C;&#x505A;&#x5DE1;&#x56DE;&#x6F14;&#x8BB2;&#x3002;&#x8FD9;&#x65F6;&#x7684;&#x4F60;&#x53EF;&#x4EE5;&#x51ED;&#x76F4;&#x89C9;&#x5DE5;&#x4F5C;&#xFF0C;&#x56E0;&#x4E3A;&#x4E13;&#x5BB6;&#x662F;&#x5404;&#x4E2A;&#x9886;&#x57DF;&#x77E5;&#x8BC6;&#x548C;&#x4FE1;&#x606F;&#x7684;&#x4E3B;&#x8981;&#x6765;&#x6E90;&#x3002;&#x4ED6;&#x4EEC;&#x603B;&#x662F;&#x4E0D;&#x65AD;&#x5730;&#x5BFB;&#x627E;&#x66F4;&#x597D;&#x7684;&#x65B9;&#x6CD5;&#x548C;&#x65B9;&#x5F0F;&#x505A;&#x4E8B;&#x3002;&#x4ED6;&#x4EEC;&#x6709;&#x4E30;&#x5BCC;&#x7684;&#x7ECF;&#x9A8C;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x6070;&#x5F53;&#x7684;&#x60C5;&#x666F;&#x4E2D;&#x9009;&#x53D6;&#x548C;&#x5E94;&#x7528;&#x8FD9;&#x4E9B;&#x7ECF;&#x9A8C;&#x3002;</p>
<p>&#x6839;&#x636E;&#x76F4;&#x89C9;&#x5DE5;&#x4F5C;&#xFF0C;&#x800C;&#x4E0D;&#x9700;&#x8981;&#x7406;&#x7531;&#x3002;&#x4E13;&#x5BB6;&#x77E5;&#x9053;&#x54EA;&#x4E9B;&#x662F;&#x65E0;&#x5173;&#x7D27;&#x8981;&#x7684;&#x7EC6;&#x8282;&#xFF0C;&#x54EA;&#x4E9B;&#x662F;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#x7EC6;&#x8282;&#x3002;&#x4E5F;&#x8BB8;&#x4E0D;&#x662F;&#x6709;&#x610F;&#x8BC6;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x4E13;&#x5BB6;&#x77E5;&#x9053;&#x5E94;&#x8BE5;&#x5173;&#x6CE8;&#x54EA;&#x4E9B;&#x7EC6;&#x8282;&#xFF0C;&#x53EF;&#x4EE5;&#x653E;&#x5FC3;&#x7684;&#x5FFD;&#x7565;&#x54EA;&#x4E9B;&#x7EC6;&#x8282;&#x3002;&#x4E13;&#x5BB6;&#x975E;&#x5E38;&#x64C5;&#x957F;&#x505A;&#x6709;&#x9488;&#x5BF9;&#x6027;&#x7684;&#x7279;&#x5F81;&#x5339;&#x914D;&#x3002;&#x8FD9;&#x65F6;&#x7684;&#x4F60;&#xFF0C;&#x843D;&#x53F6;&#x98DE;&#x82B1;&#x7686;&#x662F;&#x5229;&#x5668;&#x3002;</p>

            <div class="clearfix"></div>
            <hr class="nogutter">
        </div>


        <nav class="pagination" role="pagination">


<div class="ds-share flat" data-thread-key="2012/12/01/程序员进阶的五个瞬间/" data-title="程序员进阶的五个瞬间" data-images="https://avatars0.githubusercontent.com/u/10378248?v=3&s=460" data-content="程序员进阶的五个瞬间 是最近写的文章，希望能帮到您！" data-url="https://dangdangfeng.github.io/2012/12/01/程序员进阶的五个瞬间/">
    <div class="ds-share-inline">
      <ul  class="ds-share-icons-16">
        
        <li data-toggle="ds-share-icons-more"><a class="ds-more" href="javascript:void(0);">分享到：</a></li>
        <li><a class="ds-weibo" href="javascript:void(0);" data-service="weibo">微博</a></li>
        <li><a class="ds-qzone" href="javascript:void(0);" data-service="qzone">QQ空间</a></li>
        <li><a class="ds-qqt" href="javascript:void(0);" data-service="qqt">腾讯微博</a></li>
        <li><a class="ds-wechat" href="javascript:void(0);" data-service="wechat">微信</a></li>
        
      </ul>
      <div class="ds-share-icons-more">
      </div>
    </div>
 </div>

 <br/>

    
    <a class="pull-left" href="/2013/01/01/iOS视图生命周期简析/" style="float: left;">
        ← iOS视图生命周期简析
    </a>
    
    
    <a class="pull-right" href="/2012/08/30/如何优雅的谈论HTTP／1-0／1-1／2-0/">
        如何优雅的谈论HTTP／1.0／1.1／2.0 →
    </a>
    

    
</nav>



        
        <div class="duoshuo">


<div class="ds-thread" data-thread-key="2012/12/01/程序员进阶的五个瞬间/" data-title="程序员进阶的五个瞬间" data-url="https://dangdangfeng.github.io/2012/12/01/程序员进阶的五个瞬间/"></div>



<script type="text/javascript">
var duoshuoQuery = {short_name:"deter"};
(function() {
	var ds = document.createElement('script');
	ds.type = 'text/javascript';ds.async = true;
	ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
	ds.charset = 'UTF-8';
	(document.getElementsByTagName('head')[0] 
	 || document.getElementsByTagName('body')[0]).appendChild(ds);
})();
</script>
</div>
    </div>
</section>


      
<!-- ============================ Footer =========================== -->

<footer>
    <div class="container">
            <div class="copy">
                <p>
                    &copy; 2010<script>new Date().getFullYear()>2010&&document.write("-"+new Date().getFullYear());</script>, Content By 吴白. All Rights Reserved.
                </p>
                <p>Theme By <a href="//go.kieran.top" style="color: #767D84">Kieran</a></p>
            </div>
            <div class="social">
                <ul>
                    
                    <li><a href="https://github.com/" title="Github" target="_blank"><i class="icon-github"></i></a>&nbsp;</li>
                    
                    
                    <li><a href="https://twitter.com/" title="Twitter" target="_blank"><i class="icon-twitter"></i></a>&nbsp;</li>
                    
                    
                    <li><a href="https://www.facebook.com/" title="Facebook" target="_blank"><i class="icon-facebook"></i></a>&nbsp;</li>
                    
                    
                    <li><a href="https://google.com/" title="Google-Plus" target="_blank"><i class="icon-google-plus"></i></a>&nbsp;</li>
                    
                    
                    <li><a href="http://weibo.com/" title="Sina-Weibo" target="_blank"><i class="icon-sina-weibo"></i></a>&nbsp;</li>
                    
                </ul>
            </div>
            <div class="clearfix"> </div>
        </div>
</footer>

<!-- ============================ END Footer =========================== -->
      <!-- Load our scripts -->
        
<!-- Resizable 'on-demand' full-height hero -->
<script type="text/javascript">
    
    var resizeHero = function () {
        var hero = $(".cover,.heightblock"),
            window1 = $(window);
        hero.css({
            "height": window1.height()
        });
    };
    
    resizeHero();
    
    $(window).resize(function () {
        resizeHero();
    });
</script>
<script src="/js/plugins.min.js"></script><!-- Bootstrap core and concatenated plugins always load here -->
<script src="/js/jquery.flexslider-min.js"></script><!-- Flexslider plugin -->
<script src="/js/scripts.js"></script><!-- Theme scripts -->

<!-- Initiate flexslider plugin -->
<script type="text/javascript">
    $(document).ready(function($) {
      $('.flexslider').flexslider({
        animation: "fade",
        prevText: "",
        nextText: "",
        directionNav: true
      });
    });
</script>

</body>
</html>
