<!DOCTYPE html>
<!--[if lte IE 8 ]>
<html class="ie" xmlns="http://www.w3.org/1999/xhtml" xml:lang="en-US" lang="en-US">
<![endif]-->
<!--[if (gte IE 9)|!(IE)]><!-->
<!--
***************  *      *     *
      8          *    *       *
      8          *  *         *
      8          **           *
      8          *  *         *
      8          *    *       *
      8          *      *     *
      8          *        *   ***********    -----Theme By Kieran(http://go.kieran.top)
-->
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en-US" lang="en-US">
<!--<![endif]-->

<head>
  <title>手机App的购物车必须登陆 | 流城</title>
  <!-- Meta data -->
    <meta http-equiv="Content-Type" content="text/html" charset="UTF-8" >
    <meta http-equiv="X-UA-Compatible" content="IE=edge"/>
    <meta name="viewport" content="width=device-width, initial-scale=1.0" />
    <meta name="generator" content="流城">
    <meta name="author" content="吴白">
    <meta name="description" content="" />
    <meta name="keywords" content="" />

    <!-- Favicon, (keep icon in root folder) -->
    <link rel="Shortcut Icon" href="/img/favicon.ico" type="image/ico">

    <link rel="alternate" href="/atom.xml" title="流城" type="application/atom+xml">
    <link rel="stylesheet" href="/css/all.css" media="screen" type="text/css">
	
    <link rel="stylesheet" href="/highlightjs/vs.css" type="text/css">
    
    

    <!-- Custom stylesheet, (add custom styles here, always load last) -->
    <!-- Load our stylesheet for IE8 -->
    <!--[if IE 8]>
    <link rel="stylesheet" type="text/css" href="/css/ie8.css" />
    <![endif]-->

    <!-- Google Webfonts (Monserrat 400/700, Open Sans 400/600) -->
    <!--<link href='//fonts.useso.com/css?family=Montserrat:400,700' rel='stylesheet' type='text/css'>-->
    <!--<link href='//fonts.useso.com/css?family=Open+Sans:400,600' rel='stylesheet' type='text/css'>-->

    <!-- Load our fonts individually if IE8+, to avoid faux bold & italic rendering -->
    <!--[if IE]>
    <!--<link href='http://fonts.useso.com/css?family=Montserrat:400' rel='stylesheet' type='text/css'> -->
    <!--<link href='http://fonts.useso.com/css?family=Montserrat:700' rel='stylesheet' type='text/css'> -->
    <!--<link href='http://fonts.useso.com/css?family=Open+Sans:400' rel='stylesheet' type='text/css'>-->
    <!--<link href='http://fonts.useso.com/css?family=Open+Sans:600' rel='stylesheet' type='text/css'>-->
    <![endif]-->

    <!-- jQuery | Load our jQuery, with an alternative source fallback to a local version if request is unavailable -->
    <script src="/js/jquery-1.11.1.min.js"></script>
    <script>window.jQuery || document.write('<script src="js/jquery-1.11.1.min.js"><\/script>')</script>

    <!-- Load these in the <head> for quicker IE8+ load times -->
    <!-- HTML5 shim and Respond.js IE8 support of HTML5 elements and media queries -->
    <!--[if lt IE 9]>
    <script src="/js/html5shiv.min.js"></script>
    <script src="/js/respond.min.js"></script>
    <![endif]-->










  
  
  <link rel="alternate" type="application/atom+xml" title="Atom 0.3" href="atom.xml">
  
  

  
  <style>.col-md-8.col-md-offset-2.opening-statement img{display:none;}</style>
</head>

<!--
<body class="post-template">
-->
<body id="index" class="lightnav animsition">

      <!-- ============================ Off-canvas navigation =========================== -->

    <div class="sb-slidebar sb-right sb-style-overlay sb-momentum-scrolling">
        <div class="sb-close" aria-label="Close Menu" aria-hidden="true">
            <img src="/img/close.png" alt="Close"/>
        </div>
        <!-- Lists in Slidebars -->
        <ul class="sb-menu">
            <li><a href="/" class="animsition-link" title="Home">Home</a></li>
            <li><a href="/archives" class="animsition-link" title="archive">archives</a></li>
            <!-- Dropdown Menu -->
			 
            <li>
                <a class="sb-toggle-submenu">Works<span class="sb-caret"></span></a>
                <ul class="sb-submenu">
                    
                        <li><a href="http://www.gome.com.cn" target="_BLANK" class="animsition-link">Gome</a></li>
                    
                        <li><a href="http://www.yintai.com" target="_BLANK" class="animsition-link">YinTai</a></li>
                    
                </ul>
            </li>
            
            
            
            <li>
                <a class="sb-toggle-submenu">Links<span class="sb-caret"></span></a>
                <ul class="sb-submenu">
                    
                    <li><a href="http://www.jianshu.com/users/211925b3ca7c/latest_articles" class="animsition-link">吴白</a></li>
                    
                    <li><a href="http://www.jianshu.com/users/19f4bf67c705/latest_articles" class="animsition-link">吴禅</a></li>
                    
                </ul>
            </li>
            
        </ul>
        <!-- Lists in Slidebars -->
        <ul class="sb-menu secondary">
            <li><a href="/about" class="animsition-link" title="about">About</a></li>
            <li><a href="/atom.xml" class="animsition-link" title="rss">RSS</a></li>
        </ul>
    </div>
    
    <!-- ============================ END Off-canvas navigation =========================== -->

    <!-- ============================ #sb-site Main Page Wrapper =========================== -->

    <div id="sb-site">
        <!-- #sb-site - All page content should be contained within this id, except the off-canvas navigation itself -->

        <!-- ============================ Header & Logo bar =========================== -->

        <div id="navigation" class="navbar navbar-fixed-top">
            <div class="navbar-inner">
                <div class="container">
                    <!-- Nav logo -->
                    <div class="logo">
                        <a href="/" title="Logo" class="animsition-link">
                         <img src="/img/logo.png" alt="Logo" width="35px;"/> 
                        </a>
                    </div>
                    <!-- // Nav logo -->
                    <!-- Info-bar -->
                    <nav>
                        <ul class="nav">
                            <li><a href="/" class="animsition-link">流城</a></li>
                            <li class="nolink"><span>Always </span>Creative.</li>
                            
                            <li><a href="https://github.com/" title="Github" target="_blank"><i class="icon-github"></i></a></li>
                            
                            
                            <li><a href="https://twitter.com/" title="Twitter" target="_blank"><i class="icon-twitter"></i></a></li>
                            
                            
                            <li><a href="https://www.facebook.com/" title="Facebook" target="_blank"><i class="icon-facebook"></i></a></li>
                            
                            
                            <li><a href="https://google.com/" title="Google-Plus" target="_blank"><i class="icon-google-plus"></i></a></li>
                            
                            
                            <li><a href="http://weibo.com/" title="Sina-Weibo" target="_blank"><i class="icon-sina-weibo"></i></a></li>
                            
                            <li class="nolink"><span>Welcome!</span></li>
                        </ul>
                    </nav>
                    <!--// Info-bar -->
                </div>
                <!-- // .container -->
                <div class="learnmore sb-toggle-right">More</div>
                <button type="button" class="navbar-toggle menu-icon sb-toggle-right" title="More">
                <span class="sr-only">Toggle navigation</span>
                <span class="icon-bar before"></span>
                <span class="icon-bar main"></span>
                <span class="icon-bar after"></span>
                </button>
            </div>
            <!-- // .navbar-inner -->
        </div>

        <!-- ============================ Header & Logo bar =========================== -->


      
<section id="intro">
    <div class="container">
        <div class="row col-md-offset-2">
            <div class="col-md-8">
    			<span class="post-meta">
      <time datetime="2012-05-15T15:03:58.000Z" itemprop="datePublished">
          2012-05-15
      </time>
    
    
    | 
    <a href='/tags/think/'>think</a>
    
    
</span>
                <h1>手机App的购物车必须登陆</h1>
            </div>
        </div>
        <!--<div class="col-md-8 col-md-offset-2">-->
        <div class="col-md-offset-2">
      		<p>&#x4ECE;Web&#x5230;&#x79FB;&#x52A8;&#x4E92;&#x8054;&#x7F51;&#xFF0C;&#x7535;&#x5546;&#x51E0;&#x4E4E;&#x6539;&#x53D8;&#x4E86;&#x4EBA;&#x4EEC;&#x7684;&#x751F;&#x6D3B;&#xFF0C;&#x7EC6;&#x601D;&#x6050;&#x6781;&#xFF0C;&#x867D;&#x7136;&#x79BB;&#x6C83;&#x5C14;&#x739B;&#x53EA;&#x6709;&#x4E09;&#x7AD9;&#x5730;&#x7684;&#x8DDD;&#x79BB;&#xFF0C;&#x4F46;&#x81EA;&#x4ECE;&#x4F7F;&#x7528;&#x4E86;&#x5929;&#x732B;&#x8D85;&#x5E02;&#xFF0C;&#x7ADF;&#x7136;&#x6709;4&#x4E2A;&#x6708;&#x6CA1;&#x53BB;&#x8FC7;&#x5356;&#x573A;&#x3002;&#x79D1;&#x6280;&#x6539;&#x53D8;&#x751F;&#x6D3B;&#xFF0C;&#x8BA9;&#x6F5C;&#x8D28;&#x4E0A;&#x6709;&#x5B85;&#x7537;&#x503E;&#x5411;&#x7684;&#x4EBA;&#x6210;&#x529F;&#x53D8;&#x6210;&#x4E86;&#x5B85;&#x7537;&#x3002;&#x4E92;&#x8054;&#x7F51;&#xFF0C;&#x770B;&#x4F3C;&#x8EAB;&#x5728;&#x7F51;&#x5916;&#xFF0C;&#x5176;&#x5B9E;&#x5168;&#x5728;&#x7F51;&#x4E2D;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#x6709;&#x610F;&#x601D;&#x7684;&#x4E8B;&#x6765;&#x4E86;&#xFF0C;&#x5728;&#x7F51;&#x4E0A;&#x8D2D;&#x7269;&#x65F6;&#x4F1A;&#x6709;&#x4E00;&#x4E2A;&#x4E0D;&#x592A;&#x88AB;&#x6CE8;&#x610F;&#x7684;&#x7EC6;&#x8282;&#xFF0C;&#x7F51;&#x7AD9;&#x8D2D;&#x7269;&#xFF0C;&#x52A0;&#x5165;&#x8D2D;&#x7269;&#x8F66;&#x65F6;&#x5E76;&#x4E0D;&#x9700;&#x8981;&#x767B;&#x9646;&#xFF0C;&#x53EA;&#x6709;&#x7ED3;&#x7B97;&#x65F6;&#x624D;&#x9700;&#x767B;&#x9646;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x79FB;&#x52A8;&#x7AEF;&#x5462;&#xFF0C;&#x60C5;&#x51B5;&#x5168;&#x7136;&#x4E0D;&#x540C;&#xFF0C;&#x53EA;&#x8981;&#x6709;&#x8D2D;&#x7269;&#x8F66;&#x7684;&#x5E94;&#x7528;&#xFF0C;&#x70B9;&#x5230;&#x8D2D;&#x7269;&#x8F66;&#x9009;&#x9879;&#xFF0C;&#x4E00;&#x5B9A;&#x4F1A;&#x8981;&#x6C42;&#x767B;&#x9646;&#xFF0C;&#x4E00;&#x4E2A;&#x672C;&#x8D28;&#x4E0A;&#x76F8;&#x540C;&#x7684;&#x7F51;&#x4E0A;&#x8D2D;&#x7269;&#x884C;&#x4E3A;&#x4E3A;&#x4EC0;&#x4E48;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x7EC8;&#x7AEF;&#x4F1A;&#x51FA;&#x73B0;&#x622A;&#x7136;&#x4E0D;&#x540C;&#x7684;&#x884C;&#x4E3A;&#x5462;&#x3002;</p>
<p>&#x4EE5;&#x4EAC;&#x4E1C;&#x4E3A;&#x4F8B;&#xFF0C;&#x5728;&#x6211;&#x4EEC;&#x6CA1;&#x6709;&#x767B;&#x9646;&#x65F6;&#xFF0C;&#x70B9;&#x51FB;&#x4E00;&#x6B3E;&#x4EA7;&#x54C1;&#x52A0;&#x5165;&#x8D2D;&#x7269;&#x8F66;&#xFF0C;&#x5982;&#x56FE;&#xFF1A;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1170656-4fb54bd6e6dae00f.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt=""><br>&#x5F53;&#x6211;&#x4EEC;&#x6E05;&#x9664;Cookie&#x540E;,&#x5237;&#x65B0;&#xFF1A;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1170656-a3c8dc5e72176068.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt=""></p>
<p>&#x8D2D;&#x7269;&#x8F66;&#x91CC;&#x7684;&#x5546;&#x54C1;&#x6CA1;&#x4E86;&#xFF0C;&#x7531;&#x6B64;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#xFF0C;&#x6B64;&#x65F6;&#x8D2D;&#x7269;&#x8F66;&#x91CC;&#x7684;&#x5546;&#x54C1;&#x662F;&#x653E;&#x5728;cookie&#x91CC;&#x7684;&#x3002;&#x5982;&#x679C;&#x4E0D;&#x6E05;&#x9664;cookie&#xFF0C;&#x6362;&#x4E2A;&#x6D4F;&#x89C8;&#x5668;&#x4E5F;&#x662F;&#x770B;&#x4E0D;&#x5230;&#x8D2D;&#x7269;&#x8F66;&#x91CC;&#x7684;&#x5546;&#x54C1;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x6BCF;&#x4E2A;&#x6D4F;&#x89C8;&#x5668;&#x7684;cookie&#x662F;&#x4E0D;&#x901A;&#x7528;&#x7684;&#x3002;</p>
<p>&#x5728;&#x767B;&#x9646;&#x72B6;&#x6001;&#x4E0B;&#x5462;&#xFF0C;&#x7F51;&#x8D2D;&#x8FC7;&#x7684;&#x4EBA;&#x4EEC;&#x90FD;&#x6E05;&#x695A;&#xFF0C;&#x5728;A&#x5730;&#x52A0;&#x5165;&#x8D2D;&#x7269;&#x8F66;&#x91CC;&#x7684;&#x5546;&#x54C1;&#x5728;B&#x5730;&#x6253;&#x5F00;&#x6D4F;&#x89C8;&#x5668;&#x7167;&#x6837;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x5176;&#x5B9E;&#x8FD9;&#x65F6;&#xFF0C;&#x8D2D;&#x7269;&#x8F66;&#x91CC;&#x7684;&#x5546;&#x54C1;&#x662F;&#x8BB0;&#x5F55;&#x5728;&#x670D;&#x52A1;&#x5668;&#x7684;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#xFF0C;&#x5BF9;&#x4E8E;&#x5982;IOS&#x8FD9;&#x6837;&#x7684;&#x79FB;&#x52A8;&#x7AEF;&#x5462;&#xFF0C;IOS&#x4E5F;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x672C;&#x5730;&#x5B58;&#x50A8;&#x554A;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;&#x8FD9;&#x4E48;&#x505A;&#x5462;&#x3002;&#x5176;&#x5B9E;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x6807;&#x8BC6;&#x7528;&#x6237;&#x7684;&#x6982;&#x5FF5;&#x4E86;&#xFF0C;&#x4E0D;&#x8BBA;&#x662F;&#x6D4F;&#x89C8;&#x5668;&#x8FD8;&#x662F;&#x79FB;&#x52A8;&#x7AEF;&#xFF0C;&#x52A0;&#x5165;&#x8D2D;&#x7269;&#x8F66;&#x5E76;&#x4E0D;&#x6784;&#x6210;&#x8D2D;&#x4E70;&#xFF0C;&#x53EA;&#x6709;&#x7ED3;&#x7B97;&#x652F;&#x4ED8;&#x540E;&#x8D2D;&#x4E70;&#x624D;&#x7B97;&#x5B8C;&#x6210;&#xFF0C;&#x8D2D;&#x7269;&#x8F66;&#x4E0D;&#x8FC7;&#x662F;&#x7528;&#x6237;&#x4E00;&#x65F6;&#x7684;&#x559C;&#x597D;&#x7F62;&#x4E86;&#xFF0C;&#x94B1;&#x8FD8;&#x6CA1;&#x8D5A;&#x515C;&#x91CC;&#xFF0C;&#x4E00;&#x5207;&#x90FD;&#x8FD8;&#x592A;&#x65E9;&#x3002;</p>
<p>&#x6D4F;&#x89C8;&#x5668;&#xFF0C;&#x5BF9;&#x4E8E;&#x5927;&#x4F17;&#x6765;&#x8BF4;&#x51E0;&#x4E4E;&#x662F;&#x4E00;&#x4E2A;&#x516C;&#x5171;&#x4EA7;&#x54C1;&#xFF0C;&#x5373;&#x4F7F;&#x662F;&#x79C1;&#x4EBA;&#x7535;&#x8111;&#xFF0C;&#x88AB;&#x670B;&#x53CB;&#x7528;&#x6765;&#x8D2D;&#x7269;&#x4E5F;&#x5F88;&#x6B63;&#x5E38;&#xFF0C;&#x8FD9;&#x91CC;&#x5C31;&#x4F1A;&#x5B58;&#x5728;&#x4E24;&#x79CD;&#x884C;&#x4E3A;&#xFF0C;&#x4E00;&#x79CD;&#x662F;&#x6D4F;&#x89C8;&#x5668;&#x6D4F;&#x89C8;&#x67D0;&#x7535;&#x5546;&#x7F51;&#x7AD9;&#x65E0;&#x4E3B;&#x72B6;&#x6001;&#xFF0C;&#x4E00;&#x79CD;&#x662F;&#x7279;&#x5B9A;&#x7528;&#x6237;&#x767B;&#x9646;&#x72B6;&#x6001;&#x3002;&#x5728;&#x7F51;&#x7AD9;&#x672A;&#x767B;&#x9646;&#x72B6;&#x6001;&#xFF0C;&#x52A0;&#x5165;&#x8D2D;&#x7269;&#x8F66;&#x7684;&#x5546;&#x54C1;&#x662F;&#x5171;&#x7528;&#x7684;&#xFF0C;&#x5728;&#x4E0D;&#x6E05;&#x7A7A;cookie&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4EFB;&#x4F55;&#x4EBA;&#x90FD;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x4F46;&#x8FD9;&#x4E0D;&#x6784;&#x6210;&#x8D2D;&#x4E70;&#x884C;&#x4E3A;&#xFF0C;&#x767B;&#x9646; -&gt;&#x7ED3;&#x7B97;&#xFF0C;&#x5B8C;&#x6210;&#x5546;&#x4E1A;&#x95ED;&#x73AF;&#x3002;&#x5728;&#x767B;&#x9646;&#x72B6;&#x6001;&#x4E0B;&#xFF0C;&#x52A0;&#x5165;&#x8D2D;&#x7269;&#x8F66;&#x6216;&#x662F;&#x76F4;&#x63A5;&#x8D2D;&#x4E70;&#x7ED3;&#x7B97;&#x3002;&#x8D2D;&#x7269;&#x8F66;&#x884C;&#x4E3A;&#x662F;&#x4F1A;&#x5F71;&#x54CD;&#x5230;&#x5E7F;&#x544A;&#x8FD0;&#x8425;&#x5546;&#x7684;&#x9488;&#x5BF9;&#x6027;&#x6295;&#x653E;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x67D0;&#x5929;&#x5728;&#x8D2D;&#x7269;&#x8F66;&#x91CC;&#x52A0;&#x5165;&#x4E86;&#x67D0;&#x7C7B;&#x5546;&#x54C1;&#xFF0C;&#x5728;&#x5176;&#x4ED6;&#x4E0D;&#x76F8;&#x5E72;&#x7684;&#x7F51;&#x7AD9;&#x5F88;&#x6709;&#x53EF;&#x80FD;&#x4F1A;&#x770B;&#x5230;&#x76F8;&#x5173;&#x63A8;&#x8350;&#xFF0C;&#x90A3;&#x662F;&#x56E0;&#x4E3A;&#x4F60;&#x7684;&#x884C;&#x4E3A;&#x5DF2;&#x7ECF;&#x5165;&#x4E91;&#x4E86;&#xFF0C;&#x4E0D;&#x8981;&#x5BB3;&#x6015;&#xFF0C;&#x4E00;&#x76F4;&#x5728;&#x88F8;&#x6CF3;&#xFF0C;&#x53EA;&#x662F;&#x6CA1;&#x6709;&#x610F;&#x8BC6;&#x5230;&#x7F62;&#x4E86;&#x3002;</p>
<p>&#x90A3;&#x79FB;&#x52A8;&#x7AEF;&#x5462;&#xFF0C;&#x5728;&#x624B;&#x673A;&#x8986;&#x76D6;&#x9762;&#x5065;&#x5168;&#x7684;&#x5F53;&#x4E0B;&#xFF0C;&#x624B;&#x673A;&#x51E0;&#x4E4E;&#x6210;&#x4E86;&#x4EBA;&#x7C7B;&#x80A2;&#x4F53;&#x7684;&#x4E00;&#x4E2A;&#x4E0D;&#x53EF;&#x6216;&#x7F3A;&#x7684;&#x5EF6;&#x4F38;&#xFF0C;&#x4F20;&#x7EDF;&#x4E92;&#x8054;&#x7F51;&#x8FD8;&#x6CA1;&#x6709;&#x8FD9;&#x4E48;&#x4E25;&#x91CD;&#xFF0C;&#x624B;&#x673A;&#x5374;&#x6210;&#x4E86;&#x4EBA;&#x4EEC;&#x7684;&#x79C1;&#x5C5E;&#xFF0C;&#x91CC;&#x9762;&#x6216;&#x591A;&#x6216;&#x5C11;&#x4F1A;&#x6709;&#x4E9B;&#x9690;&#x79C1;&#xFF0C;&#x6240;&#x4EE5;&#x6709;&#x4E9B;&#x4EBA;&#x89C1;&#x4E0D;&#x5F97;&#x522B;&#x4EBA;&#x4F7F;&#x7528;&#x81EA;&#x5DF1;&#x7684;&#x624B;&#x673A;&#x3002;&#x79FB;&#x52A8;&#x7AEF;&#x56E0;&#x4E3A;&#x5C4F;&#x5E55;&#x7684;&#x9650;&#x5236;&#xFF0C;&#x5448;&#x73B0;&#x7684;&#x754C;&#x9762;&#x6709;&#x9650;&#xFF0C;&#x5982;WEB&#x822C;&#x6295;&#x653E;&#x5E7F;&#x544A;&#x5C31;&#x4E0D;&#x90A3;&#x4E48;&#x65B9;&#x4FBF;&#xFF0C;&#x5BA2;&#x6237;&#x4F7F;&#x7528;&#x79FB;&#x52A8;&#x7EC8;&#x7AEF;&#x672C;&#x8EAB;&#x5C31;&#x5DF2;&#x7ECF;&#x88AB;&#x5546;&#x5BB6;&#x5B9A;&#x4E49;&#x4E3A;&#x4E86;&#x5BA2;&#x6237;&#xFF0C;&#x7528;&#x6237;&#x5B9A;&#x4F4D;&#x5728;&#x7528;&#x6237;&#x4E0B;&#x8F7D;App&#x7684;&#x90A3;&#x4E00;&#x523B;&#x5C31;&#x5DF2;&#x7ECF;&#x5B8C;&#x6210;&#xFF0C;&#x6240;&#x4EE5;&#x5BF9;&#x4E8E;&#x79FB;&#x52A8;&#x7AEF;&#x7684;&#x8D2D;&#x7269;&#x8F66;&#xFF0C;&#x60F3;&#x52A0;&#x5165;&#x8D2D;&#x7269;&#x8F66;&#xFF0C;&#x90A3;&#x5C31;&#x5148;&#x767B;&#x5F55;&#x5427;&#x3002;&#x800C;&#x4E14;&#xFF0C;&#x5728;&#x79FB;&#x52A8;&#x7EC8;&#x7AEF;&#x767B;&#x5F55;&#x540E;&#x5982;&#x679C;&#x4E0D;&#x662F;&#x624B;&#x52A8;&#x9000;&#x51FA;&#xFF0C;&#x5C31;&#x4E00;&#x76F4;&#x5728;&#x767B;&#x9646;&#x72B6;&#x6001;&#xFF0C;&#x8FD9;&#x79CD;&#x884C;&#x4E3A;&#x6709;&#x610F;&#x7684;&#x51CF;&#x5C11;&#x4E86;&#x7528;&#x6237;&#x8D2D;&#x4E70;&#x6240;&#x9700;&#x8981;&#x7684;&#x6B65;&#x9AA4;&#xFF0C;&#x672C;&#x8D28;&#x4E0A;&#x662F;&#x5BF9;&#x5546;&#x4E1A;&#x884C;&#x4E3A;&#x7684;&#x4E00;&#x79CD;&#x4F18;&#x5316;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x5728;&#x79FB;&#x52A8;&#x7AEF;&#x7684;&#x8D2D;&#x7269;&#x8F66;&#x754C;&#x9762;&#xFF0C;&#x52A0;&#x5165;&#x8D2D;&#x7269;&#x8F66;&#x7684;&#x5546;&#x54C1;&#x5728;&#x8BA1;&#x7B97;&#x5546;&#x54C1;&#x4EF7;&#x683C;&#x65F6;&#xFF0C;&#x9700;&#x4E0D;&#x9700;&#x8981;&#x8054;&#x7F51;&#x5462;&#x3002;&#x7B54;&#x6848;&#x662F;&#x9700;&#x8981;&#x7684;&#xFF0C;</p>
<p>&#x5728;&#x6CA1;&#x7F51;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x6253;&#x5F00;&#x8D2D;&#x7269;&#x8F66;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1170656-31192d7e99c01819.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt=""></p>
<p>&#x754C;&#x9762;&#x662F;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x7684;&#xFF0C;&#x7ED3;&#x7B97;&#x91D1;&#x989D;&#x4E5F;OK&#x3002;</p>
<p>&#x5F53;&#x6211;&#x4EEC;&#x70B9;&#x51FB;&#x5546;&#x54C1;&#x7684;&#x52A0;&#x53F7;&#x540E;&#xFF0C;&#x60C5;&#x51B5;&#x5C31;&#x5168;&#x7136;&#x4E0D;&#x540C;&#x4E86;&#x3002;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1170656-49dafaa215a67b1a.jpg?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt=""></p>
<p>&#x662F;&#x4E86;&#xFF0C;&#x60A8;&#x8FD8;&#x662F;&#x9700;&#x8981;&#x8054;&#x7F51;&#x7684;&#xFF0C;&#x4F60;&#x4F1A;&#x8BF4;&#x6211;&#x8FD8;&#x6CA1;&#x6709;&#x7ED3;&#x7B97;&#x554A;&#xFF0C;&#x53EA;&#x662F;&#x628A;&#x5546;&#x54C1;&#x7684;&#x4E2A;&#x6570;&#x6539;&#x53D8;&#x4E86;&#x4E0B;&#xFF0C;&#x60C5;&#x51B5;&#x4E0D;&#x662F;&#x60A8;&#x60F3;&#x7684;&#x90A3;&#x6837;&#x3002;&#x5982;&#x679C;&#x60A8;&#x5728;&#x7F51;&#x901F;&#x4E0D;&#x662F;&#x5F88;&#x597D;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x6539;&#x53D8;&#x5546;&#x54C1;&#x7684;&#x4E2A;&#x6570;&#xFF0C;&#x6709;&#x6CA1;&#x6709;&#x53D1;&#x73B0;&#x754C;&#x9762;&#x5176;&#x5B9E;&#x662F;&#x6709;&#x52A0;&#x8F7D;&#x52A8;&#x4F5C;&#x7684;&#xFF0C;&#x6BCF;&#x4EF6;&#x5546;&#x54C1;&#x5728;&#x8D2D;&#x7269;&#x8F66;&#x91CC;&#x7684;&#x884C;&#x4E3A;&#x5176;&#x5B9E;&#x5DF2;&#x7ECF;&#x548C;&#x670D;&#x52A1;&#x5668;&#x901A;&#x8FC7;&#x591A;&#x7EBF;&#x7A0B;&#x4EA4;&#x4E92;&#x4E86;&#xFF0C;&#x5F00;&#x53D1;&#x8D2D;&#x7269;&#x8F66;&#x7684;&#x5C0F;&#x4F19;&#x4F34;&#x662F;&#x4E0D;&#x662F;&#x6DF1;&#x6709;&#x611F;&#x89E6;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#x95EE;&#x9898;&#x6765;&#x4E86;&#xFF0C;&#x79FB;&#x52A8;&#x7AEF;&#x6709;&#x6CA1;&#x6709;&#x8BB0;&#x5F55;&#x7528;&#x6237;&#x7684;&#x8D2D;&#x4E70;&#x884C;&#x4E3A;&#x5462;&#xFF0C;&#x54C8;&#x54C8;&#xFF0C;&#x522B;&#x592A;&#x5929;&#x771F;&#xFF0C;&#x5546;&#x4E1A;&#x516C;&#x53F8;&#x4E0D;&#x662F;&#x5929;&#x4F7F;&#xFF0C;&#x7528;&#x6237;&#x7684;&#x884C;&#x4E3A;&#x5C31;&#x662F;&#x91D1;&#x94B1;&#xFF0C;&#x5728;&#x4E0D;&#x77E5;&#x4E0D;&#x89C9;&#x4E2D;&#x6211;&#x4EEC;&#x65E9;&#x5DF2;&#x662F;&#x5927;&#x6570;&#x636E;&#x4E2D;&#x7684;&#x4E00;&#x5458;&#xFF0C;&#x5728;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x5F53;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x65E9;&#x5DF2;&#x88AB;&#x6252;&#x7684;&#x4F53;&#x65E0;&#x5B8C;&#x80A4;&#x3002;</p>

            <div class="clearfix"></div>
            <hr class="nogutter">
        </div>


        <nav class="pagination" role="pagination">


<div class="ds-share flat" data-thread-key="2012/05/15/手机App的购物车必须登陆/" data-title="手机App的购物车必须登陆" data-images="https://avatars0.githubusercontent.com/u/10378248?v=3&s=460" data-content="手机App的购物车必须登陆 是最近写的文章，希望能帮到您！" data-url="https://dangdangfeng.github.io/2012/05/15/手机App的购物车必须登陆/">
    <div class="ds-share-inline">
      <ul  class="ds-share-icons-16">
        
        <li data-toggle="ds-share-icons-more"><a class="ds-more" href="javascript:void(0);">分享到：</a></li>
        <li><a class="ds-weibo" href="javascript:void(0);" data-service="weibo">微博</a></li>
        <li><a class="ds-qzone" href="javascript:void(0);" data-service="qzone">QQ空间</a></li>
        <li><a class="ds-qqt" href="javascript:void(0);" data-service="qqt">腾讯微博</a></li>
        <li><a class="ds-wechat" href="javascript:void(0);" data-service="wechat">微信</a></li>
        
      </ul>
      <div class="ds-share-icons-more">
      </div>
    </div>
 </div>

 <br/>

    
    <a class="pull-left" href="/2012/08/30/如何优雅的谈论HTTP／1-0／1-1／2-0/" style="float: left;">
        ← 如何优雅的谈论HTTP／1.0／1.1／2.0
    </a>
    
    
    <a class="pull-right" href="/2012/03/11/优秀的团队该不该使用敏捷开发/">
        优秀的团队该不该使用敏捷开发 →
    </a>
    

    
</nav>



        
        <div class="duoshuo">


<div class="ds-thread" data-thread-key="2012/05/15/手机App的购物车必须登陆/" data-title="手机App的购物车必须登陆" data-url="https://dangdangfeng.github.io/2012/05/15/手机App的购物车必须登陆/"></div>



<script type="text/javascript">
var duoshuoQuery = {short_name:"deter"};
(function() {
	var ds = document.createElement('script');
	ds.type = 'text/javascript';ds.async = true;
	ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
	ds.charset = 'UTF-8';
	(document.getElementsByTagName('head')[0] 
	 || document.getElementsByTagName('body')[0]).appendChild(ds);
})();
</script>
</div>
    </div>
</section>


      
<!-- ============================ Footer =========================== -->

<footer>
    <div class="container">
            <div class="copy">
                <p>
                    &copy; 2010<script>new Date().getFullYear()>2010&&document.write("-"+new Date().getFullYear());</script>, Content By 吴白. All Rights Reserved.
                </p>
                <p>Theme By <a href="//go.kieran.top" style="color: #767D84">Kieran</a></p>
            </div>
            <div class="social">
                <ul>
                    
                    <li><a href="https://github.com/" title="Github" target="_blank"><i class="icon-github"></i></a>&nbsp;</li>
                    
                    
                    <li><a href="https://twitter.com/" title="Twitter" target="_blank"><i class="icon-twitter"></i></a>&nbsp;</li>
                    
                    
                    <li><a href="https://www.facebook.com/" title="Facebook" target="_blank"><i class="icon-facebook"></i></a>&nbsp;</li>
                    
                    
                    <li><a href="https://google.com/" title="Google-Plus" target="_blank"><i class="icon-google-plus"></i></a>&nbsp;</li>
                    
                    
                    <li><a href="http://weibo.com/" title="Sina-Weibo" target="_blank"><i class="icon-sina-weibo"></i></a>&nbsp;</li>
                    
                </ul>
            </div>
            <div class="clearfix"> </div>
        </div>
</footer>

<!-- ============================ END Footer =========================== -->
      <!-- Load our scripts -->
        
<!-- Resizable 'on-demand' full-height hero -->
<script type="text/javascript">
    
    var resizeHero = function () {
        var hero = $(".cover,.heightblock"),
            window1 = $(window);
        hero.css({
            "height": window1.height()
        });
    };
    
    resizeHero();
    
    $(window).resize(function () {
        resizeHero();
    });
</script>
<script src="/js/plugins.min.js"></script><!-- Bootstrap core and concatenated plugins always load here -->
<script src="/js/jquery.flexslider-min.js"></script><!-- Flexslider plugin -->
<script src="/js/scripts.js"></script><!-- Theme scripts -->

<!-- Initiate flexslider plugin -->
<script type="text/javascript">
    $(document).ready(function($) {
      $('.flexslider').flexslider({
        animation: "fade",
        prevText: "",
        nextText: "",
        directionNav: true
      });
    });
</script>

</body>
</html>
