<!DOCTYPE html>
<!--[if lte IE 8 ]>
<html class="ie" xmlns="http://www.w3.org/1999/xhtml" xml:lang="en-US" lang="en-US">
<![endif]-->
<!--[if (gte IE 9)|!(IE)]><!-->
<!--
***************  *      *     *
      8          *    *       *
      8          *  *         *
      8          **           *
      8          *  *         *
      8          *    *       *
      8          *      *     *
      8          *        *   ***********    -----Theme By Kieran(http://go.kieran.top)
-->
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en-US" lang="en-US">
<!--<![endif]-->

<head>
  <title>守护进程的操守 | 流城</title>
  <!-- Meta data -->
    <meta http-equiv="Content-Type" content="text/html" charset="UTF-8" >
    <meta http-equiv="X-UA-Compatible" content="IE=edge"/>
    <meta name="viewport" content="width=device-width, initial-scale=1.0" />
    <meta name="generator" content="流城">
    <meta name="author" content="吴白">
    <meta name="description" content="" />
    <meta name="keywords" content="" />

    <!-- Favicon, (keep icon in root folder) -->
    <link rel="Shortcut Icon" href="/img/favicon.ico" type="image/ico">

    <link rel="alternate" href="/atom.xml" title="流城" type="application/atom+xml">
    <link rel="stylesheet" href="/css/all.css" media="screen" type="text/css">
	
    <link rel="stylesheet" href="/highlightjs/vs.css" type="text/css">
    
    

    <!-- Custom stylesheet, (add custom styles here, always load last) -->
    <!-- Load our stylesheet for IE8 -->
    <!--[if IE 8]>
    <link rel="stylesheet" type="text/css" href="/css/ie8.css" />
    <![endif]-->

    <!-- Google Webfonts (Monserrat 400/700, Open Sans 400/600) -->
    <!--<link href='//fonts.useso.com/css?family=Montserrat:400,700' rel='stylesheet' type='text/css'>-->
    <!--<link href='//fonts.useso.com/css?family=Open+Sans:400,600' rel='stylesheet' type='text/css'>-->

    <!-- Load our fonts individually if IE8+, to avoid faux bold & italic rendering -->
    <!--[if IE]>
    <!--<link href='http://fonts.useso.com/css?family=Montserrat:400' rel='stylesheet' type='text/css'> -->
    <!--<link href='http://fonts.useso.com/css?family=Montserrat:700' rel='stylesheet' type='text/css'> -->
    <!--<link href='http://fonts.useso.com/css?family=Open+Sans:400' rel='stylesheet' type='text/css'>-->
    <!--<link href='http://fonts.useso.com/css?family=Open+Sans:600' rel='stylesheet' type='text/css'>-->
    <![endif]-->

    <!-- jQuery | Load our jQuery, with an alternative source fallback to a local version if request is unavailable -->
    <script src="/js/jquery-1.11.1.min.js"></script>
    <script>window.jQuery || document.write('<script src="js/jquery-1.11.1.min.js"><\/script>')</script>

    <!-- Load these in the <head> for quicker IE8+ load times -->
    <!-- HTML5 shim and Respond.js IE8 support of HTML5 elements and media queries -->
    <!--[if lt IE 9]>
    <script src="/js/html5shiv.min.js"></script>
    <script src="/js/respond.min.js"></script>
    <![endif]-->










  
  
  <link rel="alternate" type="application/atom+xml" title="Atom 0.3" href="atom.xml">
  
  

  
  <style>.col-md-8.col-md-offset-2.opening-statement img{display:none;}</style>
</head>

<!--
<body class="post-template">
-->
<body id="index" class="lightnav animsition">

      <!-- ============================ Off-canvas navigation =========================== -->

    <div class="sb-slidebar sb-right sb-style-overlay sb-momentum-scrolling">
        <div class="sb-close" aria-label="Close Menu" aria-hidden="true">
            <img src="/img/close.png" alt="Close"/>
        </div>
        <!-- Lists in Slidebars -->
        <ul class="sb-menu">
            <li><a href="/" class="animsition-link" title="Home">Home</a></li>
            <li><a href="/archives" class="animsition-link" title="archive">archives</a></li>
            <!-- Dropdown Menu -->
			 
            <li>
                <a class="sb-toggle-submenu">Works<span class="sb-caret"></span></a>
                <ul class="sb-submenu">
                    
                        <li><a href="http://www.gome.com.cn" target="_BLANK" class="animsition-link">Gome</a></li>
                    
                        <li><a href="http://www.yintai.com" target="_BLANK" class="animsition-link">YinTai</a></li>
                    
                </ul>
            </li>
            
            
            
            <li>
                <a class="sb-toggle-submenu">Links<span class="sb-caret"></span></a>
                <ul class="sb-submenu">
                    
                    <li><a href="http://www.jianshu.com/users/211925b3ca7c/latest_articles" class="animsition-link">吴白</a></li>
                    
                    <li><a href="http://www.jianshu.com/users/19f4bf67c705/latest_articles" class="animsition-link">吴禅</a></li>
                    
                </ul>
            </li>
            
        </ul>
        <!-- Lists in Slidebars -->
        <ul class="sb-menu secondary">
            <li><a href="/about" class="animsition-link" title="about">About</a></li>
            <li><a href="/atom.xml" class="animsition-link" title="rss">RSS</a></li>
        </ul>
    </div>
    
    <!-- ============================ END Off-canvas navigation =========================== -->

    <!-- ============================ #sb-site Main Page Wrapper =========================== -->

    <div id="sb-site">
        <!-- #sb-site - All page content should be contained within this id, except the off-canvas navigation itself -->

        <!-- ============================ Header & Logo bar =========================== -->

        <div id="navigation" class="navbar navbar-fixed-top">
            <div class="navbar-inner">
                <div class="container">
                    <!-- Nav logo -->
                    <div class="logo">
                        <a href="/" title="Logo" class="animsition-link">
                         <img src="/img/logo.png" alt="Logo" width="35px;"/> 
                        </a>
                    </div>
                    <!-- // Nav logo -->
                    <!-- Info-bar -->
                    <nav>
                        <ul class="nav">
                            <li><a href="/" class="animsition-link">流城</a></li>
                            <li class="nolink"><span>Always </span>Creative.</li>
                            
                            <li><a href="https://github.com/" title="Github" target="_blank"><i class="icon-github"></i></a></li>
                            
                            
                            <li><a href="https://twitter.com/" title="Twitter" target="_blank"><i class="icon-twitter"></i></a></li>
                            
                            
                            <li><a href="https://www.facebook.com/" title="Facebook" target="_blank"><i class="icon-facebook"></i></a></li>
                            
                            
                            <li><a href="https://google.com/" title="Google-Plus" target="_blank"><i class="icon-google-plus"></i></a></li>
                            
                            
                            <li><a href="http://weibo.com/" title="Sina-Weibo" target="_blank"><i class="icon-sina-weibo"></i></a></li>
                            
                            <li class="nolink"><span>Welcome!</span></li>
                        </ul>
                    </nav>
                    <!--// Info-bar -->
                </div>
                <!-- // .container -->
                <div class="learnmore sb-toggle-right">More</div>
                <button type="button" class="navbar-toggle menu-icon sb-toggle-right" title="More">
                <span class="sr-only">Toggle navigation</span>
                <span class="icon-bar before"></span>
                <span class="icon-bar main"></span>
                <span class="icon-bar after"></span>
                </button>
            </div>
            <!-- // .navbar-inner -->
        </div>

        <!-- ============================ Header & Logo bar =========================== -->


      
<section id="intro">
    <div class="container">
        <div class="row col-md-offset-2">
            <div class="col-md-8">
    			<span class="post-meta">
      <time datetime="2010-12-03T05:19:35.000Z" itemprop="datePublished">
          2010-12-03
      </time>
    
    
    | 
    <a href='/tags/技术/'>技术</a>
    
    
</span>
                <h1>守护进程的操守</h1>
            </div>
        </div>
        <!--<div class="col-md-8 col-md-offset-2">-->
        <div class="col-md-offset-2">
      		<blockquote>
<p>However, because most daemons are not linked against Foundation or the Application Kit, the low-level APIs are often more appropriate</p>
</blockquote>
<p>&#x5B88;&#x62A4;&#x8FDB;&#x7A0B;&#xFF08;Daemon&#xFF09;&#x662F;&#x4E00;&#x79CD;&#x8FD0;&#x884C;&#x5728;&#x540E;&#x53F0;&#x7684;&#x4E00;&#x79CD;&#x7279;&#x6B8A;&#x7684;&#x8FDB;&#x7A0B;&#xFF0C;&#x5B83;&#x72EC;&#x7ACB;&#x4E8E;&#x63A7;&#x5236;&#x7EC8;&#x7AEF;&#x5E76;&#x4E14;&#x5468;&#x671F;&#x6027;&#x7684;&#x6267;&#x884C;&#x67D0;&#x79CD;&#x4EFB;&#x52A1;&#x6216;&#x7B49;&#x5F85;&#x5904;&#x7406;&#x67D0;&#x4E9B;&#x53D1;&#x751F;&#x7684;&#x4E8B;&#x4EF6;&#x3002;&#x7531;&#x4E8E;&#x5728;linux&#x4E2D;&#xFF0C;&#x6BCF;&#x4E2A;&#x7CFB;&#x7EDF;&#x4E0E;&#x7528;&#x6237;&#x8FDB;&#x884C;&#x4EA4;&#x6D41;&#x7684;&#x754C;&#x9762;&#x6210;&#x4E3A;&#x7EC8;&#x7AEF;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x4ECE;&#x6B64;&#x7EC8;&#x7AEF;&#x5F00;&#x59CB;&#x8FD0;&#x884C;&#x7684;&#x8FDB;&#x7A0B;&#x90FD;&#x4F1A;&#x4F9D;&#x9644;&#x4E8E;&#x8FD9;&#x4E2A;&#x7EC8;&#x7AEF;&#xFF0C;&#x8FD9;&#x4E2A;&#x7EC8;&#x7AEF;&#x88AB;&#x79F0;&#x4E3A;&#x8FD9;&#x4E9B;&#x8FDB;&#x7A0B;&#x7684;&#x63A7;&#x5236;&#x7EC8;&#x7AEF;&#xFF0C;&#x5F53;&#x63A7;&#x5236;&#x7EC8;&#x7AEF;&#x88AB;&#x5173;&#x95ED;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x76F8;&#x5E94;&#x7684;&#x8FDB;&#x7A0B;&#x90FD;&#x4F1A;&#x81EA;&#x52A8;&#x5173;&#x95ED;&#x3002;&#x4F46;&#x662F;&#x5B88;&#x62A4;&#x8FDB;&#x7A0B;&#x5374;&#x80FD;&#x7A81;&#x7834;&#x8FD9;&#x79CD;&#x9650;&#x5236;&#xFF0C;&#x5B83;&#x8131;&#x79BB;&#x4E8E;&#x7EC8;&#x7AEF;&#x5E76;&#x4E14;&#x5728;&#x540E;&#x53F0;&#x8FD0;&#x884C;&#xFF0C;&#x5E76;&#x4E14;&#x5B83;&#x8131;&#x79BB;&#x7EC8;&#x7AEF;&#x7684;&#x76EE;&#x7684;&#x662F;&#x4E3A;&#x4E86;&#x907F;&#x514D;&#x8FDB;&#x7A0B;&#x5728;&#x8FD0;&#x884C;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x7684;&#x4FE1;&#x606F;&#x5728;&#x4EFB;&#x4F55;&#x7EC8;&#x7AEF;&#x4E2D;&#x663E;&#x793A;&#x5E76;&#x4E14;&#x8FDB;&#x7A0B;&#x4E5F;&#x4E0D;&#x4F1A;&#x88AB;&#x4EFB;&#x4F55;&#x7EC8;&#x7AEF;&#x6240;&#x4EA7;&#x751F;&#x7684;&#x7EC8;&#x7AEF;&#x4FE1;&#x606F;&#x6240;&#x6253;&#x65AD;&#x3002;&#x5B83;&#x4ECE;&#x88AB;&#x6267;&#x884C;&#x7684;&#x65F6;&#x5019;&#x5F00;&#x59CB;&#x8FD0;&#x8F6C;&#xFF0C;&#x76F4;&#x5230;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x5173;&#x95ED;&#x624D;&#x9000;&#x51FA;&#x3002;&#x5982;&#x679C;&#x60F3;&#x8BA9;&#x67D0;&#x4E2A;&#x8FDB;&#x7A0B;&#x4E0D;&#x56E0;&#x4E3A;&#x7528;&#x6237;&#x6216;&#x4E2D;&#x65AD;&#x6216;&#x5176;&#x4ED6;&#x53D8;&#x5316;&#x800C;&#x5F71;&#x54CD;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x5FC5;&#x987B;&#x628A;&#x8FD9;&#x4E2A;&#x8FDB;&#x7A0B;&#x53D8;&#x6210;&#x4E00;&#x4E2A;&#x5B88;&#x62A4;&#x8FDB;&#x7A0B;&#x3002;linux&#x5927;&#x591A;&#x6570;&#x670D;&#x52A1;&#x5668;&#x8FDB;&#x7A0B;&#x5C31;&#x662F;&#x7528;&#x5B88;&#x62A4;&#x8FDB;&#x7A0B;&#x5B9E;&#x73B0;&#x7684;&#xFF0C;&#x4F8B;&#x5982;web&#x670D;&#x52A1;&#x3002;&#x5B88;&#x62A4;&#x8FDB;&#x7A0B;&#x5E38;&#x5E38;&#x5728;&#x7CFB;&#x7EDF;&#x5F15;&#x5BFC;&#x88C5;&#x5165;&#x65F6;&#x542F;&#x52A8;&#xFF0C;&#x5728;&#x7CFB;&#x7EDF;&#x5173;&#x95ED;&#x65F6;&#x7EC8;&#x6B62;&#x3002;&#x5B88;&#x62A4;&#x8FDB;&#x7A0B;&#x6700;&#x5927;&#x7684;&#x7279;&#x70B9;&#x662F;&#x8FD0;&#x884C;&#x5728;&#x540E;&#x53F0;&#xFF0C;&#x4E0E;&#x7EC8;&#x7AEF;&#x65E0;&#x8FDE;&#x63A5;&#xFF0C;&#x9664;&#x975E;&#x7279;&#x6B8A;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x7528;&#x6237;&#x4E0D;&#x80FD;&#x64CD;&#x4F5C;&#x5B88;&#x62A4;&#x8FDB;&#x7A0B;&#x3002;&#x5199;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x7684;&#x8D77;&#x56E0;&#x662F;&#x4E00;&#x4E9B;&#x5E95;&#x5C42;&#x76F8;&#x5173;&#x7684;&#x5B88;&#x62A4;&#x8FDB;&#x7A0B;(deamons)&#x4E0D;&#x4F1A;link&#x5982;Foundation&#x7B49;&#x9AD8;&#x5C42;&#x6846;&#x67B6;&#x3002;</p>
<h4 id="&#x5B88;&#x62A4;&#x8FDB;&#x7A0B;&#x7684;&#x521B;&#x5EFA;&#x6B65;&#x9AA4;"><a href="#&#x5B88;&#x62A4;&#x8FDB;&#x7A0B;&#x7684;&#x521B;&#x5EFA;&#x6B65;&#x9AA4;" class="headerlink" title="&#x5B88;&#x62A4;&#x8FDB;&#x7A0B;&#x7684;&#x521B;&#x5EFA;&#x6B65;&#x9AA4;"></a>&#x5B88;&#x62A4;&#x8FDB;&#x7A0B;&#x7684;&#x521B;&#x5EFA;&#x6B65;&#x9AA4;</h4><p>&#x9996;&#x5148;&#x4F7F;&#x8FDB;&#x7A0B;&#x5728;&#x540E;&#x53F0;&#x8FD0;&#x884C;&#xFF0C;&#x521B;&#x5EFA;&#x5B50;&#x8FDB;&#x7A0B;&#x7236;&#x8FDB;&#x7A0B;&#x9000;&#x51FA;&#x3002;</p>
<pre><code>if((pid = fork())&gt;0)
exit(0);
else if(pid&lt;0)
{
perror(&quot;fail to fork&quot;);
exit(-1);
}
</code></pre><p>&#x5176;&#x6B21;&#x8131;&#x79BB;&#x63A7;&#x5236;&#x7EC8;&#x7AEF;&#xFF0C;&#x767B;&#x5F55;&#x4F1A;&#x8BDD;&#x548C;&#x8FDB;&#x7A0B;&#x7EC4;&#xFF08;&#x521B;&#x5EFA;&#x65B0;&#x4F1A;&#x8BDD;&#xFF09;&#x3002;&#x8FDB;&#x7A0B;&#x5C5E;&#x4E8E;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x7EC4;&#xFF0C;&#x8FDB;&#x7A0B;&#x7EC4;&#x53F7;&#xFF08;GID&#xFF09;&#x5C31;&#x662F;&#x8FDB;&#x7A0B;&#x7EC4;&#x957F;&#x7684;&#x8FDB;&#x7A0B;&#x53F7;&#xFF08;PID&#xFF09;&#x3002;&#x767B;&#x5F55;&#x4F1A;&#x8BDD;&#x53EF;&#x4EE5;&#x5305;&#x542B;&#x591A;&#x4E2A;&#x8FDB;&#x7A0B;&#x7EC4;&#x3002;&#x8FD9;&#x4E9B;&#x8FDB;&#x7A0B;&#x7EC4;&#x5171;&#x4EAB;&#x4E00;&#x4E2A;&#x63A7;&#x5236;&#x7EC8;&#x7AEF;&#x3002;&#x8FD9;&#x4E2A;&#x63A7;&#x5236;&#x7EC8;&#x7AEF;&#x901A;&#x5E38;&#x662F;&#x521B;&#x5EFA;&#x8FDB;&#x7A0B;&#x7684;&#x767B;&#x5F55;&#x7EC8;&#x7AEF;&#x3002; &#x63A7;&#x5236;&#x7EC8;&#x7AEF;&#xFF0C;&#x767B;&#x5F55;&#x4F1A;&#x8BDD;&#x548C;&#x8FDB;&#x7A0B;&#x7EC4;&#x901A;&#x5E38;&#x662F;&#x4ECE;&#x7236;&#x8FDB;&#x7A0B;&#x7EE7;&#x627F;&#x4E0B;&#x6765;&#x7684;&#x3002;&#x6211;&#x4EEC;&#x7684;&#x76EE;&#x7684;&#x5C31;&#x662F;&#x8981;&#x6446;&#x8131;&#x5B83;&#x4EEC;&#xFF0C;&#x4F7F;&#x4E4B;&#x4E0D;&#x53D7;&#x5B83;&#x4EEC;&#x7684;&#x5F71;&#x54CD;&#x3002;&#x65B9;&#x6CD5;&#x662F;&#x5728;&#x7B2C;1&#x70B9;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#xFF0C;&#x8C03;&#x7528;setsid()&#x4F7F;&#x8FDB;&#x7A0B;&#x6210;&#x4E3A;&#x4F1A;&#x8BDD;&#x7EC4;&#x957F;&#xFF1A;&#xFF08;&#x5F53;&#x8FDB;&#x7A0B;&#x662F;&#x4F1A;&#x8BDD;&#x7EC4;&#x957F;&#x65F6;setsid()&#x8C03;&#x7528;&#x5931;&#x8D25;&#x3002;&#x4F46;&#x7B2C;&#x4E00;&#x70B9;&#x5DF2;&#x7ECF;&#x4FDD;&#x8BC1;&#x8FDB;&#x7A0B;&#x4E0D;&#x662F;&#x4F1A;&#x8BDD;&#x7EC4;&#x957F;&#xFF09;&#x3002;setsid()&#x8C03;&#x7528;&#x6210;&#x529F;&#x540E;&#xFF0C;&#x8FDB;&#x7A0B;&#x6210;&#x4E3A;&#x65B0;&#x7684;&#x4F1A;&#x8BDD;&#x7EC4;&#x957F;&#x548C;&#x65B0;&#x7684;&#x8FDB;&#x7A0B;&#x7EC4;&#x957F;&#xFF0C;&#x5E76;&#x4E0E;&#x539F;&#x6765;&#x7684;&#x767B;&#x5F55;&#x4F1A;&#x8BDD;&#x548C;&#x8FDB;&#x7A0B;&#x7EC4;&#x8131;&#x79BB;&#x3002;&#x7531;&#x4E8E;&#x4F1A;&#x8BDD;&#x8FC7;&#x7A0B;&#x5BF9;&#x63A7;&#x5236;&#x7EC8;&#x7AEF;&#x7684;&#x72EC;&#x5360;&#x6027;&#xFF0C;&#x8FDB;&#x7A0B;&#x540C;&#x65F6;&#x4E0E;&#x63A7;&#x5236;&#x7EC8;&#x7AEF;&#x8131;&#x79BB;&#x3002;</p>
<p>&#x7981;&#x6B62;&#x8FDB;&#x7A0B;&#x91CD;&#x65B0;&#x6253;&#x5F00;&#x63A7;&#x5236;&#x7EC8;&#x7AEF;&#xFF0C;&#x7531;&#x4E8E;&#x8FDB;&#x7A0B;&#x5DF2;&#x7ECF;&#x6210;&#x4E3A;&#x65E0;&#x7EC8;&#x7AEF;&#x7684;&#x4F1A;&#x8BDD;&#x7EC4;&#x957F;&#x3002;&#x4F46;&#x5B83;&#x53EF;&#x4EE5;&#x91CD;&#x65B0;&#x7533;&#x8BF7;&#x6253;&#x5F00;&#x4E00;&#x4E2A;&#x63A7;&#x5236;&#x7EC8;&#x7AEF;&#x3002;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4F7F;&#x8FDB;&#x7A0B;&#x4E0D;&#x518D;&#x6210;&#x4E3A;&#x4F1A;&#x8BDD;&#x7EC4;&#x957F;&#x6765;&#x7981;&#x6B62;&#x8FDB;&#x7A0B;&#x91CD;&#x65B0;&#x6253;&#x5F00;&#x63A7;&#x5236;&#x7EC8;&#x7AEF;&#xFF1A; </p>
<pre><code>if(pid=fork()) 
 exit(0);//&#x7ED3;&#x675F;&#x7B2C;&#x4E00;&#x5B50;&#x8FDB;&#x7A0B;&#xFF0C;&#x7B2C;&#x4E8C;&#x5B50;&#x8FDB;&#x7A0B;&#x7EE7;&#x7EED;&#xFF08;&#x7B2C;&#x4E8C;&#x5B50;&#x8FDB;&#x7A0B;&#x4E0D;&#x518D;&#x662F;&#x4F1A;&#x8BDD;&#x7EC4;&#x957F;&#xFF09;
</code></pre><p>&#x4E0B;&#x9762;&#x5173;&#x95ED;&#x6240;&#x6709;&#x6587;&#x4EF6;&#x63CF;&#x8FF0;&#x7B26;&#x3002;&#x8FDB;&#x7A0B;&#x4ECE;&#x521B;&#x5EFA;&#x5B83;&#x7684;&#x7236;&#x8FDB;&#x7A0B;&#x90A3;&#x91CC;&#x7EE7;&#x627F;&#x4E86;&#x6253;&#x5F00;&#x7684;&#x6587;&#x4EF6;&#x63CF;&#x8FF0;&#x7B26;&#x3002;&#x5982;&#x4E0D;&#x5173;&#x95ED;&#xFF0C;&#x5C06;&#x4F1A;&#x6D6A;&#x8D39;&#x7CFB;&#x7EDF;&#x8D44;&#x6E90;&#xFF0C;&#x9020;&#x6210;&#x8FDB;&#x7A0B;&#x6240;&#x5728;&#x7684;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x65E0;&#x6CD5;&#x5378;&#x4E0B;&#x4EE5;&#x53CA;&#x5F15;&#x8D77;&#x65E0;&#x6CD5;&#x9884;&#x6599;&#x7684;&#x9519;&#x8BEF;:</p>
<pre><code>for(i=0;i&lt;=getdtablesize();i++)
close(i);
</code></pre><p>&#x4E4B;&#x540E;&#x6539;&#x53D8;&#x5F53;&#x524D;&#x5DE5;&#x4F5C;&#x76EE;&#x5F55; &#x3002;&#x8FDB;&#x7A0B;&#x6D3B;&#x52A8;&#x65F6;&#xFF0C;&#x5176;&#x5DE5;&#x4F5C;&#x76EE;&#x5F55;&#x6240;&#x5728;&#x7684;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4E0D;&#x80FD;&#x5378;&#x4E0B;&#x3002;&#x4E00;&#x822C;&#x9700;&#x8981;&#x5C06;&#x5DE5;&#x4F5C;&#x76EE;&#x5F55;&#x6539;&#x53D8;&#x5230;&#x6839;&#x76EE;&#x5F55;&#x3002;&#x5BF9;&#x4E8E;&#x9700;&#x8981;&#x8F6C;&#x50A8;&#x6838;&#x5FC3;&#xFF0C;&#x5199;&#x8FD0;&#x884C;&#x65E5;&#x5FD7;&#x7684;&#x8FDB;&#x7A0B;&#x5C06;&#x5DE5;&#x4F5C;&#x76EE;&#x5F55;&#x6539;&#x53D8;&#x5230;&#x7279;&#x5B9A;&#x76EE;&#x5F55;&#x5982;/tmp:</p>
<pre><code>chdir(&quot;/tmp&quot;) ;
</code></pre><p>&#x7136;&#x540E;&#x91CD;&#x8BBE;&#x6743;&#x9650;&#x63A9;&#x7801;&#x3002;&#x8FDB;&#x7A0B;&#x4ECE;&#x521B;&#x5EFA;&#x5B83;&#x7684;&#x7236;&#x8FDB;&#x7A0B;&#x90A3;&#x91CC;&#x7EE7;&#x627F;&#x4E86;&#x6587;&#x4EF6;&#x521B;&#x5EFA;&#x63A9;&#x7801;&#x3002;&#x5B83;&#x53EF;&#x80FD;&#x4FEE;&#x6539;&#x5B88;&#x62A4;&#x8FDB;&#x7A0B;&#x6240;&#x521B;&#x5EFA;&#x7684;&#x6587;&#x4EF6;&#x7684;&#x5B58;&#x53D6;&#x4F4D;&#x3002;&#x4E3A;&#x9632;&#x6B62;&#x8FD9;&#x4E00;&#x70B9;&#xFF0C;&#x5C06;&#x6587;&#x4EF6;&#x521B;&#x5EFA;&#x63A9;&#x6A21;&#x6E05;&#x9664;&#xFF1A;</p>
<pre><code>umask(0);
</code></pre><p>&#x5904;&#x7406;SIGCHLD&#x4FE1;&#x53F7;&#x5E76;&#x4E0D;&#x662F;&#x5FC5;&#x987B;&#x7684;&#x3002;&#x4F46;&#x5BF9;&#x4E8E;&#x67D0;&#x4E9B;&#x8FDB;&#x7A0B;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x670D;&#x52A1;&#x5668;&#x8FDB;&#x7A0B;&#x5F80;&#x5F80;&#x5728;&#x8BF7;&#x6C42;&#x5230;&#x6765;&#x65F6;&#x751F;&#x6210;&#x5B50;&#x8FDB;&#x7A0B;&#x5904;&#x7406;&#x8BF7;&#x6C42;&#x3002;&#x5982;&#x679C;&#x7236;&#x8FDB;&#x7A0B;&#x4E0D;&#x7B49;&#x5F85;&#x5B50;&#x8FDB;&#x7A0B;&#x7ED3;&#x675F;&#xFF0C;&#x5B50;&#x8FDB;&#x7A0B;&#x5C06;&#x6210;&#x4E3A;&#x50F5;&#x5C38;&#x8FDB;&#x7A0B;&#xFF08;zombie&#xFF09;&#x4ECE;&#x800C;&#x5360;&#x7528;&#x7CFB;&#x7EDF;&#x8D44;&#x6E90;&#x3002;&#x5982;&#x679C;&#x7236;&#x8FDB;&#x7A0B;&#x7B49;&#x5F85;&#x5B50;&#x8FDB;&#x7A0B;&#x7ED3;&#x675F;&#xFF0C;&#x5C06;&#x589E;&#x52A0;&#x7236;&#x8FDB;&#x7A0B;&#x7684;&#x8D1F;&#x62C5;&#xFF0C;&#x5F71;&#x54CD;&#x670D;&#x52A1;&#x5668;&#x8FDB;&#x7A0B;&#x7684;&#x5E76;&#x53D1;&#x6027;&#x80FD;&#x3002;&#x5728;Linux&#x4E0B;&#x53EF;&#x4EE5;&#x7B80;&#x5355;&#x5730;&#x5C06; SIGCHLD&#x4FE1;&#x53F7;&#x7684;&#x64CD;&#x4F5C;&#x8BBE;&#x4E3A;SIG_IGN&#x3002; </p>
<pre><code>signal(SIGCHLD,SIG_IGN); 
</code></pre><p>&#x8FD9;&#x6837;&#xFF0C;&#x5185;&#x6838;&#x5728;&#x5B50;&#x8FDB;&#x7A0B;&#x7ED3;&#x675F;&#x65F6;&#x4E0D;&#x4F1A;&#x4EA7;&#x751F;&#x50F5;&#x5C38;&#x8FDB;&#x7A0B;&#x3002;&#x8FD9;&#x4E00;&#x70B9;&#x4E0E;BSD4&#x4E0D;&#x540C;&#xFF0C;BSD4&#x4E0B;&#x5FC5;&#x987B;&#x663E;&#x5F0F;&#x7B49;&#x5F85;&#x5B50;&#x8FDB;&#x7A0B;&#x7ED3;&#x675F;&#x624D;&#x80FD;&#x91CA;&#x653E;&#x50F5;&#x5C38;&#x8FDB;&#x7A0B;&#x3002;&#x56E0;&#x4E3A;&#x5B88;&#x62A4;&#x8FDB;&#x7A0B;&#x6CA1;&#x6709;&#x63A7;&#x5236;&#x7EC8;&#x7AEF;&#xFF0C;&#x5F53;&#x8FDB;&#x7A0B;&#x51FA;&#x73B0;&#x9519;&#x8BEF;&#x65F6;&#x65E0;&#x6CD5;&#x5199;&#x5165;&#x5230;&#x6807;&#x51C6;&#x8F93;&#x51FA;&#x4E0A;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8C03;&#x7528;syslog&#x5C06;&#x51FA;&#x9519;&#x4FE1;&#x606F;&#x5199;&#x5165;&#x5230;&#x6307;&#x5B9A;&#x7684;&#x6587;&#x4EF6;&#x4E2D;&#x3002;&#x5F53;&#x7528;&#x6237;&#x9700;&#x8981;&#x5916;&#x90E8;&#x505C;&#x6B62;&#x5B88;&#x62A4;&#x8FDB;&#x7A0B;&#x8FD0;&#x884C;&#x65F6;&#xFF0C;&#x5F80;&#x5F80;&#x4F1A;&#x4F7F;&#x7528; kill&#x547D;&#x4EE4;&#x505C;&#x6B62;&#x8BE5;&#x5B88;&#x62A4;&#x8FDB;&#x7A0B;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x5B88;&#x62A4;&#x8FDB;&#x7A0B;&#x4E2D;&#x9700;&#x8981;&#x7F16;&#x7801;&#x6765;&#x5B9E;&#x73B0;kill&#x53D1;&#x51FA;&#x7684;signal&#x4FE1;&#x53F7;&#x5904;&#x7406;&#xFF0C;&#x8FBE;&#x5230;&#x8FDB;&#x7A0B;&#x7684;&#x6B63;&#x5E38;&#x9000;&#x51FA;&#x3002;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1170656-92f7dda32b2ceafc.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt=""></p>
<h4 id="&#x5173;&#x4E8E;ASL"><a href="#&#x5173;&#x4E8E;ASL" class="headerlink" title="&#x5173;&#x4E8E;ASL"></a>&#x5173;&#x4E8E;ASL</h4><p>ASL&#x662F;&#x4E2A;&#x7CFB;&#x7EDF;&#x7EA7;&#x522B;&#x7684;log&#x5DE5;&#x5177;&#xFF0C;syslog&#x7684;&#x66FF;&#x4EE3;&#x7248;&#xFF0C;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x7CFB;&#x5217;&#x5F3A;&#x5927;&#x7684;log&#x529F;&#x80FD;&#x3002;&#x4E0D;&#x8FC7;&#x4E00;&#x822C;&#x6211;&#x4EEC;&#x63A5;&#x89E6;&#x4E0D;&#x5230;&#xFF0C;NSLog&#x5C31;&#x5BF9;&#x5B83;&#x63D0;&#x4F9B;&#x4E86;&#x9AD8;&#x5C42;&#x6B21;&#x7684;&#x5C01;&#x88C5;&#x3002;&#x7531;&#x4E8E;&#x4E00;&#x4E9B;&#x5E95;&#x5C42;&#x76F8;&#x5173;&#x7684;&#x5B88;&#x62A4;&#x8FDB;&#x7A0B;(deamons)&#x4E0D;&#x4F1A;link&#x5982;Foundation&#x7B49;&#x9AD8;&#x5C42;&#x6846;&#x67B6;&#xFF0C;&#x6240;&#x4EE5;&#x4F7F;&#x7528;asl&#x6B63;&#x5408;&#x9002;&#xFF1B;&#x800C;&#x5BF9;&#x4E8E;&#x5E94;&#x7528;&#x5C42;&#x7684;&#x7528;NSLog&#x3002;NSLog&#x4F1A;&#x5411;ASL&#x5199;log&#xFF0C;&#x540C;&#x65F6;&#x5411;Terminal&#x5199;log&#xFF0C;&#x800C;&#x4E14;&#x540C;&#x65F6;&#x4F1A;&#x51FA;&#x73B0;&#x5728;Console.app&#x4E2D;&#xFF08;Mac&#x81EA;&#x5E26;&#x8F6F;&#x4EF6;&#xFF0C;&#x7528;NSLog&#x6253;&#x51FA;&#x7684;log&#x5728;&#x5176;&#x4E2D;&#x5168;&#x90E8;&#x53EF;&#x89C1;&#xFF09;&#xFF1B;&#x4E0D;&#x4EC5;&#x5982;&#x6B64;&#xFF0C;&#x6BCF;&#x4E00;&#x6B21;NSLog&#x90FD;&#x4F1A;&#x65B0;&#x5EFA;&#x4E00;&#x4E2A;ASL client&#x5E76;&#x5411;ASL&#x5B88;&#x62A4;&#x8FDB;&#x7A0B;&#x53D1;&#x8D77;&#x8FDE;&#x63A5;&#xFF0C;log&#x4E4B;&#x540E;&#x518D;&#x5173;&#x95ED;&#x8FDE;&#x63A5;&#x3002;&#x6240;&#x4EE5;&#x8BF4;&#xFF0C;&#x5F53;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x51FA;&#x73B0;N&#x6B21;&#x65F6;&#xFF0C;&#x5C06;&#x4F1A;&#x6D88;&#x8017;&#x5927;&#x91CF;&#x8D44;&#x6E90;&#x5BFC;&#x81F4;&#x7A0B;&#x5E8F;&#x53D8;&#x6162;&#x3002;</p>

            <div class="clearfix"></div>
            <hr class="nogutter">
        </div>


        <nav class="pagination" role="pagination">


<div class="ds-share flat" data-thread-key="2010/12/03/守护进程的操守/" data-title="守护进程的操守" data-images="https://avatars0.githubusercontent.com/u/10378248?v=3&s=460" data-content="守护进程的操守 是最近写的文章，希望能帮到您！" data-url="https://dangdangfeng.github.io/2010/12/03/守护进程的操守/">
    <div class="ds-share-inline">
      <ul  class="ds-share-icons-16">
        
        <li data-toggle="ds-share-icons-more"><a class="ds-more" href="javascript:void(0);">分享到：</a></li>
        <li><a class="ds-weibo" href="javascript:void(0);" data-service="weibo">微博</a></li>
        <li><a class="ds-qzone" href="javascript:void(0);" data-service="qzone">QQ空间</a></li>
        <li><a class="ds-qqt" href="javascript:void(0);" data-service="qqt">腾讯微博</a></li>
        <li><a class="ds-wechat" href="javascript:void(0);" data-service="wechat">微信</a></li>
        
      </ul>
      <div class="ds-share-icons-more">
      </div>
    </div>
 </div>

 <br/>

    
    <a class="pull-left" href="/2011/07/01/野蛮生长－－SEO/" style="float: left;">
        ← 野蛮生长－－SEO
    </a>
    
    
    <a class="pull-right" href="/2010/08/31/人生不可错过的5本书/">
        人生不可错过的5本书 →
    </a>
    

    
</nav>



        
        <div class="duoshuo">


<div class="ds-thread" data-thread-key="2010/12/03/守护进程的操守/" data-title="守护进程的操守" data-url="https://dangdangfeng.github.io/2010/12/03/守护进程的操守/"></div>



<script type="text/javascript">
var duoshuoQuery = {short_name:"deter"};
(function() {
	var ds = document.createElement('script');
	ds.type = 'text/javascript';ds.async = true;
	ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
	ds.charset = 'UTF-8';
	(document.getElementsByTagName('head')[0] 
	 || document.getElementsByTagName('body')[0]).appendChild(ds);
})();
</script>
</div>
    </div>
</section>


      
<!-- ============================ Footer =========================== -->

<footer>
    <div class="container">
            <div class="copy">
                <p>
                    &copy; 2010<script>new Date().getFullYear()>2010&&document.write("-"+new Date().getFullYear());</script>, Content By 吴白. All Rights Reserved.
                </p>
                <p>Theme By <a href="//go.kieran.top" style="color: #767D84">Kieran</a></p>
            </div>
            <div class="social">
                <ul>
                    
                    <li><a href="https://github.com/" title="Github" target="_blank"><i class="icon-github"></i></a>&nbsp;</li>
                    
                    
                    <li><a href="https://twitter.com/" title="Twitter" target="_blank"><i class="icon-twitter"></i></a>&nbsp;</li>
                    
                    
                    <li><a href="https://www.facebook.com/" title="Facebook" target="_blank"><i class="icon-facebook"></i></a>&nbsp;</li>
                    
                    
                    <li><a href="https://google.com/" title="Google-Plus" target="_blank"><i class="icon-google-plus"></i></a>&nbsp;</li>
                    
                    
                    <li><a href="http://weibo.com/" title="Sina-Weibo" target="_blank"><i class="icon-sina-weibo"></i></a>&nbsp;</li>
                    
                </ul>
            </div>
            <div class="clearfix"> </div>
        </div>
</footer>

<!-- ============================ END Footer =========================== -->
      <!-- Load our scripts -->
        
<!-- Resizable 'on-demand' full-height hero -->
<script type="text/javascript">
    
    var resizeHero = function () {
        var hero = $(".cover,.heightblock"),
            window1 = $(window);
        hero.css({
            "height": window1.height()
        });
    };
    
    resizeHero();
    
    $(window).resize(function () {
        resizeHero();
    });
</script>
<script src="/js/plugins.min.js"></script><!-- Bootstrap core and concatenated plugins always load here -->
<script src="/js/jquery.flexslider-min.js"></script><!-- Flexslider plugin -->
<script src="/js/scripts.js"></script><!-- Theme scripts -->

<!-- Initiate flexslider plugin -->
<script type="text/javascript">
    $(document).ready(function($) {
      $('.flexslider').flexslider({
        animation: "fade",
        prevText: "",
        nextText: "",
        directionNav: true
      });
    });
</script>

</body>
</html>
