<!DOCTYPE html>
<!--[if lte IE 8 ]>
<html class="ie" xmlns="http://www.w3.org/1999/xhtml" xml:lang="en-US" lang="en-US">
<![endif]-->
<!--[if (gte IE 9)|!(IE)]><!-->
<!--
***************  *      *     *
      8          *    *       *
      8          *  *         *
      8          **           *
      8          *  *         *
      8          *    *       *
      8          *      *     *
      8          *        *   ***********    -----Theme By Kieran(http://go.kieran.top)
-->
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en-US" lang="en-US">
<!--<![endif]-->

<head>
  <title>流城</title>
  <!-- Meta data -->
    <meta http-equiv="Content-Type" content="text/html" charset="UTF-8" >
    <meta http-equiv="X-UA-Compatible" content="IE=edge"/>
    <meta name="viewport" content="width=device-width, initial-scale=1.0" />
    <meta name="generator" content="流城">
    <meta name="author" content="吴白">
    <meta name="description" content="" />
    <meta name="keywords" content="" />

    <!-- Favicon, (keep icon in root folder) -->
    <link rel="Shortcut Icon" href="/img/favicon.ico" type="image/ico">

    <link rel="alternate" href="/atom.xml" title="流城" type="application/atom+xml">
    <link rel="stylesheet" href="/css/all.css" media="screen" type="text/css">
	
    <link rel="stylesheet" href="/highlightjs/vs.css" type="text/css">
    
    

    <!-- Custom stylesheet, (add custom styles here, always load last) -->
    <!-- Load our stylesheet for IE8 -->
    <!--[if IE 8]>
    <link rel="stylesheet" type="text/css" href="/css/ie8.css" />
    <![endif]-->

    <!-- Google Webfonts (Monserrat 400/700, Open Sans 400/600) -->
    <!--<link href='//fonts.useso.com/css?family=Montserrat:400,700' rel='stylesheet' type='text/css'>-->
    <!--<link href='//fonts.useso.com/css?family=Open+Sans:400,600' rel='stylesheet' type='text/css'>-->

    <!-- Load our fonts individually if IE8+, to avoid faux bold & italic rendering -->
    <!--[if IE]>
    <!--<link href='http://fonts.useso.com/css?family=Montserrat:400' rel='stylesheet' type='text/css'> -->
    <!--<link href='http://fonts.useso.com/css?family=Montserrat:700' rel='stylesheet' type='text/css'> -->
    <!--<link href='http://fonts.useso.com/css?family=Open+Sans:400' rel='stylesheet' type='text/css'>-->
    <!--<link href='http://fonts.useso.com/css?family=Open+Sans:600' rel='stylesheet' type='text/css'>-->
    <![endif]-->

    <!-- jQuery | Load our jQuery, with an alternative source fallback to a local version if request is unavailable -->
    <script src="/js/jquery-1.11.1.min.js"></script>
    <script>window.jQuery || document.write('<script src="js/jquery-1.11.1.min.js"><\/script>')</script>

    <!-- Load these in the <head> for quicker IE8+ load times -->
    <!-- HTML5 shim and Respond.js IE8 support of HTML5 elements and media queries -->
    <!--[if lt IE 9]>
    <script src="/js/html5shiv.min.js"></script>
    <script src="/js/respond.min.js"></script>
    <![endif]-->










  
  
  <link rel="alternate" type="application/atom+xml" title="Atom 0.3" href="atom.xml">
  
  

  
  <style>.col-md-8.col-md-offset-2.opening-statement img{display:none;}</style>
</head>

<!--
<body class="post-template">
-->
<body id="index" class="lightnav animsition">

      <!-- ============================ Off-canvas navigation =========================== -->

    <div class="sb-slidebar sb-right sb-style-overlay sb-momentum-scrolling">
        <div class="sb-close" aria-label="Close Menu" aria-hidden="true">
            <img src="/img/close.png" alt="Close"/>
        </div>
        <!-- Lists in Slidebars -->
        <ul class="sb-menu">
            <li><a href="/" class="animsition-link" title="Home">Home</a></li>
            <li><a href="/archives" class="animsition-link" title="archive">archives</a></li>
            <!-- Dropdown Menu -->
			 
            <li>
                <a class="sb-toggle-submenu">Works<span class="sb-caret"></span></a>
                <ul class="sb-submenu">
                    
                        <li><a href="http://www.gome.com.cn" target="_BLANK" class="animsition-link">Gome</a></li>
                    
                        <li><a href="http://www.yintai.com" target="_BLANK" class="animsition-link">YinTai</a></li>
                    
                </ul>
            </li>
            
            
            
            <li>
                <a class="sb-toggle-submenu">Links<span class="sb-caret"></span></a>
                <ul class="sb-submenu">
                    
                    <li><a href="http://www.jianshu.com/users/211925b3ca7c/latest_articles" class="animsition-link">吴白</a></li>
                    
                    <li><a href="http://www.jianshu.com/users/19f4bf67c705/latest_articles" class="animsition-link">吴禅</a></li>
                    
                </ul>
            </li>
            
        </ul>
        <!-- Lists in Slidebars -->
        <ul class="sb-menu secondary">
            <li><a href="/about" class="animsition-link" title="about">About</a></li>
            <li><a href="/atom.xml" class="animsition-link" title="rss">RSS</a></li>
        </ul>
    </div>
    
    <!-- ============================ END Off-canvas navigation =========================== -->

    <!-- ============================ #sb-site Main Page Wrapper =========================== -->

    <div id="sb-site">
        <!-- #sb-site - All page content should be contained within this id, except the off-canvas navigation itself -->

        <!-- ============================ Header & Logo bar =========================== -->

        <div id="navigation" class="navbar navbar-fixed-top">
            <div class="navbar-inner">
                <div class="container">
                    <!-- Nav logo -->
                    <div class="logo">
                        <a href="/" title="Logo" class="animsition-link">
                         <img src="/img/logo.png" alt="Logo" width="35px;"/> 
                        </a>
                    </div>
                    <!-- // Nav logo -->
                    <!-- Info-bar -->
                    <nav>
                        <ul class="nav">
                            <li><a href="/" class="animsition-link">流城</a></li>
                            <li class="nolink"><span>Always </span>Creative.</li>
                            
                            <li><a href="https://github.com/" title="Github" target="_blank"><i class="icon-github"></i></a></li>
                            
                            
                            <li><a href="https://twitter.com/" title="Twitter" target="_blank"><i class="icon-twitter"></i></a></li>
                            
                            
                            <li><a href="https://www.facebook.com/" title="Facebook" target="_blank"><i class="icon-facebook"></i></a></li>
                            
                            
                            <li><a href="https://google.com/" title="Google-Plus" target="_blank"><i class="icon-google-plus"></i></a></li>
                            
                            
                            <li><a href="http://weibo.com/" title="Sina-Weibo" target="_blank"><i class="icon-sina-weibo"></i></a></li>
                            
                            <li class="nolink"><span>Welcome!</span></li>
                        </ul>
                    </nav>
                    <!--// Info-bar -->
                </div>
                <!-- // .container -->
                <div class="learnmore sb-toggle-right">More</div>
                <button type="button" class="navbar-toggle menu-icon sb-toggle-right" title="More">
                <span class="sr-only">Toggle navigation</span>
                <span class="icon-bar before"></span>
                <span class="icon-bar main"></span>
                <span class="icon-bar after"></span>
                </button>
            </div>
            <!-- // .navbar-inner -->
        </div>

        <!-- ============================ Header & Logo bar =========================== -->


      
<section id="intro">
    <div class="container">
        <div class="row col-md-offset-2">
            <div class="col-md-8">
    			<span class="post-meta">
      <time datetime="2017-02-21T16:21:08.000Z" itemprop="datePublished">
          2017-02-22
      </time>
    
</span>
                <h1></h1>
            </div>
        </div>
        <!--<div class="col-md-8 col-md-offset-2">-->
        <div class="col-md-offset-2">
      		<h4 id="&#x4F55;&#x4E3A;APFS"><a href="#&#x4F55;&#x4E3A;APFS" class="headerlink" title="&#x4F55;&#x4E3A;APFS"></a>&#x4F55;&#x4E3A;APFS</h4><p>&#x5728;iOS 10.3&#x4E2D;&#xFF0C;&#x82F9;&#x679C;&#x65B0;&#x589E;&#x4E86;APFS&#x65B0;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#xFF0C;&#x6700;&#x65E9;&#x5728;2016&#x5E74;WWDC&#x5927;&#x4F1A;&#x4E0A;&#x516C;&#x5E03;&#x3002;APFS&#x662F;Apple File System&#x7684;&#x7B80;&#x79F0;&#xFF0C;&#x7528;&#x4E8E;&#x66FF;&#x4EE3;&#x76EE;&#x524D;&#x6240;&#x4F7F;&#x7528;&#x7684;HFS+&#x683C;&#x5F0F;&#x3002;APFS&#x5BF9;HFS&#x7684;&#x6240;&#x6709;&#x53D8;&#x4F53;&#x8FDB;&#x884C;&#x4E86;&#x7EDF;&#x4E00;&#xFF0C;&#x8FD9;&#x662F;Apple&#x4ECE;&#x5E95;&#x5C42;&#x4EE3;&#x7801;&#x5F00;&#x59CB;&#x4ECE;&#x96F6;&#x6253;&#x9020;&#x7684;&#x5168;&#x65B0;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x3002;&#x4E0E;&#x4F7F;&#x7528;32&#x4F4D;&#x6587;&#x4EF6;ID&#x7684;HFS+&#x4E0D;&#x540C;&#xFF0C;APFS&#x53EF;&#x652F;&#x6301;64&#x4F4D;&#x7D22;&#x5F15;&#x8282;&#x70B9;&#xFF08;Inode&#xFF09;&#x7F16;&#x53F7;&#xFF0C;&#x501F;&#x6B64;&#x4E00;&#x4E2A;&#x5377;&#x6700;&#x591A;&#x53EF;&#x5B58;&#x50A8;&#x8D85;&#x8FC7;900&#x4EBF;&#x4EBF;&#x4E2A;&#x6587;&#x4EF6;&#x3002;HFS+&#x53EA;&#x80FD;&#x540C;&#x65F6;&#x5BF9;&#x6574;&#x4E2A;&#x5B58;&#x50A8;&#x8BBE;&#x5907;&#x7684;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x8FDB;&#x884C;&#x521D;&#x59CB;&#x5316;&#xFF0C;APFS&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x79CD;&#x53EF;&#x6269;&#x5C55;&#x5B58;&#x50A8;&#x5757;&#x5206;&#x914D;&#x7A0B;&#x5E8F;&#xFF08;Extensible block allocator&#xFF09;&#xFF0C;&#x53EF;&#x5BF9;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x8FDB;&#x884C;&#x5EF6;&#x8FDF;&#x521D;&#x59CB;&#x5316;&#xFF08;Lazy initialization&#xFF09;&#xFF0C;&#x8FDB;&#x800C;&#x5927;&#x5E45;&#x6539;&#x5584;&#x5927;&#x5BB9;&#x91CF;&#x5377;&#x7684;&#x6027;&#x80FD;&#x3002;</p>
<p>APFS&#x9488;&#x5BF9;&#x95EA;&#x5B58;/SSD&#x5B58;&#x50A8;&#x8FDB;&#x884C;&#x4F18;&#x5316;&#xFF08;&#x4F46;&#x4F9D;&#x7136;&#x53EF;&#x7528;&#x4E8E;&#x4F20;&#x7EDF;&#x673A;&#x68B0;&#x786C;&#x76D8;&#xFF09;&#xFF0C;&#x63D0;&#x4F9B;&#x4E86;&#x66F4;&#x5F3A;&#x5927;&#x7684;&#x52A0;&#x5BC6;&#x3001;&#x5199;&#x5165;&#x65F6;&#x590D;&#x5236;&#xFF08;Copy-on-write&#xFF09;&#x5143;&#x6570;&#x636E;&#x3001;&#x7A7A;&#x95F4;&#x5206;&#x4EAB;&#x3001;&#x6587;&#x4EF6;&#x548C;&#x76EE;&#x5F55;&#x514B;&#x9686;&#x3001;&#x5FEB;&#x7167;&#x3001;&#x76EE;&#x5F55;&#x5927;&#x5C0F;&#x5FEB;&#x901F;&#x8C03;&#x6574;&#x3001;&#x539F;&#x5B50;&#x7EA7;&#x5B89;&#x5168;&#x5B58;&#x50A8;&#x57FA;&#x5143;&#xFF08;Atomic safe-save primitives&#xFF09;&#xFF0C;&#x4EE5;&#x53CA;&#x6539;&#x8FDB;&#x7684;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x5E95;&#x5C42;&#x6280;&#x672F;&#x3002;&#x6B64;&#x5916;APFS&#x8FD8;&#x5305;&#x542B;&#x5176;&#x4ED6;&#x6539;&#x5584;&#x548C;&#x65B0;&#x529F;&#x80FD;&#xFF0C;&#x4F8B;&#x5982;&#x7A00;&#x758F;&#x6587;&#x4EF6;&#x3001;&#x6539;&#x8FDB;&#x7684;TRIM&#x64CD;&#x4F5C;&#xFF0C;&#x5185;&#x5EFA;&#x5BF9;&#x6269;&#x5C55;&#x5C5E;&#x6027;&#x7684;&#x652F;&#x6301;&#x7B49;&#x3002;</p>
<p>&#x5B89;&#x5168;&#x4E0E;&#x9690;&#x79C1;&#x662F;APFS&#x7684;&#x8BBE;&#x8BA1;&#x57FA;&#x7840;&#x3002;Apple&#x7684;&#x5F88;&#x591A;&#x8BBE;&#x5907;&#x548C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x65E9;&#x5DF2;&#x5177;&#x5907;&#x52A0;&#x5BC6;&#x529F;&#x80FD;&#xFF0C;OS X 10.7 Lion&#x5F00;&#x59CB;&#x63D0;&#x4F9B;&#x5168;&#x78C1;&#x76D8;&#x52A0;&#x5BC6;&#x529F;&#x80FD;&#xFF1B;iOS 4&#x5F00;&#x59CB;&#x53EF;&#x901A;&#x8FC7;&#x4E13;&#x7528;&#x6570;&#x636E;&#x4FDD;&#x62A4;&#x6280;&#x672F;&#x5C06;&#x6BCF;&#x4E2A;&#x6587;&#x4EF6;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x4E13;&#x7528;&#x5BC6;&#x94A5;&#x8FDB;&#x884C;&#x52A0;&#x5BC6;&#x3002;APFS&#x5BF9;&#x8FD9;&#x4E24;&#x79CD;&#x529F;&#x80FD;&#x8FDB;&#x884C;&#x6574;&#x5408;&#xFF0C;&#x4E3A;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x5143;&#x6570;&#x636E;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x79CD;&#x7EDF;&#x4E00;&#x7684;&#x52A0;&#x5BC6;&#x6A21;&#x5F0F;&#x3002;APFS&#x652F;&#x6301;&#x4E09;&#x79CD;&#x6A21;&#x5F0F;&#x7684;&#x52A0;&#x5BC6;&#xFF1A;&#x4E0D;&#x52A0;&#x5BC6;&#xFF1B;&#x9002;&#x7528;&#x4E8E;&#x5143;&#x6570;&#x636E;&#x548C;&#x7528;&#x6237;&#x6570;&#x636E;&#x7684;&#x5355;&#x5BC6;&#x94A5;&#x52A0;&#x5BC6;&#xFF1B;&#x4EE5;&#x53CA;&#x9002;&#x7528;&#x4E8E;&#x5143;&#x6570;&#x636E;&#x3001;&#x6587;&#x4EF6;&#xFF0C;&#x751A;&#x81F3;&#x6587;&#x4EF6;&#x4E2D;&#x7279;&#x5B9A;&#x90E8;&#x5206;&#x7684;&#x591A;&#x5BC6;&#x94A5;&#x52A0;&#x5BC6;&#x3002;&#x591A;&#x5BC6;&#x94A5;&#x52A0;&#x5BC6;&#x529F;&#x80FD;&#xFF0C;&#x5185;&#x7F6E;&#x6709;&#x9488;&#x5BF9;&#x6BCF;&#x4E2A;&#x6587;&#x4EF6;&#x7684;&#x5BC6;&#x94A5;&#xFF0C;&#x5176;&#x9488;&#x5BF9;&#x654F;&#x611F;&#x5143;&#x6570;&#x636E;&#x4E5F;&#x90FD;&#x6709;&#x72EC;&#x7ACB;&#x7684;&#x5BC6;&#x94A5;&#xFF0C;&#x5728;&#x786E;&#x4FDD;&#x53EF;&#x9760;&#x6027;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#x4F18;&#x5316;&#x6027;&#x80FD;&#x3002;&#x591A;&#x5BC6;&#x94A5;&#x52A0;&#x5BC6;&#x53EF;&#x786E;&#x4FDD;&#x54EA;&#x6015;&#x8BBE;&#x5907;&#x7269;&#x7406;&#x5B89;&#x5168;&#x53D7;&#x5230;&#x5A01;&#x80C1;&#xFF0C;&#x4F9D;&#x7136;&#x53EF;&#x4EE5;&#x4FDD;&#x969C;&#x7528;&#x6237;&#x6570;&#x636E;&#x7684;&#x5B8C;&#x6574;&#x6027;&#x3002;&#x53D6;&#x51B3;&#x4E8E;&#x5177;&#x4F53;&#x786C;&#x4EF6;&#xFF0C;APFS&#x52A0;&#x5BC6;&#x53EF;&#x4F7F;&#x7528;AES-XTS&#x6216;AES-CBC&#x7B97;&#x6CD5;&#x3002;</p>
<p>&#x8FD9;&#x79CD;&#x52A0;&#x5BC6;&#x673A;&#x5236;&#x8FD8;&#x5B9E;&#x73B0;&#x4E86;&#x4E00;&#x4E2A;&#x989D;&#x5916;&#x7684;&#x529F;&#x80FD;&#xFF1A;&#x66F4;&#x4E3A;&#x5FEB;&#x901F;&#x7684;&#x6570;&#x636E;&#x64E6;&#x9664;&#x3002;&#x901A;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#x5F53;&#x7528;&#x6237;&#x4ECE;&#x8BBE;&#x5907;&#x4E2D;&#x5220;&#x9664;&#x6587;&#x4EF6;&#x540E;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5E02;&#x9762;&#x4E0A;&#x63D0;&#x4F9B;&#x7684;&#x5F88;&#x591A;&#xFF08;&#x514D;&#x8D39;&#x6216;&#x6536;&#x8D39;&#x7684;&#xFF09;&#x53CD;&#x5220;&#x9664;&#x8F6F;&#x4EF6;&#x627E;&#x56DE;&#x5220;&#x6389;&#x7684;&#x5185;&#x5BB9;&#x3002;&#x4E3A;&#x907F;&#x514D;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x4EE5;&#x5F80;&#x5982;&#x679C;&#x9700;&#x8981;&#x5220;&#x9664;&#x5305;&#x542B;&#x673A;&#x5BC6;&#x4FE1;&#x606F;&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x6216;&#x9700;&#x8981;&#x5C06;&#x5B58;&#x50A8;&#x8FC7;&#x79C1;&#x5BC6;&#x6570;&#x636E;&#x7684;&#x8BBE;&#x5907;&#x9000;&#x5F79;&#x7ED9;&#x4ED6;&#x4EBA;&#x4F7F;&#x7528;&#xFF0C;&#x5FC5;&#x987B;&#x9996;&#x5148;&#x4F7F;&#x7528;&#x62B9;&#x6389;&#x529F;&#x80FD;&#x64E6;&#x9664;&#x5B58;&#x50A8;&#x8BBE;&#x5907;&#xFF0C;&#x5E76;&#x53EF;&#x80FD;&#x8981;&#x5C06;&#x8FD9;&#x4E00;&#x8FC7;&#x7A0B;&#x6267;&#x884C;&#x591A;&#x904D;&#x3002;&#x53D6;&#x51B3;&#x4E8E;&#x5B58;&#x50A8;&#x8BBE;&#x5907;&#x5BB9;&#x91CF;&#xFF0C;&#x6574;&#x4E2A;&#x8FC7;&#x7A0B;&#x5C06;&#x8017;&#x8D39;&#x6781;&#x591A;&#x65F6;&#x95F4;&#x3002;&#x5BF9;&#x4E8E;&#x4F7F;&#x7528;APFS&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x7684;&#x5B58;&#x50A8;&#x8BBE;&#x5907;&#xFF0C;&#x5728;&#x542F;&#x7528;&#x52A0;&#x5BC6;&#x529F;&#x80FD;&#x540E;&#xFF0C;&#x5B89;&#x5168;&#x64E6;&#x9664;&#x7684;&#x8FC7;&#x7A0B;&#x5C06;&#x53D8;&#x5F97;&#x5927;&#x4E3A;&#x7B80;&#x4FBF;&#x548C;&#x5FEB;&#x6377;&#xFF0C;&#x4E0D;&#x518D;&#x9700;&#x8981;&#x8017;&#x8D39;&#x5927;&#x91CF;&#x65F6;&#x95F4;&#x591A;&#x6B21;&#x7ED9;&#x5B58;&#x50A8;&#x8BBE;&#x5907;&#x586B;&#x5145;&#x968F;&#x673A;&#x6570;&#x636E;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x5220;&#x9664;&#x52A0;&#x5BC6;&#x6240;&#x7528;&#x7684;&#x5BC6;&#x94A5;&#x5373;&#x53EF;&#x3002;</p>
<p>APFS&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x540D;&#x4E3A;&#x201C;&#x7A7A;&#x95F4;&#x5171;&#x4EAB;&#x201D;&#x7684;&#x65B0;&#x529F;&#x80FD;&#xFF0C;&#x501F;&#x52A9;&#x8BE5;&#x529F;&#x80FD;&#xFF0C;&#x591A;&#x4E2A;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x53EF;&#x4EE5;&#x5171;&#x4EAB;&#x540C;&#x4E00;&#x4E2A;&#x7269;&#x7406;&#x5377;&#x4E0A;&#x7684;&#x540C;&#x4E00;&#x5757;&#x5E95;&#x5C42;&#x53EF;&#x7528;&#x7A7A;&#x95F4;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x8BBE;&#x5907;&#x4E0A;&#x7684;&#x4E00;&#x4E2A;APFS&#x201C;&#x5BB9;&#x5668;&#x201D;&#x5185;&#x90E8;&#x53EF;&#x4EE5;&#x5305;&#x542B;&#x591A;&#x4E2A;&#x201C;&#x5377;&#x201D;&#xFF08;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#xFF09;&#x3002;HFS+&#x9700;&#x8981;&#x4E3A;&#x6BCF;&#x4E2A;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x9884;&#x5148;&#x5206;&#x914D;&#x56FA;&#x5B9A;&#x5927;&#x5C0F;&#x7684;&#x5BB9;&#x91CF;&#xFF0C;&#x8FD9;&#x79CD;&#x505A;&#x6CD5;&#x8F83;&#x4E3A;&#x201C;&#x50F5;&#x786C;&#x201D;&#xFF0C;&#x800C;APFS&#x7684;&#x7A7A;&#x95F4;&#x5171;&#x4EAB;&#x529F;&#x80FD;&#x53EF;&#x4EE5;&#x8BA9;&#x7528;&#x6237;&#x5728;&#x65E0;&#x9700;&#x91CD;&#x5206;&#x533A;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x52A8;&#x6001;&#x3001;&#x7075;&#x6D3B;&#x5730;&#x6269;&#x5927;&#x6216;&#x7F29;&#x5C0F;&#x5377;&#x5BB9;&#x91CF;&#x3002;&#x5728;&#x8FD9;&#x6837;&#x7684;&#x8BBE;&#x8BA1;&#x4E0B;&#xFF0C;APFS&#x5BB9;&#x5668;&#x5185;&#x7684;&#x6BCF;&#x4E2A;&#x5377;&#x90FD;&#x4F1A;&#x663E;&#x793A;&#x540C;&#x7B49;&#x7684;&#x53EF;&#x7528;&#x7A7A;&#x95F4;&#x5BB9;&#x91CF;&#xFF0C;&#x800C;&#x6240;&#x663E;&#x793A;&#x5BB9;&#x91CF;&#x4F1A;&#x7B49;&#x540C;&#x4E8E;&#x8BE5;&#x5BB9;&#x5668;&#x7684;&#x53EF;&#x7528;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x603B;&#x91CF;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5047;&#x8BBE;&#x6709;&#x4E2A;&#x5BB9;&#x91CF;100GB&#x7684;APFS&#x5BB9;&#x5668;&#xFF0C;&#x5176;&#x4E2D;&#x5305;&#x542B;&#x5DF2;&#x7528;10GB&#x5BB9;&#x91CF;&#x7684;&#x5377;A&#x548C;&#x5DF2;&#x7528;20GB&#x5BB9;&#x91CF;&#x7684;&#x5377;B&#xFF0C;&#x5377;A&#x548C;&#x5377;B&#x90FD;&#x4F1A;&#x663E;&#x793A;&#x81EA;&#x5DF1;&#x6709;70GB&#xFF08;100GB-10GB-20GB&#xFF09;&#x7684;&#x53EF;&#x7528;&#x5BB9;&#x91CF;&#x3002;</p>
<p>&#x73B0;&#x4EE3;&#x5316;&#x7684;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x5F80;&#x5F80;&#x4F1A;&#x901A;&#x8FC7;&#x538B;&#x7F29;&#x548C;&#x53BB;&#x91CD;&#xFF08;Deduplication&#xFF09;&#x7B49;&#x65B9;&#x5F0F;&#x51CF;&#x5C0F;&#x6587;&#x4EF6;&#x5360;&#x7528;&#x7684;&#x7A7A;&#x95F4;&#x91CF;&#x3002;&#x538B;&#x7F29;&#x5F88;&#x597D;&#x7406;&#x89E3;&#xFF0C;&#x53BB;&#x91CD;&#x662F;&#x6307;&#x627E;&#x51FA;&#x5927;&#x91CF;&#x6587;&#x4EF6;&#x4E2D;&#x76F8;&#x540C;&#x7684;&#x6570;&#x636E;&#x5757;&#xFF0C;&#x5E76;&#x53EA;&#x5C06;&#x8FD9;&#x6837;&#x7684;&#x5757;&#x5B58;&#x50A8;&#x4E00;&#x6B21;&#xFF0C;&#x5728;&#x8BBF;&#x95EE;&#x6587;&#x4EF6;&#x65F6;&#xFF0C;&#x4F1A;&#x6839;&#x636E;&#x5B9E;&#x9645;&#x60C5;&#x51B5;&#x52A8;&#x6001;&#x201C;&#x62FC;&#x88C5;&#x201D;&#x51FA;&#x6700;&#x7EC8;&#x7684;&#x6587;&#x4EF6;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x529F;&#x80FD;&#x6700;&#x9002;&#x5408;&#x4FDD;&#x5B58;&#x5927;&#x91CF;&#x7528;&#x6237;&#x6587;&#x4EF6;&#x6216;&#x5927;&#x91CF;&#x865A;&#x62DF;&#x673A;&#x6620;&#x50CF;&#x7684;&#x670D;&#x52A1;&#x5668;&#x73AF;&#x5883;&#x3002;APFS&#x53EF;&#x4EE5;&#x7528;&#x6052;&#x5B9A;&#x7684;&#x901F;&#x5EA6;&#x5BF9;&#x591A;&#x4E2A;&#x6587;&#x4EF6;&#x548C;&#x76EE;&#x5F55;&#x521B;&#x5EFA;&#x526F;&#x672C;&#x3002;&#x4E3E;&#x4F8B;&#x6765;&#x8BF4;&#xFF0C;&#x5982;&#x679C;&#x8981;&#x5728;&#x540C;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#xFF08;&#x6216;&#x540C;&#x4E00;&#x4E2A;&#x5BB9;&#x5668;&#xFF09;&#x5185;&#x90E8;&#x590D;&#x5236;&#x6587;&#x4EF6;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x5E76;&#x4E0D;&#x9700;&#x8981;&#x4E3A;&#x6570;&#x636E;&#x521B;&#x5EFA;&#x526F;&#x672C;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x5BF9;&#x6587;&#x4EF6;&#x7684;&#x5143;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x9002;&#x5F53;&#x7684;&#x66F4;&#x65B0;&#x5C31;&#x53EF;&#x4EE5;&#x8BA9;&#x78C1;&#x76D8;&#x4E0A;&#x5B58;&#x50A8;&#x7684;&#x6570;&#x636E;&#x5B9E;&#x73B0;&#x201C;&#x5171;&#x4EAB;&#x201D;&#xFF0C;&#x6B64;&#x65F6;&#x76F8;&#x540C;&#x7684;&#x6587;&#x4EF6;&#x201C;&#x5B9E;&#x9645;&#x4F53;&#x79EF;&#x201D;&#x4E0D;&#x53D8;&#xFF0C;&#x4F46;&#x4EA7;&#x751F;&#x4E86;&#x4E24;&#x4E2A;&#x526F;&#x672C;&#xFF0C;&#x5BF9;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x526F;&#x672C;&#x8FDB;&#x884C;&#x6539;&#x52A8;&#x5219;&#x9700;&#x8981;&#x4E3A;&#x5176;&#x5206;&#x914D;&#x65B0;&#x7684;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#xFF08;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x4E5F;&#x53EB;&#x505A;&#x201C;&#x5199;&#x5165;&#x65F6;&#x590D;&#x5236;&#x201D;&#xFF09;&#x3002;APFS&#x4E2D;&#x590D;&#x5236;&#x7684;&#x6587;&#x4EF6;&#x5B9E;&#x9645;&#x4E0A;&#x53EA;&#x662F;&#x5BF9;&#x6587;&#x4EF6;&#x521B;&#x5EFA;&#x4E86;&#x8F7B;&#x91CF;&#x7EA7;&#x514B;&#x9686;&#xFF0C;&#x5B9E;&#x9645;&#x6570;&#x636E;&#x5E76;&#x6CA1;&#x6709;&#x91CD;&#x590D;&#x4FDD;&#x5B58;&#xFF0C;&#x5E95;&#x5C42;&#x8BBE;&#x5907;&#x7684;&#x6545;&#x969C;&#x4F1A;&#x5BFC;&#x81F4;&#x6240;&#x6709;&#x201C;&#x526F;&#x672C;&#x201D;&#x53D7;&#x635F;&#x3002;</p>
<p>APFS&#x4E13;&#x95E8;&#x9488;&#x5BF9;&#x95EA;&#x5B58;&#x8FDB;&#x884C;&#x4E86;&#x4F18;&#x5316;&#x3002;SSD&#x867D;&#x7136;&#x53EF;&#x4EE5;&#x6A21;&#x62DF;&#x4F20;&#x7EDF;&#x673A;&#x68B0;&#x786C;&#x76D8;&#x7684;&#x201C;&#x5757;&#x201D;&#xFF0C;&#x4F46;&#x5E95;&#x5C42;&#x6280;&#x672F;&#x4E0E;&#x673A;&#x68B0;&#x786C;&#x76D8;&#x622A;&#x7136;&#x4E0D;&#x540C;&#x3002;SSD&#x5E95;&#x5C42;&#x7684;&#x7BA1;&#x7406;&#x5DE5;&#x4F5C;&#x662F;&#x7531;&#x4E00;&#x79CD;&#x540D;&#x4E3A;&#x95EA;&#x5B58;&#x8F6C;&#x6362;&#x5C42;&#xFF08;FTL&#xFF0C;Flash Translation Layer&#xFF09;&#x7684;&#x8F6F;&#x4EF6;&#x8D1F;&#x8D23;&#x5904;&#x7406;&#x7684;&#x3002;FTL&#x4E0E;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x6781;&#x4E3A;&#x7C7B;&#x4F3C;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x5757;&#x5730;&#x5740;&#x548C;&#x4ECB;&#x8D28;&#x5185;&#x90E8;&#x7684;&#x4F4D;&#x7F6E;&#x4E4B;&#x95F4;&#x521B;&#x5EFA;&#x865A;&#x62DF;&#x6620;&#x5C04;&#xFF08;&#x8F6C;&#x6362;&#xFF09;&#x3002;&#x6574;&#x4E2A;&#x5806;&#x6808;&#xFF0C;&#x5305;&#x62EC;SSD&#x3001;FTL&#xFF0C;&#x4EE5;&#x53CA;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x90FD;&#x7531;Apple&#x63A7;&#x5236;&#xFF0C;&#x53EF;&#x4EE5;&#x66F4;&#x6709;&#x9488;&#x5BF9;&#x6027;&#x5730;&#x5BF9;&#x4E0D;&#x540C;&#x7EC4;&#x4EF6;&#x8FDB;&#x884C;&#x4F18;&#x5316;&#x3002;</p>
<p>&#x6B64;&#x5916;APFS&#x8FD8;&#x63D0;&#x4F9B;&#x4E86;&#x5BF9;TRIM&#x7684;&#x652F;&#x6301;&#x3002;TRIM&#x662F;ATA&#x534F;&#x8BAE;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x547D;&#x4EE4;&#xFF0C;&#x53EF;&#x4EE5;&#x8BA9;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x544A;&#x8BC9;SSD&#xFF08;&#x5176;&#x5B9E;&#x662F;&#x6307;&#x793A;SSD&#x4E2D;&#x7684;FTL&#xFF09;&#x67D0;&#x4E9B;&#x7A7A;&#x95F4;&#x662F;&#x7A7A;&#x95F2;&#x7684;&#x3002;&#x53EF;&#x7528;&#x7A7A;&#x95F4;&#x8D8A;&#x591A;&#xFF0C;SSD&#x7684;&#x6027;&#x80FD;&#x8868;&#x73B0;&#x4F1A;&#x8D8A;&#x597D;&#xFF0C;&#x751A;&#x81F3;&#x5927;&#x90E8;&#x5206;SSD&#x6240;&#x62E5;&#x6709;&#x7684;&#x5B58;&#x50A8;&#x5BB9;&#x91CF;&#x4F1A;&#x8D85;&#x8FC7;&#x6807;&#x79F0;&#x503C;&#x3002;&#x5047;&#x8BBE;&#x6709;&#x4E00;&#x4E2A;1TB&#x5BB9;&#x91CF;&#x7684;SSD&#xFF0C;&#x663E;&#x793A;&#x7684;&#x53EF;&#x7528;&#x7A7A;&#x95F4;&#x603B;&#x91CF;&#x4E3A;931GB&#x3002;&#x5728;&#x6709;&#x66F4;&#x591A;&#x53EF;&#x7528;&#x7A7A;&#x95F4;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;FTL&#x53EF;&#x4EE5;&#x727A;&#x7272;&#x7A7A;&#x95F4;&#x5229;&#x7528;&#x7387;&#x6362;&#x56DE;&#x66F4;&#x9AD8;&#x6027;&#x80FD;&#x548C;&#x66F4;&#x957F;&#x5BFF;&#x547D;&#x3002;&#x4F46;TRIM&#x7684;&#x95EE;&#x9898;&#x5728;&#x4E8E;&#xFF0C;&#x53EA;&#x6709;&#x5728;&#x5B58;&#x5728;&#x53EF;&#x7528;&#x7A7A;&#x95F4;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x8FD9;&#x4E2A;&#x529F;&#x80FD;&#x624D;&#x4F1A;&#x6709;&#x7528;&#xFF0C;&#x5982;&#x679C;&#x78C1;&#x76D8;&#x5373;&#x5C06;&#x88C5;&#x6EE1;&#xFF0C;TRIM&#x4E0D;&#x4F1A;&#x4E3A;&#x4F60;&#x5E26;&#x6765;&#x4EFB;&#x4F55;&#x6548;&#x679C;&#x3002;</p>
<p>&#x6027;&#x80FD;&#x65B9;&#x9762;&#xFF0C;APFS&#x7684;&#x5EF6;&#x8FDF;&#x4E5F;&#x6709;&#x4E86;&#x5927;&#x5E45;&#x6539;&#x5584;&#x3002;APFS&#x53EF;&#x4EE5;&#x901A;&#x8FC7;I/O QoS&#xFF08;&#x670D;&#x52A1;&#x8D28;&#x91CF;&#xFF09;&#x5BF9;&#x4E0D;&#x540C;&#x7684;&#x8BBF;&#x95EE;&#x8BF7;&#x6C42;&#x5212;&#x5206;&#x4F18;&#x5148;&#x7EA7;&#xFF0C;&#x5C06;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x7ACB;&#x523B;&#x5BDF;&#x89C9;&#x7684;&#x64CD;&#x4F5C;&#x548C;&#x540E;&#x53F0;&#x6D3B;&#x52A8;&#x533A;&#x5206;&#x5BF9;&#x5F85;&#x3002;&#x8BA1;&#x7B97;&#x673A;&#x7CFB;&#x7EDF;&#x5728;&#x4EFB;&#x4F55;&#x65F6;&#x5019;&#x90FD;&#x53EF;&#x80FD;&#x51FA;&#x6545;&#x969C;&#xFF1A;&#x5D29;&#x6E83;&#x3001;Bug&#x3001;&#x65AD;&#x7535;&#x7B49;&#x2026;&#x2026; &#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x5FC5;&#x987B;&#x80FD;&#x591F;&#x9884;&#x89C1;&#x5230;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x5E76;&#x4ECE;&#x6545;&#x969C;&#x4E2D;&#x987A;&#x5229;&#x6062;&#x590D;&#x3002;&#x9047;&#x5230;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x4EE5;&#x524D;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x5C1D;&#x8BD5;&#x7740;&#x7528;&#x4E13;&#x95E8;&#x7684;&#x5DE5;&#x5177;&#x5728;&#x7CFB;&#x7EDF;&#x542F;&#x52A8;&#x524D;&#x68C0;&#x67E5;&#x5E76;&#x4FEE;&#x590D;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#xFF08;&#x4F8B;&#x5982;&#x4F7F;&#x7528;fsck&#xFF09;&#x3002;&#x8F83;&#x4E3A;&#x73B0;&#x4EE3;&#x5316;&#x7684;&#x7CFB;&#x7EDF;&#x4F1A;&#x4F7F;&#x7528;&#x67D0;&#x4E9B;&#x201C;&#x59CB;&#x7EC8;&#x4E00;&#x81F4;&#x201D;&#x7684;&#x683C;&#x5F0F;&#xFF0C;&#x6216;&#x5C06;&#x4E0D;&#x4E00;&#x81F4;&#x7684;&#x53EF;&#x80FD;&#x5C3D;&#x91CF;&#x964D;&#x4F4E;&#xFF0C;&#x4EE5;&#x907F;&#x514D;&#x8017;&#x8D39;&#x5927;&#x91CF;&#x65F6;&#x95F4;&#x6267;&#x884C;&#x5B8C;&#x6574;&#x7684;fsck&#x68C0;&#x67E5;&#x3002;&#x4F8B;&#x5982;ZFS&#x5C31;&#x53EF;&#x4EE5;&#x5728;&#x78C1;&#x76D8;&#x4E0A;&#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x72B6;&#x6001;&#xFF0C;&#x7136;&#x540E;&#x901A;&#x8FC7;&#x4E00;&#x6B21;&#x539F;&#x5B50;&#x64CD;&#x4F5C;&#x4ECE;&#x4E4B;&#x524D;&#x7684;&#x72B6;&#x6001;&#x4EE5;&#x539F;&#x5B50;&#x7EA7;&#x65B9;&#x5F0F;&#x8FC7;&#x5EA6;&#x5230;&#x65B0;&#x72B6;&#x6001;&#x3002;</p>
<p>&#x6821;&#x9A8C;&#x662F;&#x4E00;&#x79CD;&#x9488;&#x5BF9;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x7684;&#x6458;&#x8981;&#x4F1A;&#x6C47;&#x603B;&#xFF0C;&#x53EF;&#x7528;&#x4E8E;&#x68C0;&#x6D4B;&#xFF08;&#x548C;&#x7EA0;&#x6B63;&#xFF09;&#x6570;&#x636E;&#x9519;&#x8BEF;&#x3002;APFS&#x4F1A;&#x5BF9;&#x81EA;&#x5DF1;&#x7684;&#x5143;&#x6570;&#x636E;&#xFF0C;&#x800C;&#x975E;&#x7528;&#x6237;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x6821;&#x9A8C;&#x3002;&#x8FD9;&#x79CD;&#x5BF9;&#x5143;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x6821;&#x9A8C;&#x7684;&#x505A;&#x6CD5;&#x7406;&#x7531;&#x975E;&#x5E38;&#x5145;&#x5206;&#xFF1A;&#x5927;&#x90E8;&#x5206;&#x5143;&#x6570;&#x636E;&#x90FD;&#x4E0E;&#x7528;&#x6237;&#x6570;&#x636E;&#x65E0;&#x5173;&#xFF08;&#x56E0;&#x6B64;&#x6821;&#x9A8C;&#x4E0D;&#x4F1A;&#x8017;&#x8D39;&#x592A;&#x591A;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#xFF09;&#xFF0C;&#x800C;&#x4E22;&#x5931;&#x5143;&#x6570;&#x636E;&#x4F1A;&#x6709;&#x6781;&#x5927;&#x53EF;&#x80FD;&#x9020;&#x6210;&#x7528;&#x6237;&#x6570;&#x636E;&#x7684;&#x4E22;&#x5931;&#x3002;&#x8DDD;&#x79BB;&#x6765;&#x8BF4;&#xFF0C;&#x5047;&#x8BBE;&#x67D0;&#x4E2A;&#x9876;&#x5C42;&#x76EE;&#x5F55;&#x7684;&#x5143;&#x6570;&#x636E;&#x51FA;&#x9519;&#xFF0C;&#x90A3;&#x4E48;&#x78C1;&#x76D8;&#x4E0A;&#x7684;&#x6240;&#x6709;&#x6570;&#x636E;&#x90FD;&#x6709;&#x53EF;&#x80FD;&#x65E0;&#x6CD5;&#x8BBF;&#x95EE;&#x3002;&#x4E5F;&#x6B63;&#x662F;&#x56E0;&#x6B64;&#xFF0C;ZFS&#x4F1A;&#x5BF9;&#x5143;&#x6570;&#x636E;&#x521B;&#x5EFA;&#x526F;&#x672C;&#xFF08;&#x751A;&#x81F3;&#x5BF9;&#x9876;&#x5C42;&#x5143;&#x6570;&#x636E;&#x521B;&#x5EFA;&#x4E09;&#x91CD;&#x526F;&#x672C;&#xFF09;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x5B8C;&#x5168;&#x4E0D;&#x5BF9;&#x7528;&#x6237;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x6821;&#x9A8C;&#xFF0C;&#x8FD9;&#x79CD;&#x505A;&#x6CD5;&#x4F3C;&#x4E4E;&#x66F4;&#x6709;&#x8DA3;&#x3002;&#x5927;&#x90E8;&#x5206;&#x53EF;&#x652F;&#x6301;APFS&#x7684;Apple&#x8BBE;&#x5907;&#x4E2D;&#x7684;SSD&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x7531;&#x591A;&#x4E2A;&#x6216;&#x591A;&#x6216;&#x5C11;&#x76F8;&#x4E92;&#x72EC;&#x7ACB;&#x7684;NAND&#x82AF;&#x7247;&#x7EC4;&#x6210;&#x7684;&#x3002;Apple&#x8BBE;&#x5907;&#x7684;&#x5B58;&#x50A8;&#x5177;&#x5907;&#x5F3A;&#x5927;&#x7684;ECC&#x7EA0;&#x9519;&#x4FDD;&#x62A4;&#x3002;NAND&#x95EA;&#x5B58;SSD&#x548C;&#x78C1;&#x4ECB;&#x8D28;&#x673A;&#x68B0;&#x786C;&#x76D8;&#x90FD;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5197;&#x4F59;&#x6570;&#x636E;&#x68C0;&#x6D4B;&#x548C;&#x7EA0;&#x6B63;&#x9519;&#x8BEF;&#x3002;NAND&#x4F1A;&#x4F7F;&#x7528;&#x989D;&#x5916;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x4F8B;&#x5982;&#x6BCF;4KB&#x9875;&#x4F7F;&#x7528;&#x989D;&#x5916;&#x7684;128&#x5B57;&#x8282;&#x6570;&#x636E;&#xFF0C;&#x501F;&#x6B64;&#x68C0;&#x6D4B;&#x548C;&#x7EA0;&#x6B63;&#x6570;&#x636E;&#x9519;&#x8BEF;&#x3002;&#x8BBE;&#x5907;&#x672C;&#x8EAB;&#x7684;&#x8BEF;&#x7801;&#x7387;&#x5DF2;&#x7ECF;&#x8DB3;&#x591F;&#x4F4E;&#xFF0C;&#x53EF;&#x4EE5;&#x8BA4;&#x4E3A;&#x8BBE;&#x5907;&#x6574;&#x4E2A;&#x751F;&#x547D;&#x5468;&#x671F;&#x5185;&#x90FD;&#x4E0D;&#x4F1A;&#x51FA;&#x73B0;&#x9519;&#x8BEF;&#x3002;&#x8FD8;&#x6709;&#x4E00;&#x4E9B;&#x8BBE;&#x5907;&#x9519;&#x8BEF;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x7684;&#x5197;&#x4F59;&#x673A;&#x5236;&#x907F;&#x514D;&#x3002;SSD&#x4E2D;&#x5305;&#x542B;&#x5927;&#x91CF;&#x7EC4;&#x4EF6;&#xFF0C;&#x800C;&#x5927;&#x90E8;&#x5206;&#x6D88;&#x8D39;&#x7C7B;&#x4EA7;&#x54C1;&#x4E2D;&#x7684;SSD&#x5F88;&#x5C11;&#x5305;&#x542B;&#x7AEF;&#x5230;&#x7AEF;&#x7684;ECC&#x4FDD;&#x62A4;&#xFF0C;&#x56E0;&#x6B64;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;&#x6570;&#x636E;&#x4F20;&#x8F93;&#x8FC7;&#x7A0B;&#x4E2D;&#x51FA;&#x73B0;&#x9519;&#x8BEF;&#x3002;SSD&#x56FA;&#x4EF6;&#x4E2D;&#x4E5F;&#x53EF;&#x80FD;&#x5305;&#x542B;&#x5BFC;&#x81F4;&#x6570;&#x636E;&#x4E22;&#x5931;&#x7684;Bug&#x3002;</p>
<p>&#x8986;&#x76D6;&#x5199;&#x5165;&#x6570;&#x636E;&#x662F;&#x6700;&#x5BB9;&#x6613;&#x9020;&#x6210;&#x4E0D;&#x4E00;&#x81F4;&#x7684;&#x64CD;&#x4F5C;&#x3002;&#x5982;&#x679C;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x9700;&#x8981;&#x8986;&#x5199;&#x6587;&#x4EF6;&#x7684;&#x591A;&#x4E2A;&#x533A;&#x5757;&#xFF0C;&#x6709;&#x4E00;&#x5B9A;&#x53EF;&#x80FD;&#x9047;&#x5230;&#x4E00;&#x4E9B;&#x533A;&#x5757;&#x5DF2;&#x7ECF;&#x4EE3;&#x8868;&#x65B0;&#x72B6;&#x6001;&#xFF0C;&#x4F46;&#x4E00;&#x4E9B;&#x533A;&#x5757;&#x4F9D;&#x7136;&#x4EE3;&#x8868;&#x65E7;&#x7684;&#x72B6;&#x6001;&#x3002;&#x4E3A;&#x907F;&#x514D;&#x8FD9;&#x79CD;&#x95EE;&#x9898;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4E0A;&#x6587;&#x63D0;&#x5230;&#x7684;&#x5199;&#x5165;&#x65F6;&#x590D;&#x5236;&#x8FD9;&#x4E00;&#x65B9;&#x5F0F;&#xFF0C;&#x9996;&#x5148;&#x5206;&#x914D;&#x65B0;&#x533A;&#x5757;&#xFF0C;&#x968F;&#x540E;&#x91CA;&#x653E;&#x65E7;&#x533A;&#x5757;&#x4F7F;&#x5176;&#x53EF;&#x88AB;&#x518D;&#x6B21;&#x4F7F;&#x7528;&#xFF0C;&#x800C;&#x4E0D;&#x9700;&#x8981;&#x5C31;&#x5730;&#x4FEE;&#x6539;&#x6570;&#x636E;&#x3002;APFS&#x5B9E;&#x65BD;&#x4E86;&#x4E00;&#x79CD;&#x201C;&#x5168;&#x65B0;&#x7684;&#x5199;&#x5165;&#x65F6;&#x590D;&#x5236;&#x5143;&#x6570;&#x636E;&#x4F53;&#x7CFB;&#x201D;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x7684;&#x65B0;&#x9896;&#x4E4B;&#x5904;&#x5728;&#x4E8E;&#xFF0C;APFS&#x5E76;&#x672A;&#x4F7F;&#x7528;ZFS&#x673A;&#x5236;&#x590D;&#x5236;&#x5DF2;&#x66F4;&#x6539;&#x7528;&#x6237;&#x6570;&#x636E;&#x7684;&#x6240;&#x6709;&#x5143;&#x6570;&#x636E;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x5BF9;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x7ED3;&#x6784;&#x8FDB;&#x884C;&#x4E00;&#x6B21;&#x539F;&#x5B50;&#x66F4;&#x65B0;&#x5373;&#x53EF;&#x5B9E;&#x73B0;&#x3002;</p>
<p>APFS&#x7CFB;&#x7EDF;&#x63D0;&#x5347;&#x4E86;&#x82F9;&#x679C;&#x7684;iOS&#x3001;macOS&#x3001;watchOS&#x53CA;tvOS&#x7B49;&#x5E73;&#x53F0;&#x7684;&#x6587;&#x4EF6;&#x5B8C;&#x6574;&#x6027;&#x4E0E;&#x5B89;&#x5168;&#x6027;&#x3002;APFS&#x7CFB;&#x7EDF;&#x542F;&#x7528;&#x540E;&#xFF0C;&#x5927;&#x5927;&#x7F29;&#x51CF;&#x4E86;&#x7CFB;&#x7EDF;&#x7684;&#x4F53;&#x79EF;&#xFF0C;&#x5347;&#x7EA7;&#x5230;iOS 10.3&#x7CFB;&#x7EDF;&#x540E;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x5185;&#x7F6E;&#x7A7A;&#x95F4;&#x591A;&#x51FA;1GB&#x7684;&#x7A7A;&#x95F4;&#xFF0C;&#x5BF9;&#x4E8E;&#x8001;&#x578B;&#x53F7;&#x7684;&#x673A;&#x5668;&#x662F;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x6D88;&#x606F;&#x3002;</p>
<p>&#x6839;&#x636E;Apple&#x5728;WWDC&#x4E0A;&#x7684;&#x4ECB;&#x7ECD;&#xFF0C;APFS&#x7684;&#x6838;&#x5FC3;&#x8BBE;&#x8BA1;&#x76EE;&#x6807;&#x662F;&#x5C06;&#x6570;&#x636E;&#x52A0;&#x5BC6;&#x4F5C;&#x4E3A;&#x5934;&#x7B49;&#x8981;&#x52A1;&#xFF0C;&#x4E3A;&#x73B0;&#x4EE3;&#x5316;&#x5907;&#x4EFD;&#x65B9;&#x5F0F;&#x63D0;&#x4F9B;&#x5FEB;&#x7167;&#x529F;&#x80FD;&#x3002;&#x4F46;APFS&#x4E5F;&#x6709;&#x4E9B;&#x4E0D;&#x5C3D;&#x5982;&#x4EBA;&#x610F;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x5982;&#xFF1A;APFS&#x4E0D;&#x9488;&#x5BF9;&#x7528;&#x6237;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x6821;&#x9A8C;&#xFF0C;&#x6CA1;&#x6709;&#x63D0;&#x4F9B;&#x6570;&#x636E;&#x5197;&#x4F59;&#x673A;&#x5236;&#xFF1B;&#x65E0;&#x6CD5;&#x7528;&#x4E8E;&#x542F;&#x52A8;&#x78C1;&#x76D8;&#xFF0C;&#x6587;&#x4EF6;&#x548C;&#x76EE;&#x5F55;&#x540D;&#x79F0;&#x5927;&#x5C0F;&#x5199;&#x654F;&#x611F;&#xFF0C;&#x65E0;&#x6CD5;&#x7528;&#x4E8E;Time Machine&#x3001;FileVault&#x6216;Fusion&#x9A71;&#x52A8;&#x5668;&#xFF1B;APFS&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x7684;&#x5377;&#x65E0;&#x6CD5;&#x88AB;OS X 10.11 Yosemite&#x4EE5;&#x53CA;&#x66F4;&#x65E9;&#x7684;&#x7248;&#x672C;&#x8BC6;&#x522B;&#x7B49;&#x3002;&#x4F46;&#x6280;&#x672F;&#x603B;&#x662F;&#x8FDB;&#x6B65;&#x7684;&#xFF0C;&#x8C01;&#x80FD;&#x8BF4;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#x4E0D;&#x4F1A;&#x5728;&#x4E0D;&#x4E45;&#x7684;&#x5C06;&#x6765;&#x89E3;&#x51B3;&#x5462;&#xFF1F;&#x6211;&#x4EEC;&#x62ED;&#x76EE;&#x4EE5;&#x5F85;&#x3002;</p>
<h4 id="&#x65E9;&#x671F;&#x7684;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;HFS-&#x548C;UFS"><a href="#&#x65E9;&#x671F;&#x7684;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;HFS-&#x548C;UFS" class="headerlink" title="&#x65E9;&#x671F;&#x7684;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;HFS+&#x548C;UFS"></a>&#x65E9;&#x671F;&#x7684;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;HFS+&#x548C;UFS</h4><p>&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x9664;&#x4E86;&#x8BA9;&#x7528;&#x6237;&#x4F9B;&#x7A33;&#x5B9A;&#x5730;&#x5B58;&#x653E;&#x6587;&#x4EF6;&#x8FD9;&#x4E00;&#x76EE;&#x6807;&#x4EE5;&#x5916;&#xFF0C;&#x8FD8;&#x662F;&#x5404;&#x9879;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x529F;&#x80FD;&#x7684;&#x57FA;&#x7840;&#x3002;Mac OS X&#x6BCF;&#x4E2A;&#x5927;&#x53D1;&#x884C;&#x7248;&#x90FD;&#x8981;&#x589E;&#x52A0;&#x6570;&#x767E;&#x9879;&#x65B0;&#x529F;&#x80FD;&#xFF0C;&#x8BB8;&#x591A;&#x65B0;&#x529F;&#x80FD;&#x4E25;&#x91CD;&#x4F9D;&#x8D56;&#x4E8E;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x7684;&#x5B9E;&#x73B0;&#x3002;</p>
<p><strong>UFS</strong></p>
<p>UFS&#x662F;&#x7ECF;&#x5178;&#x7684;Unix&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#xFF0C;HFS+&#x548C;UFS&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x540C;&#x65F6;&#x88AB;&#x5F15;&#x5165;&#x65E9;&#x671F;&#x7684;Mac OS X&#x3002;&#x5728;Unix&#x7CFB;&#x7EDF;&#x65E9;&#x671F;&#xFF0C;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x88AB;&#x79F0;&#x4E3A;FS&#x3002;FS&#x5305;&#x62EC;&#x542F;&#x52A8;&#x5757;&#x3001;&#x8D85;&#x7EA7;&#x5757;&#xFF08;&#x5904;&#x4E8E;&#x786C;&#x76D8;&#x5206;&#x533A;&#x5F00;&#x5934;&#x7528;&#x6765;&#x4FDD;&#x5B58;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4FE1;&#x606F;&#xFF09;&#x3001;inodes&#xFF08;&#x7D22;&#x5F15;&#x8282;&#x70B9;&#xFF09;&#x53CA;&#x6570;&#x636E;&#xFF0C;&#x4F46;FS&#x4F1A;&#x5BFC;&#x81F4;&#x6296;&#x52A8;&#x7B49;&#x4E00;&#x7CFB;&#x5217;&#x95EE;&#x9898;&#x3002;&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x4EA7;&#x751F;&#x4E86;FFS&#xFF08;Fast File System&#xFF09;&#x3002;FFS&#x628A;&#x5148;&#x524D;&#x6574;&#x5757;&#x7684;&#x78C1;&#x76D8;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x5206;&#x4E3A;&#x5C0F;&#x5757;&#xFF0C;&#x6BCF;&#x5757;&#x5305;&#x542B;&#x81EA;&#x5DF2;&#x7684;&#x7D22;&#x5F15;&#x8282;&#x70B9;&#x548C;&#x6570;&#x636E;&#xFF0C;&#x56E0;&#x800C;&#x589E;&#x52A0;&#x4E86;&#x6587;&#x4EF6;&#x7684;&#x5C40;&#x90E8;&#x6027;&#xFF0C;&#x51CF;&#x5C11;&#x4E86;&#x5BFB;&#x9053;&#x65F6;&#x95F4;&#x3002;Unix&#x7CFB;&#x7EDF;&#x7684;&#x5404;BSD&#x5206;&#x652F;&#xFF08;FreeBSD&#x3001;OpenBSD&#x3001;NetBSD&#x53CA;DragonFlyBSD&#xFF09;&#x5728;FFS&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4E0A;&#x589E;&#x52A0;&#x5404;&#x79CD;&#x6269;&#x5C55;&#xFF0C;&#x4F46;&#x8FD9;&#x4E9B;&#x6269;&#x5C55;&#x5F80;&#x5F80;&#x4E0D;&#x4E92;&#x76F8;&#x517C;&#x5BB9;&#xFF0C;&#x5374;&#x53C8;&#x90FD;&#x4F7F;&#x7528;&#x548C;&#x539F;&#x7248;&#x540C;&#x6837;&#x7684;&#x5757;&#x5927;&#x5C0F;&#x548C;&#x6570;&#x636E;&#x5757;&#x5BBD;&#x5EA6;&#xFF0C;&#x56E0;&#x6B64;&#x53EF;&#x4EE5;&#x5728;&#x4E00;&#x4E2A;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E0A;&#x80FD;&#x5BF9;&#x53E6;&#x4E00;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x7684;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x6267;&#x884C;&#x53EA;&#x8BFB;&#x64CD;&#x4F5C;&#x3002;&#x6545;&#x5B83;&#x6709;&#x4E86;&#x4E00;&#x4E2A;&#x66F4;&#x5E7F;&#x6CDB;&#x7684;&#x79F0;&#x8C13;&#x2014;&#x2014;UFS&#xFF08;Unix File System&#xFF0C;&#x5373;Unix&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#xFF09;&#x3002;</p>
<p>&#x540E;&#x6765;&#xFF0C;UFS&#x63D0;&#x4F9B;&#x4E86;&#x7B80;&#x5355;&#x7684;&#x65E5;&#x5FD7;&#x529F;&#x80FD;&#x3002;&#x5728;&#x6863;&#x6848;&#x7CFB;&#x7EDF;&#x53D1;&#x751F;&#x53D8;&#x5316;&#x65F6;&#xFF0C;&#x5148;&#x628A;&#x76F8;&#x5173;&#x7684;&#x4FE1;&#x606F;&#x5199;&#x5165;&#x4E00;&#x4E2A;&#x88AB;&#x79F0;&#x4E3A;&#x65E5;&#x5FD7;&#x7684;&#x533A;&#x57DF;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x628A;&#x53D8;&#x5316;&#x5199;&#x5165;&#x4E3B;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x7684;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x3002;&#x5728;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x53D1;&#x751F;&#x6545;&#x969C;&#xFF08;&#x5982;&#x5185;&#x6838;&#x5D29;&#x6E83;&#x6216;&#x7A81;&#x7136;&#x505C;&#x7535;&#xFF09;&#x65F6;&#xFF0C;&#x65E5;&#x5FD7;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x66F4;&#x5BB9;&#x6613;&#x4FDD;&#x6301;&#x4E00;&#x81F4;&#x6027;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x4EE5;&#x8F83;&#x5FEB;&#x6062;&#x590D;&#x3002;</p>
<p>BSD&#x7684;Soft Update&#x529F;&#x80FD;&#xFF0C;&#x4FDD;&#x8BC1;&#x4E86;&#x8BA1;&#x7B97;&#x673A;&#x6389;&#x7535;&#x6216;&#x7CFB;&#x7EDF;&#x5D29;&#x6E83;&#x65F6;&#xFF0C;&#x901A;&#x8FC7;&#x4F7F;&#x5143;&#x6570;&#x636E;&#x6309;&#x4F9D;&#x8D56;&#x987A;&#x5E8F;&#x66F4;&#x65B0;&#x6765;&#x786E;&#x4FDD;&#x78C1;&#x76D8;&#x4E0A;&#x603B;&#x7684;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4FDD;&#x6301;&#x4E00;&#x81F4;&#x7684;&#x5B9E;&#x73B0;&#x673A;&#x5236;&#x3002;Soft Update&#x7684;&#x76EE;&#x6807;&#x548C;&#x65E5;&#x5FD7;&#x7C7B;&#x4F3C;&#xFF0C;&#x5B9E;&#x73B0;&#x4EE3;&#x4EF7;&#x6BD4;&#x65E5;&#x5FD7;&#x8F7B;&#x91CF;&#x8BB8;&#x591A;&#xFF0C;&#x4F46;&#x5374;&#x9700;&#x8981;&#x5F15;&#x5165;&#x4E00;&#x4E2A;&#x540E;&#x53F0;FSCK&#x68C0;&#x67E5;&#x3002;&#x57FA;&#x4E8E;&#x5BF9;UFS&#x7684;&#x4E00;&#x9879;&#x6539;&#x8FDB;&#xFF0C;&#x4E3A;Soft Update&#x52A0;&#x5165;&#x4E86;&#x65E5;&#x5FD7;&#x529F;&#x80FD;&#xFF0C;&#x5E76;&#x6D88;&#x9664;&#x4E86;&#x5BF9;FSCK&#x7684;&#x4F9D;&#x8D56;&#x3002;</p>
<p>&#x5148;&#x524D;&#xFF0C;Unix&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x7684;&#x8BBF;&#x95EE;&#x63A7;&#x5236;&#x662F;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x7684;&#xFF0C;&#x5176;&#x6743;&#x9650;&#x7BA1;&#x7406;&#x5206;&#x4E3A;&#x4E09;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x7C7B;&#x522B;&#xFF1A;&#x7528;&#x6237;&#x3001;&#x540C;&#x7EC4;&#x7528;&#x6237;&#x4EE5;&#x53CA;&#x5176;&#x4ED6;&#x7528;&#x6237;&#xFF0C;&#x5BF9;&#x6BCF;&#x4E2A;&#x7C7B;&#x522B;&#xFF0C;Unix&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x63D0;&#x4F9B;&#x8BFB;&#x3001;&#x5199;&#x3001;&#x6267;&#x884C;&#x4E09;&#x79CD;&#x6743;&#x9650;&#x7684;&#x7BA1;&#x7406;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x8BB8;&#x53EF;&#x7BA1;&#x7406;&#x8FC7;&#x4E8E;&#x7C97;&#x7CD9;&#xFF0C;&#x65E0;&#x6CD5;&#x6307;&#x5B9A;&#x67D0;&#x4E00;&#x7528;&#x6237;&#x8BBF;&#x95EE;&#x7684;&#x6743;&#x9650;&#xFF0C;&#x4E5F;&#x65E0;&#x6CD5;&#x6307;&#x5B9A;&#x66F4;&#x4E3A;&#x7EC6;&#x81F4;&#x7684;&#x6743;&#x9650;&#x5185;&#x5BB9;&#xFF08;&#x4F8B;&#x5982;&#x51C6;&#x8BB8;&#x5BF9;&#x4E00;&#x6587;&#x4EF6;&#x5B9E;&#x884C;&#x5220;&#x9664;&#x64CD;&#x4F5C;&#xFF09;&#x3002;&#x4E3A;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;UFS&#x589E;&#x52A0;&#x4E86;ACL&#x8BBF;&#x95EE;&#x63A7;&#x5236;&#x8868;&#x529F;&#x80FD;&#xFF08;Access Control Lists&#xFF09;&#xFF0C;&#x8BBF;&#x95EE;&#x63A7;&#x5236;&#x8868;&#x88AB;&#x589E;&#x52A0;&#x5230;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x4F7F;&#x7528;&#x4EE5;&#x5B58;&#x53D6;&#x63A7;&#x5236;&#x77E9;&#x9635;&#x4E3A;&#x57FA;&#x7840;&#x7684;&#x5B58;&#x53D6;&#x63A7;&#x5236;&#x65B9;&#x6CD5;&#x3002;&#x5B58;&#x53D6;&#x63A7;&#x5236;&#x4E32;&#x5217;&#x63CF;&#x8FF0;&#x6BCF;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x5BF9;&#x8C61;&#x5404;&#x81EA;&#x7684;&#x5B58;&#x53D6;&#x63A7;&#x5236;&#xFF0C;&#x5E76;&#x8BB0;&#x5F55;&#x53EF;&#x5BF9;&#x6B64;&#x7269;&#x4EF6;&#x8FDB;&#x884C;&#x5B58;&#x53D6;&#x7684;&#x6240;&#x6709;&#x4E3B;&#x4F53;&#x5BF9;&#x5BF9;&#x8C61;&#x7684;&#x6743;&#x9650;&#x3002;&#x603B;&#x4E4B;&#xFF0C;UFS&#x4E0E;&#x65F6;&#x4FF1;&#x8FDB;&#xFF0C;&#x4E0D;&#x65AD;&#x589E;&#x52A0;&#x65B0;&#x7684;&#x529F;&#x80FD;&#x3002;</p>
<p>Mac OS X&#x8D77;&#x6E90;&#x4E8E;NeXTSTEP&#xFF0C;&#x56E0;&#x4E3A;&#x57FA;&#x4E8E;BSD&#xFF0C;&#x6240;&#x4EE5;&#x81EA;&#x7136;&#x4E5F;&#x4F7F;&#x7528;UFS&#x3002;</p>
<p><strong>HFS+</strong></p>
<p>&#x5728;&#x5F15;&#x5165;UFS&#x7684;&#x540C;&#x65F6;&#xFF0C;Mac OS &#x8FD8;&#x6709;&#x4E2A;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;HFS&#xFF0C;HFS&#x8BDE;&#x751F;&#x4E8E;1985&#x5E74;&#xFF0C;&#x4E3A;&#x4E86;&#x5B9E;&#x73B0;Mac OS&#x7684;&#x73B0;&#x4EE3;&#x5316;&#xFF0C;&#x5728;HFS&#x7684;&#x57FA;&#x7840;&#x4E0A;&#xFF0C;&#x52A0;&#x5165;&#x73B0;&#x4EE3;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x6240;&#x5FC5;&#x9700;&#x7684;&#x65B0;&#x529F;&#x80FD;&#xFF0C;&#x5982;&#x5927;&#x6587;&#x4EF6;&#x652F;&#x6301;&#x3001;Unicode&#x6587;&#x4EF6;&#x540D;&#x652F;&#x6301;&#x3001;&#x957F;&#x6587;&#x4EF6;&#x540D;&#x652F;&#x6301;&#x3001;32&#x4F4D;&#x6587;&#x4EF6;&#x6620;&#x5C04;&#x8868;&#x652F;&#x6301;&#x7B49;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x628A;HFS&#x9879;&#x76EE;&#x539F;&#x672C;&#x7684;Mac&#x4F7F;&#x7528;&#x7684;68K&#x5904;&#x7406;&#x5668;&#x6C47;&#x7F16;&#x7801;&#x6539;&#x5199;&#x6210;C&#x4EE3;&#x7801;&#x3002;&#x5373;&#x6539;&#x8FDB;&#x7684;HFS+&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x3002;</p>
<p>HFS+&#x6839;&#x690D;Mac OS&#xFF0C;HFS+&#x662F;&#x5BF9;HFS&#x7684;&#x6269;&#x5C55;&#xFF0C;&#x6545;HFS+&#x652F;&#x6301;Mac OS&#x81F3;Mac OS X&#x7684;&#x5E73;&#x6ED1;&#x8FC7;&#x6E21;&#xFF0C;&#x6240;&#x4EE5;Mac OS X&#x4E00;&#x76F4;&#x9ED8;&#x8BA4;&#x4F7F;&#x7528;HFS+&#xFF0C;&#x4F46;&#x5F53;&#x65F6;&#x7684;UFS&#x63D0;&#x4F9B;&#x6BD4;HFS+&#x66F4;&#x5148;&#x8FDB;&#x7684;&#x529F;&#x80FD;&#x3002;Mac OS X 10.2.2&#x5F00;&#x59CB;&#xFF0C;HFS+&#x652F;&#x6301;&#x65E5;&#x5FD7;&#xFF0C;&#x5E26;&#x65E5;&#x5FD7;&#x529F;&#x80FD;&#x7684;HFS+&#xFF08;&#x88AB;&#x79F0;&#x4E3A;HFSJ&#xFF0C;&#x5373;HFS+ volume with journal&#xFF09;&#x6210;&#x4E3A;&#x9ED8;&#x8BA4;&#x8BBE;&#x7F6E;&#x3002;&#x4E4B;&#x540E;&#x589E;&#x52A0;&#x4E86;&#x540D;&#x4EF6;&#x540D;&#x3001;&#x76EE;&#x5F55;&#x540D;&#x533A;&#x5206;&#x5927;&#x5C0F;&#x5199;&#x53CA;Unicode 3.2&#x7684;&#x652F;&#x6301;&#x3002;Mac OS X 10.4&#x4E2D;&#xFF0C;HFS+&#x66F4;&#x662F;&#x589E;&#x52A0;&#x4E86;ACL&#x8BBF;&#x95EE;&#x63A7;&#x5236;&#x8868;&#x529F;&#x80FD;&#xFF0C;&#x63D0;&#x4F9B;&#x66F4;&#x590D;&#x6742;&#x7684;&#x5BF9;&#x4F20;&#x7EDF;Unix&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x6743;&#x9650;&#x7684;&#x6269;&#x5C55;&#x3002;&#x5728;Mac OS X 10.5&#x4E4B;&#x540E;HFS+&#x6210;&#x4E3A;&#x552F;&#x4E00;&#x6B63;&#x5F0F;&#x7684;Mac OS X&#x7CFB;&#x7EDF;&#xFF0C;HFS+&#x63D0;&#x4F9B;&#x7684;&#x529F;&#x80FD;&#x4E5F;&#x5DF2;&#x8D85;&#x8D8A;UFS&#x3002;</p>
<p>&#x5728;&#x9010;&#x6B65;&#x7684;&#x4F18;&#x5316;&#x4E2D;&#xFF0C;HFS+&#x6108;&#x8D70;&#x6108;&#x8FDC;&#x3002;</p>
<ul>
<li><p>FileVault&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x52A0;&#x5BC6;&#x7528;&#x6237;&#x6587;&#x4EF6;&#xFF0C;&#x56E0;&#x6B64;&#x7528;&#x6237;&#x4E3B;&#x76EE;&#x5F55;&#x88AB;&#x4FDD;&#x5B58;&#x5728;&#x4E00;&#x4E2A;HFS+&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x52A0;&#x5BC6;&#x955C;&#x50CF;&#x4E2D;&#x3002;Mac OS X 10.7&#x63D0;&#x51FA;&#x4E86;FileVault2&#xFF0C;&#x80FD;&#x52A0;&#x5BC6;&#x6574;&#x4E2A;&#x78C1;&#x76D8;&#x800C;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x7528;&#x6237;&#x76EE;&#x5F55;&#x3002;</p>
</li>
<li><p>Spotlight&#x684C;&#x9762;&#x641C;&#x5BFB;&#x641C;&#x7D22;&#x529F;&#x80FD;&#xFF0C;&#x80FD;&#x8BA9;&#x7528;&#x6237;&#x5BF9;&#x6574;&#x4E2A;&#x78C1;&#x76D8;&#x7CFB;&#x7EDF;&#x8FDB;&#x884C;&#x5FEB;&#x901F;&#x641C;&#x5BFB;&#x3001;&#x968F;&#x6253;&#x5373;&#x663E;&#x3002;&#x8FD9;&#x9879;&#x529F;&#x80FD;&#x8981;&#x6C42;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x63D0;&#x4F9B;&#x4EFB;&#x610F;&#x957F;&#x5EA6;&#x6587;&#x4EF6;&#x5143;&#x6570;&#x636E;&#xFF08;metadata&#xFF09;&#x7684;&#x652F;&#x6301;&#x3002;</p>
</li>
<li><p>BootCamp&#x9700;&#x8981;&#x65F6;&#x65F6;&#x8C03;&#x6574;&#x7CFB;&#x7EDF;&#x4E3B;&#x5206;&#x533A;&#x7684;&#x5927;&#x5C0F;&#xFF0C;&#x6765;&#x7A7A;&#x51FA;&#x78C1;&#x76D8;&#x7A7A;&#x95F4;&#x7ED9;Windows&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;HFS+&#x53C8;&#x9700;&#x8981;&#x652F;&#x6301;&#x52A8;&#x6001;&#x5206;&#x533A;&#x5927;&#x5C0F;&#x8C03;&#x6574;&#x3002;</p>
</li>
<li><p>Time Machine&#xFF0C;&#x662F;&#x82F9;&#x679C;&#x516C;&#x53F8;&#x6240;&#x63A8;&#x51FA;&#x5907;&#x4EFD;&#x7684;&#x5DE5;&#x5177;&#x7A0B;&#x5E8F;&#xFF0C;Time Machine&#x5BF9;&#x4E8E;&#x4FEE;&#x6539;&#x8FC7;&#x7684;&#x6587;&#x4EF6;&#x4F1A;&#x5728;&#x5907;&#x4EFD;&#x76D8;&#x4E0A;&#x4FDD;&#x5B58;&#x4E00;&#x4E2A;&#x65B0;&#x62F7;&#x8D1D;&#xFF0C;&#x800C;&#x5BF9;&#x4E8E;&#x4E0D;&#x53D8;&#x7684;&#x5185;&#x5BB9;&#xFF0C;&#x4EC5;&#x5728;&#x5907;&#x4EFD;&#x76D8;&#x4E0A;&#x5B58;&#x4E00;&#x4E2A;&#x6307;&#x5411;&#x5148;&#x524D;&#x6587;&#x4EF6;&#x7684;&#x786C;&#x94FE;&#x63A5;&#x3002;&#x56E0;&#x6B64;&#x6BCF;&#x4E00;&#x6B21;&#x5FEB;&#x7167;&#x53EA;&#x4FDD;&#x5B58;&#x6539;&#x52A8;&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x800C;&#x522B;&#x7684;&#x6587;&#x4EF6;&#x53EA;&#x4FDD;&#x5B58;&#x5360;&#x7528;&#x7A7A;&#x95F4;&#x5F88;&#x5C11;&#x7684;&#x786C;&#x94FE;&#x63A5;&#x3002;&#x4F46;Unix&#x4E00;&#x822C;&#x53EA;&#x652F;&#x6301;&#x6587;&#x4EF6;&#x7684;&#x786C;&#x94FE;&#x63A5;&#x800C;&#x4E0D;&#x652F;&#x6301;&#x76EE;&#x5F55;&#x7684;&#x786C;&#x94FE;&#x63A5;&#x3002;&#x56E0;&#x6B64;HFS+&#x5728;&#x8FD9;&#x70B9;&#x4E0A;&#x8D70;&#x5F97;&#x6BD4;Unix&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x66F4;&#x8FDC;&#xFF0C;&#x63D0;&#x4F9B;&#x4E86;&#x5BF9;&#x4E8E;&#x76EE;&#x5F55;&#x7684;&#x786C;&#x94FE;&#x63A5;&#x652F;&#x6301;&#x3002;</p>
</li>
<li><p>HFS+&#x652F;&#x6301;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x538B;&#x7F29;&#xFF0C;&#x4F7F;&#x5F97;&#x5B89;&#x88C5;&#x540E;&#x5360;&#x7528;&#x6BD4;Mac OS X 10.5&#x5C11;&#x5F97;&#x591A;&#x7684;&#x7A7A;&#x95F4;&#x3002;</p>
</li>
</ul>
<p>&#x4F46;&#xFF0C;HFS+&#x5E76;&#x4E0D;&#x5B8C;&#x7F8E;&#x3002;</p>
<h4 id="&#x4E0D;&#x5B8C;&#x7F8E;&#x7684;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;"><a href="#&#x4E0D;&#x5B8C;&#x7F8E;&#x7684;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;" class="headerlink" title="&#x4E0D;&#x5B8C;&#x7F8E;&#x7684;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;"></a>&#x4E0D;&#x5B8C;&#x7F8E;&#x7684;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;</h4><p>&#x7ECF;&#x8FC7;&#x957F;&#x671F;&#x53D1;&#x5C55;&#xFF0C;HFS+&#x9488;&#x5BF9;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x8BBE;&#x5907;&#x884D;&#x751F;&#x51FA;&#x4E0D;&#x540C;&#x529F;&#x80FD;&#x7684;&#x591A;&#x79CD;&#x5206;&#x652F;&#xFF0C;&#x4F46;&#x5B83;&#x6BD5;&#x7ADF;&#x592A;&#x8001;&#x3001;&#x592A;&#x6DF7;&#x4E71;&#x4E86;&#x3002;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;&#x8BE5;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4E0D;&#x5177;&#x5907;&#x5F53;&#x4ECA;&#x5927;&#x591A;&#x6570;&#x4F01;&#x4E1A;&#x6240;&#x9700;&#x8981;&#x7684;&#x4E00;&#x4E9B;&#x57FA;&#x672C;&#x529F;&#x80FD;&#xFF0C;&#x4F8B;&#x5982;&#x7EB3;&#x79D2;&#x7EA7;&#x65F6;&#x95F4;&#x6233;&#x3001;&#x6821;&#x9A8C;&#x3001;&#x5FEB;&#x7167;&#x3001;&#x7A00;&#x758F;&#x6587;&#x4EF6;&#x7B49;&#x3002;&#x4ECE;1998&#x5E74;4GB&#x5BB9;&#x91CF;&#x7684;&#x4F20;&#x7EDF;HDD&#x673A;&#x68B0;&#x786C;&#x76D8;&#xFF0C;&#x5230;&#x73B0;&#x5728;TB&#x89C4;&#x6A21;&#x7684;SSD&#x56FA;&#x6001;&#x786C;&#x76D8;&#xFF0C;HFS+&#x5DF2;&#x7ECF;&#x62DB;&#x67B6;&#x4E0D;&#x4F4F;&#x5B58;&#x50A8;&#x9886;&#x57DF;&#x7684;&#x5927;&#x91CF;&#x6539;&#x53D8;&#x548C;&#x521B;&#x65B0;&#x3002;</p>
<p>HFS+&#x57FA;&#x4E8E;B-&#x6811;&#x5B9E;&#x73B0;&#xFF0C;&#x5F53;&#x67E5;&#x627E;B-&#x6811;&#x4E2D;&#x672A;&#x4F7F;&#x7528;&#x7684;&#x8282;&#x70B9;&#x65F6;&#xFF0C;HFS+&#x53EA;&#x80FD;&#x6BCF;&#x6B21;&#x5904;&#x7406;16&#x4F4D;&#xFF0C;&#x539F;&#x56E0;&#x662F;&#x8001;Mac&#x4F7F;&#x7528;&#x7684;Motorola&#x7684;68K&#x82AF;&#x7247;&#x539F;&#x751F;&#x652F;&#x6301;16&#x4F4D;&#x7684;&#x6570;&#x636E;&#x64CD;&#x4F5C;&#x3002;&#x4F46;&#x4E0D;&#x7BA1;&#x662F;PowerPC&#x8FD8;&#x662F;Intel&#xFF0C;&#x5BC4;&#x5B58;&#x5668;&#x90FD;&#x652F;&#x6301;256&#x4F4D;&#x5BBD;&#x7684;&#x5BC4;&#x5B58;&#x5668;&#x3002;</p>
<p>HFS+&#x7684;&#x5143;&#x6570;&#x636E;&#xFF08;metadata&#xFF09;&#x90FD;&#x4EE5;&#x5927;&#x5B57;&#x8282;&#x5E8F;&#x4FDD;&#x5B58;&#xFF0C;&#x539F;&#x56E0;&#x662F;Motorola&#x7684;68k&#x548C;&#x540E;&#x6765;Mac&#x4F7F;&#x7528;&#x7684;PowerPC&#x90FD;&#x4F7F;&#x7528;&#x5927;&#x5B57;&#x8282;&#x5E8F;&#x3002;&#x4F46;&#x7ECF;&#x8FC7;Intel&#x8FC1;&#x79FB;&#x540E;&#xFF0C;&#x5F53;&#x4ECA;&#x7684;Mac&#x90FD;&#x4F7F;&#x7528;Intel&#x82AF;&#x7247;&#xFF0C;&#x800C;Intel&#x82AF;&#x7247;&#x662F;&#x4F7F;&#x7528;&#x5C0F;&#x5B57;&#x8282;&#x5E8F;&#x7684;&#x3002;&#x56E0;&#x6B64;&#x6BCF;&#x5F53;&#x6570;&#x636E;&#x8BFB;&#x53D6;&#x6216;&#x5B58;&#x5165;&#x65F6;&#xFF0C;&#x8FD8;&#x8981;&#x7ECF;&#x8FC7;&#x5C0F;&#x5B57;&#x8282;&#x5E8F;&#x548C;&#x5927;&#x5B57;&#x8282;&#x5E8F;&#x7684;&#x8F6C;&#x6362;&#x3002;&#x8FDC;&#x53E4;&#x65F6;&#x671F;&#x78C1;&#x76D8;&#x5F88;&#x6162;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x5904;&#x7406;&#x5668;&#x7684;&#x901F;&#x5EA6;&#x4E5F;&#x5F88;&#x4F4E;&#xFF0C;&#x56E0;&#x6B64;&#x8FDB;&#x884C;&#x4E00;&#x6B21;&#x78C1;&#x76D8;&#x64CD;&#x4F5C;&#x4F1A;&#x5360;&#x7528;&#x8F83;&#x591A;&#x7684;&#x65F6;&#x95F4;&#xFF0C;HFS+&#x7684;&#x65F6;&#x95F4;&#x5206;&#x8FA8;&#x7387;&#x4E3A;&#x4E00;&#x79D2;&#xFF0C;&#x4F46;&#x5F53;&#x4ECA;&#x7684;&#x78C1;&#x76D8;&#x3001;&#x5904;&#x7406;&#x5668;&#x5904;&#x7406;&#x4E00;&#x6B21;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x64CD;&#x4F5C;&#x7684;&#x65F6;&#x95F4;&#x8FDC;&#x5C0F;&#x4E8E;&#x4E00;&#x79D2;&#xFF0C;&#x56E0;&#x6B64;&#x6240;&#x6709;&#x4E3B;&#x6D41;&#x78C1;&#x76D8;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x7684;&#x65F6;&#x95F4;&#x5206;&#x8FA8;&#x7387;&#x90FD;&#x662F;&#x4E00;&#x81F3;&#x6570;&#x767E;&#x7EB3;&#x79D2;&#x7EA7;&#x522B;&#x7684;&#x3002;</p>
<blockquote>
<p>&#x5927;&#x5B57;&#x8282;&#x5E8F;&#xFF1A;&#x628A;&#x9AD8;&#x6709;&#x6548;&#x4F4D;&#x653E;&#x5728;&#x4F4E;&#x5730;&#x5740;&#x6BB5;&#xFF0C;&#x4F8B;&#x5982;&#x5728;&#x6309;&#x5B57;&#x8282;&#x5BFB;&#x5740;&#x7684;&#x5B58;&#x50A8;&#x5668;&#x4E2D;&#x5F80;&#x5730;&#x5740; 0x0001 &#x5B58;&#x653E;&#x503C; 0x12345678&#xFF0C;&#x5728;&#x5B58;&#x50A8;&#x5668;&#x4E2D;&#x4E3A;</p>
<pre><code>&#x5730;&#x5740;             &#x6570;&#x503C;
0x0004        0x78
0x0003        0x56
0x0002        0x34
0x0001        0x12
</code></pre><p>&#x5C0F;&#x5B57;&#x8282;&#x5E8F;&#xFF1A;&#x628A;&#x4F4E;&#x6709;&#x6548;&#x4F4D;&#x653E;&#x5728;&#x4F4E;&#x5730;&#x5740;&#x6BB5;&#xFF0C;&#x4F8B;&#x5982;&#x5728;&#x6309;&#x5B57;&#x8282;&#x5BFB;&#x5740;&#x7684;&#x5B58;&#x50A8;&#x5668;&#x4E2D;&#x5F80;&#x5730;&#x5740; 0x0001 &#x5B58;&#x653E;&#x503C; 0x12345678&#xFF0C;&#x5728;&#x5B58;&#x50A8;&#x5668;&#x4E2D;&#x4E3A;</p>
<pre><code>&#x5730;&#x5740;             &#x6570;&#x503C;
0x0004        0x12
0x0003        0x34
0x0002        0x56
0x0001        0x78
</code></pre><p>&#x73B0;&#x5728;&#x4E3B;&#x6D41;&#x7684;CPU,intel&#x7CFB;&#x5217;&#x7684;&#x662F;&#x91C7;&#x7528;&#x7684;little endian&#x7684;&#x683C;&#x5F0F;&#x5B58;&#x653E;&#x6570;&#x636E;&#x7684;&#x3002;</p>
</blockquote>
<p>HFS+&#x7684;&#x5143;&#x6570;&#x636E;&#x6709;&#x5168;&#x5C40;&#x9501;&#xFF0C;&#x540C;&#x4E00;&#x65F6;&#x95F4;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x8FDB;&#x7A0B;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x66F4;&#x65B0;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x3002;&#x5728;&#x5355;&#x6838;&#x5904;&#x7406;&#x5668;&#x8FDE;&#x624B;&#x673A;&#x5E73;&#x677F;&#x90FD;&#x8F83;&#x5C11;&#x89C1;&#x5230;&#x7684;&#x5F53;&#x4ECA;&#xFF0C;&#x8FD9;&#x79CD;&#x8BBE;&#x8BA1;&#x663E;&#x5F97;&#x5F88;&#x5E7C;&#x7A1A;&#x3002;</p>
<p>HFS+&#x4EA6;&#x6CA1;&#x6709;&#x7A00;&#x758F;&#x6587;&#x4EF6;&#x7684;&#x652F;&#x6301;&#x3002;&#x4F8B;&#x5982;&#x6211;&#x4EEC;&#x5728;SQL&#x4E2D;&#x5EFA;&#x7ACB;&#x4E86;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#xFF0C;SQL&#x5206;&#x914D;&#x4E86;10GB&#x7684;&#x6587;&#x4EF6;&#x7ED9;&#x8FD9;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x6587;&#x4EF6;&#x5934;&#x548C;&#x6587;&#x4EF6;&#x5C3E;&#x5199;&#x4E0A;&#x4E00;&#x4E9B;&#x5B57;&#x8282;&#x7684;&#x6570;&#x636E;&#x3002;&#x800C;&#x7531;&#x4E8E;&#x6211;&#x4EEC;&#x8FD8;&#x6CA1;&#x6709;&#x7ED9;&#x8FD9;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x6DFB;&#x52A0;&#x65B0;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;10GB&#x7684;&#x6587;&#x4EF6;&#x9664;&#x4E86;&#x5934;&#x5C3E;&#x5916;&#x5176;&#x4ED6;&#x5B57;&#x8282;&#x90FD;&#x4E3A;0&#x3002;&#x73B0;&#x4EE3;&#x7684;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x57FA;&#x672C;&#x90FD;&#x652F;&#x6301;&#x7A00;&#x758F;&#x6587;&#x4EF6;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x5F53;&#x5904;&#x7406;&#x8FD9;&#x4E2A;&#x6570;&#x636E;&#x5E93;&#x64CD;&#x4F5C;&#x65F6;&#xFF0C;&#x4E8B;&#x5B9E;&#x4E0A;&#x5F80;&#x78C1;&#x76D8;&#x5199;&#x5165;&#x7684;&#x6570;&#x636E;&#x53EA;&#x6709;&#x90A3;&#x6587;&#x4EF6;&#x5934;&#x548C;&#x6587;&#x4EF6;&#x5C3E;&#x7684;&#x82E5;&#x5E72;&#x5B57;&#x8282;&#x3002;&#x800C;HFS+&#x5219;&#x9700;&#x8981;&#x628A;&#x90A3;&#x4E9B;0&#x4E5F;&#x5199;&#x4E0A;&#xFF0C;&#x56E0;&#x6B64;&#x4F1A;&#x5B8C;&#x6574;&#x5199;&#x5165;10GB&#x7684;&#x6570;&#x636E;&#xFF0C;&#x8017;&#x8D39;&#x957F;&#x5F97;&#x591A;&#x7684;&#x65F6;&#x95F4;&#x3002;</p>
<p>&#x6B64;&#x5916;&#xFF0C;HFS+&#x4E0D;&#x5177;&#x5907;&#x5143;&#x6570;&#x636E;&#x6821;&#x9A8C;&#x529F;&#x80FD;&#x3001;&#x5FEB;&#x7167;&#x529F;&#x80FD;&#x3001;&#x5199;&#x5165;&#x65F6;&#x590D;&#x5236;&#x529F;&#x80FD;&#x3001;&#x5C31;&#x5730;&#x6267;&#x884C;&#x529F;&#x80FD;&#x3001;&#x903B;&#x8F91;&#x5377;&#x7BA1;&#x7406;&#x529F;&#x80FD;&#x7B49;&#x5F88;&#x591A;&#x73B0;&#x4EE3;&#x78C1;&#x76D8;&#x7CFB;&#x7EDF;&#x6240;&#x5177;&#x5907;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x4E5F;&#x4E0D;&#x80FD;&#x52A8;&#x6001;&#x8C03;&#x6574;&#x6587;&#x4EF6;&#x5757;&#x5927;&#x5C0F;&#x3002;&#x8FD9;&#x4E9B;&#x529F;&#x80FD;&#x7684;&#x52A0;&#x5165;&#x5E76;&#x4E0D;&#x5BB9;&#x6613;&#x3002;&#x8FD9;&#x4F7F;&#x5F97;&#x7528;&#x6237;&#x6570;&#x636E;&#x65F6;&#x65F6;&#x5904;&#x4E8E;&#x98CE;&#x9669;&#x4E4B;&#x4E2D;&#x3002;&#x4F8B;&#x5982;&#x7531;&#x4E8E;&#x56E0;&#x4E3A;&#x65AD;&#x7535;&#x3001;&#x5185;&#x6838;&#x5D29;&#x6E83;&#x7B49;&#x539F;&#x56E0;&#xFF0C;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x4E0A;&#x5199;&#x5230;&#x4E00;&#x534A;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x5C0F;&#x5219;&#x5BFC;&#x81F4;&#x4E2A;&#x522B;&#x6587;&#x4EF6;&#x635F;&#x574F;&#xFF0C;&#x5927;&#x5219;&#x5BFC;&#x81F4;&#x6574;&#x4E2A;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x5D29;&#x6E83;&#x3002;&#x5728;&#x751F;&#x4EA7;&#x9886;&#x57DF;&#xFF0C;&#x8FD9;&#x6837;&#x4E0D;&#x53EF;&#x9760;&#x7684;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#xFF0C;&#x5F88;&#x6709;&#x53EF;&#x80FD;&#x5E26;&#x6765;&#x81F4;&#x547D;&#x7684;&#x707E;&#x96BE;&#x3002;</p>
<blockquote>
<p>&#x5FEB;&#x7167;&#x529F;&#x80FD;&#x53EF;&#x5C06;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x7684;&#x72B6;&#x6001;&#x201C;&#x56FA;&#x5B9A;&#x201D;&#x5728;&#x521B;&#x5EFA;&#x5FEB;&#x7167;&#x7684;&#x90A3;&#x4E00;&#x523B;&#xFF0C;&#x5E76;&#x53EF;&#x5728;&#x4FDD;&#x7559;&#x56FA;&#x5B9A;&#x72B6;&#x6001;&#x7684;&#x540C;&#x65F6;&#x7EE7;&#x7EED;&#x8BBF;&#x95EE;&#x548C;&#x4FEE;&#x6539;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x3002;&#x8FD9;&#x79CD;&#x6280;&#x672F;&#x53EF;&#x4EE5;&#x53EA;&#x8BB0;&#x5F55;&#x65B0;&#x589E;&#x6216;&#x6539;&#x52A8;&#x7684;&#x6570;&#x636E;&#x5757;&#xFF0C;&#x56E0;&#x6B64;&#x53EF;&#x4EE5;&#x4E3A;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x521B;&#x5EFA;&#x591A;&#x4E2A;&#x5FEB;&#x7167;&#xFF0C;&#x800C;&#x65E0;&#x9700;&#x62C5;&#x5FC3;&#x4F1A;&#x5360;&#x7528;&#x5927;&#x91CF;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x3002;&#x5907;&#x4EFD;&#x5DE5;&#x5177;&#xFF08;&#x4F8B;&#x5982;Time Machine&#xFF09;&#x901A;&#x5E38;&#x4F1A;&#x4F7F;&#x7528;&#x8BE5;&#x529F;&#x80FD;&#x8BB0;&#x5F55;&#x81EA;&#x4ECE;&#x4E0A;&#x6B21;&#x5907;&#x4EFD;&#x4E4B;&#x540E;&#x6587;&#x4EF6;&#x7CFB;&#x7EDF;&#x7684;&#x6539;&#x52A8;&#x60C5;&#x51B5;&#xFF0C;&#x5E76;&#x53EF;&#x7528;&#x4E8E;&#x5728;&#x4E0D;&#x6253;&#x65AD;&#x7528;&#x6237;&#x64CD;&#x4F5C;&#x7684;&#x524D;&#x63D0;&#x4E0B;&#x5BF9;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x66F4;&#x4E3A;&#x9AD8;&#x6548;&#x7684;&#x5907;&#x4EFD;&#x3002;</p>
</blockquote>

            <div class="clearfix"></div>
            <hr class="nogutter">
        </div>


        <nav class="pagination" role="pagination">


<div class="ds-share flat" data-thread-key="2017/02/22/iOS的APFS系统/" data-title="" data-images="https://avatars0.githubusercontent.com/u/10378248?v=3&s=460" data-content=" 是最近写的文章，希望能帮到您！" data-url="https://dangdangfeng.github.io/2017/02/22/iOS的APFS系统/">
    <div class="ds-share-inline">
      <ul  class="ds-share-icons-16">
        
        <li data-toggle="ds-share-icons-more"><a class="ds-more" href="javascript:void(0);">分享到：</a></li>
        <li><a class="ds-weibo" href="javascript:void(0);" data-service="weibo">微博</a></li>
        <li><a class="ds-qzone" href="javascript:void(0);" data-service="qzone">QQ空间</a></li>
        <li><a class="ds-qqt" href="javascript:void(0);" data-service="qqt">腾讯微博</a></li>
        <li><a class="ds-wechat" href="javascript:void(0);" data-service="wechat">微信</a></li>
        
      </ul>
      <div class="ds-share-icons-more">
      </div>
    </div>
 </div>

 <br/>

    
    
    <a class="pull-right" href="/2016/09/06/如何才能学好Node-js/">
        如何才能学好Node.js →
    </a>
    

    
</nav>



        
        <div class="duoshuo">


<div class="ds-thread" data-thread-key="2017/02/22/iOS的APFS系统/" data-title="" data-url="https://dangdangfeng.github.io/2017/02/22/iOS的APFS系统/"></div>



<script type="text/javascript">
var duoshuoQuery = {short_name:"deter"};
(function() {
	var ds = document.createElement('script');
	ds.type = 'text/javascript';ds.async = true;
	ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
	ds.charset = 'UTF-8';
	(document.getElementsByTagName('head')[0] 
	 || document.getElementsByTagName('body')[0]).appendChild(ds);
})();
</script>
</div>
    </div>
</section>


      
<!-- ============================ Footer =========================== -->

<footer>
    <div class="container">
            <div class="copy">
                <p>
                    &copy; 2010<script>new Date().getFullYear()>2010&&document.write("-"+new Date().getFullYear());</script>, Content By 吴白. All Rights Reserved.
                </p>
                <p>Theme By <a href="//go.kieran.top" style="color: #767D84">Kieran</a></p>
            </div>
            <div class="social">
                <ul>
                    
                    <li><a href="https://github.com/" title="Github" target="_blank"><i class="icon-github"></i></a>&nbsp;</li>
                    
                    
                    <li><a href="https://twitter.com/" title="Twitter" target="_blank"><i class="icon-twitter"></i></a>&nbsp;</li>
                    
                    
                    <li><a href="https://www.facebook.com/" title="Facebook" target="_blank"><i class="icon-facebook"></i></a>&nbsp;</li>
                    
                    
                    <li><a href="https://google.com/" title="Google-Plus" target="_blank"><i class="icon-google-plus"></i></a>&nbsp;</li>
                    
                    
                    <li><a href="http://weibo.com/" title="Sina-Weibo" target="_blank"><i class="icon-sina-weibo"></i></a>&nbsp;</li>
                    
                </ul>
            </div>
            <div class="clearfix"> </div>
        </div>
</footer>

<!-- ============================ END Footer =========================== -->
      <!-- Load our scripts -->
        
<!-- Resizable 'on-demand' full-height hero -->
<script type="text/javascript">
    
    var resizeHero = function () {
        var hero = $(".cover,.heightblock"),
            window1 = $(window);
        hero.css({
            "height": window1.height()
        });
    };
    
    resizeHero();
    
    $(window).resize(function () {
        resizeHero();
    });
</script>
<script src="/js/plugins.min.js"></script><!-- Bootstrap core and concatenated plugins always load here -->
<script src="/js/jquery.flexslider-min.js"></script><!-- Flexslider plugin -->
<script src="/js/scripts.js"></script><!-- Theme scripts -->

<!-- Initiate flexslider plugin -->
<script type="text/javascript">
    $(document).ready(function($) {
      $('.flexslider').flexslider({
        animation: "fade",
        prevText: "",
        nextText: "",
        directionNav: true
      });
    });
</script>

</body>
</html>
