<!DOCTYPE html>
<!--[if lte IE 8 ]>
<html class="ie" xmlns="http://www.w3.org/1999/xhtml" xml:lang="en-US" lang="en-US">
<![endif]-->
<!--[if (gte IE 9)|!(IE)]><!-->
<!--
***************  *      *     *
      8          *    *       *
      8          *  *         *
      8          **           *
      8          *  *         *
      8          *    *       *
      8          *      *     *
      8          *        *   ***********    -----Theme By Kieran(http://go.kieran.top)
-->
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en-US" lang="en-US">
<!--<![endif]-->

<head>
  <title>谈谈C的性能特点 | 流城</title>
  <!-- Meta data -->
    <meta http-equiv="Content-Type" content="text/html" charset="UTF-8" >
    <meta http-equiv="X-UA-Compatible" content="IE=edge"/>
    <meta name="viewport" content="width=device-width, initial-scale=1.0" />
    <meta name="generator" content="流城">
    <meta name="author" content="吴白">
    <meta name="description" content="" />
    <meta name="keywords" content="" />

    <!-- Favicon, (keep icon in root folder) -->
    <link rel="Shortcut Icon" href="/img/favicon.ico" type="image/ico">

    <link rel="alternate" href="/atom.xml" title="流城" type="application/atom+xml">
    <link rel="stylesheet" href="/css/all.css" media="screen" type="text/css">
	
    <link rel="stylesheet" href="/highlightjs/vs.css" type="text/css">
    
    

    <!-- Custom stylesheet, (add custom styles here, always load last) -->
    <!-- Load our stylesheet for IE8 -->
    <!--[if IE 8]>
    <link rel="stylesheet" type="text/css" href="/css/ie8.css" />
    <![endif]-->

    <!-- Google Webfonts (Monserrat 400/700, Open Sans 400/600) -->
    <!--<link href='//fonts.useso.com/css?family=Montserrat:400,700' rel='stylesheet' type='text/css'>-->
    <!--<link href='//fonts.useso.com/css?family=Open+Sans:400,600' rel='stylesheet' type='text/css'>-->

    <!-- Load our fonts individually if IE8+, to avoid faux bold & italic rendering -->
    <!--[if IE]>
    <!--<link href='http://fonts.useso.com/css?family=Montserrat:400' rel='stylesheet' type='text/css'> -->
    <!--<link href='http://fonts.useso.com/css?family=Montserrat:700' rel='stylesheet' type='text/css'> -->
    <!--<link href='http://fonts.useso.com/css?family=Open+Sans:400' rel='stylesheet' type='text/css'>-->
    <!--<link href='http://fonts.useso.com/css?family=Open+Sans:600' rel='stylesheet' type='text/css'>-->
    <![endif]-->

    <!-- jQuery | Load our jQuery, with an alternative source fallback to a local version if request is unavailable -->
    <script src="/js/jquery-1.11.1.min.js"></script>
    <script>window.jQuery || document.write('<script src="js/jquery-1.11.1.min.js"><\/script>')</script>

    <!-- Load these in the <head> for quicker IE8+ load times -->
    <!-- HTML5 shim and Respond.js IE8 support of HTML5 elements and media queries -->
    <!--[if lt IE 9]>
    <script src="/js/html5shiv.min.js"></script>
    <script src="/js/respond.min.js"></script>
    <![endif]-->










  
  
  <link rel="alternate" type="application/atom+xml" title="Atom 0.3" href="atom.xml">
  
  

  
  <style>.col-md-8.col-md-offset-2.opening-statement img{display:none;}</style>
</head>

<!--
<body class="post-template">
-->
<body id="index" class="lightnav animsition">

      <!-- ============================ Off-canvas navigation =========================== -->

    <div class="sb-slidebar sb-right sb-style-overlay sb-momentum-scrolling">
        <div class="sb-close" aria-label="Close Menu" aria-hidden="true">
            <img src="/img/close.png" alt="Close"/>
        </div>
        <!-- Lists in Slidebars -->
        <ul class="sb-menu">
            <li><a href="/" class="animsition-link" title="Home">Home</a></li>
            <li><a href="/archives" class="animsition-link" title="archive">archives</a></li>
            <!-- Dropdown Menu -->
			 
            <li>
                <a class="sb-toggle-submenu">Works<span class="sb-caret"></span></a>
                <ul class="sb-submenu">
                    
                        <li><a href="http://www.gome.com.cn" target="_BLANK" class="animsition-link">Gome</a></li>
                    
                        <li><a href="http://www.yintai.com" target="_BLANK" class="animsition-link">YinTai</a></li>
                    
                </ul>
            </li>
            
            
            
            <li>
                <a class="sb-toggle-submenu">Links<span class="sb-caret"></span></a>
                <ul class="sb-submenu">
                    
                    <li><a href="http://www.jianshu.com/users/211925b3ca7c/latest_articles" class="animsition-link">吴白</a></li>
                    
                    <li><a href="http://www.jianshu.com/users/19f4bf67c705/latest_articles" class="animsition-link">吴禅</a></li>
                    
                </ul>
            </li>
            
        </ul>
        <!-- Lists in Slidebars -->
        <ul class="sb-menu secondary">
            <li><a href="/about" class="animsition-link" title="about">About</a></li>
            <li><a href="/atom.xml" class="animsition-link" title="rss">RSS</a></li>
        </ul>
    </div>
    
    <!-- ============================ END Off-canvas navigation =========================== -->

    <!-- ============================ #sb-site Main Page Wrapper =========================== -->

    <div id="sb-site">
        <!-- #sb-site - All page content should be contained within this id, except the off-canvas navigation itself -->

        <!-- ============================ Header & Logo bar =========================== -->

        <div id="navigation" class="navbar navbar-fixed-top">
            <div class="navbar-inner">
                <div class="container">
                    <!-- Nav logo -->
                    <div class="logo">
                        <a href="/" title="Logo" class="animsition-link">
                         <img src="/img/logo.png" alt="Logo" width="35px;"/> 
                        </a>
                    </div>
                    <!-- // Nav logo -->
                    <!-- Info-bar -->
                    <nav>
                        <ul class="nav">
                            <li><a href="/" class="animsition-link">流城</a></li>
                            <li class="nolink"><span>Always </span>Creative.</li>
                            
                            <li><a href="https://github.com/" title="Github" target="_blank"><i class="icon-github"></i></a></li>
                            
                            
                            <li><a href="https://twitter.com/" title="Twitter" target="_blank"><i class="icon-twitter"></i></a></li>
                            
                            
                            <li><a href="https://www.facebook.com/" title="Facebook" target="_blank"><i class="icon-facebook"></i></a></li>
                            
                            
                            <li><a href="https://google.com/" title="Google-Plus" target="_blank"><i class="icon-google-plus"></i></a></li>
                            
                            
                            <li><a href="http://weibo.com/" title="Sina-Weibo" target="_blank"><i class="icon-sina-weibo"></i></a></li>
                            
                            <li class="nolink"><span>Welcome!</span></li>
                        </ul>
                    </nav>
                    <!--// Info-bar -->
                </div>
                <!-- // .container -->
                <div class="learnmore sb-toggle-right">More</div>
                <button type="button" class="navbar-toggle menu-icon sb-toggle-right" title="More">
                <span class="sr-only">Toggle navigation</span>
                <span class="icon-bar before"></span>
                <span class="icon-bar main"></span>
                <span class="icon-bar after"></span>
                </button>
            </div>
            <!-- // .navbar-inner -->
        </div>

        <!-- ============================ Header & Logo bar =========================== -->


      
<section id="intro">
    <div class="container">
        <div class="row col-md-offset-2">
            <div class="col-md-8">
    			<span class="post-meta">
      <time datetime="2015-06-30T16:48:11.000Z" itemprop="datePublished">
          2015-07-01
      </time>
    
    
    | 
    <a href='/tags/technology/'>technology</a>
    
    
</span>
                <h1>谈谈C的性能特点</h1>
            </div>
        </div>
        <!--<div class="col-md-8 col-md-offset-2">-->
        <div class="col-md-offset-2">
      		<p>C&#x8BED;&#x8A00;&#x662F;&#x4E00;&#x79CD;&#x547D;&#x4EE4;&#x5F0F;&#x8BED;&#x8A00;&#xFF08;&#x53C8;&#x79F0;&#x5F3A;&#x5236;&#x5F0F;&#x8BED;&#x8A00;&#xFF0C;&#x901A;&#x8FC7;&#x6307;&#x660E;&#x4E00;&#x7CFB;&#x5217;&#x53EF;&#x6267;&#x884C;&#x7684;&#x8FD0;&#x7B97;&#x53CA;&#x8FD0;&#x7B97;&#x7684;&#x6B21;&#x5E8F;&#x6765;&#x63CF;&#x8FF0;&#x8BA1;&#x7B97;&#x8FC7;&#x7A0B;&#x7684;&#x8BED;&#x8A00;&#xFF09;&#xFF0C;&#x751F;&#x4E8E;1972&#x5E74;&#x7684;&#x8D1D;&#x5C14;&#x5B9E;&#x9A8C;&#x5BA4;&#x3002;&#x5E73;&#x65F6;&#x6211;&#x4EEC;&#x7528;&#x7684;&#x5927;&#x591A;&#x6570;&#x8BED;&#x8A00;&#xFF08;&#x6BD4;&#x5982;&#xFF0C;C,C++,Java,C#,Python&#x7B49;&#xFF09;&#x90FD;&#x662F;&#x547D;&#x4EE4;&#x5F0F;&#x8BED;&#x8A00;&#xFF0C;&#x4E0E;&#x5B83;&#x76F8;&#x5BF9;&#x7684;&#x662F;&#x51FD;&#x6570;&#x5F0F;&#x8BED;&#x8A00;(functional language)&#xFF0C;&#x5982;Haskell,Lisp&#x3002;&#x51FD;&#x6570;&#x5F0F;&#x8BED;&#x8A00;&#x66F4;&#x50CF;&#x6570;&#x5B66;&#xFF0C;&#x547D;&#x4EE4;&#x5F0F;&#x8BED;&#x8A00;&#x66F4;&#x63A5;&#x8FD1;&#x4EBA;&#x7684;&#x601D;&#x7EF4;&#x3002;</p>
<h4 id="C&#x8BED;&#x8A00;&#x7684;&#x7279;&#x6027;"><a href="#C&#x8BED;&#x8A00;&#x7684;&#x7279;&#x6027;" class="headerlink" title="C&#x8BED;&#x8A00;&#x7684;&#x7279;&#x6027;"></a>C&#x8BED;&#x8A00;&#x7684;&#x7279;&#x6027;</h4><p>C&#x8BED;&#x8A00;&#x7684;&#x5178;&#x578B;&#x7279;&#x5F81;&#x662F;&#x7F16;&#x8BD1;&#x578B;&#x8BED;&#x8A00;(compiled language)&#xFF08;&#x76F8;&#x5BF9;&#x4E8E;&#x89E3;&#x91CA;&#x578B;&#x8BED;&#x8A00;&#x6765;&#x8BF4;&#xFF09;&#x3001;&#x547D;&#x4EE4;&#x5F0F;&#x7684;&#x3001;&#x4EBA;&#x5DE5;&#x7BA1;&#x7406;&#x5185;&#x5B58; &#x3002;&#x5BF9;&#x4E8E;&#x7F16;&#x8BD1;&#x578B;&#x8BED;&#x8A00;&#xFF0C;&#x7A0B;&#x5E8F;&#x5728;&#x6267;&#x884C;&#x4E4B;&#x524D;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x4E13;&#x95E8;&#x7684;&#x7F16;&#x8BD1;&#x8FC7;&#x7A0B;&#xFF0C;&#x628A;&#x7A0B;&#x5E8F;&#x7F16;&#x8BD1;&#x6210;&#x4E3A;&#x673A;&#x5668;&#x8BED;&#x8A00;&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x8FD0;&#x884C;&#x65F6;&#x4E0D;&#x9700;&#x8981;&#x91CD;&#x65B0;&#x7FFB;&#x8BD1;&#xFF0C;&#x76F4;&#x63A5;&#x8FD0;&#x884C;&#x7F16;&#x8BD1;&#x7684;&#x7ED3;&#x679C;&#x5C31;&#x884C;&#x4E86;&#xFF0C;<strong>&#x56E0;&#x6B64;&#x6548;&#x7387;&#x9AD8;</strong>&#x3002; &#x4EE5;&#x6B64;&#x76F8;&#x5BF9;&#xFF0C;&#x89E3;&#x91CA;&#x578B;&#x8BED;&#x8A00;&#x7A0B;&#x5E8F;&#x4E0D;&#x9700;&#x8981;&#x7F16;&#x8BD1;&#xFF0C;&#x7A0B;&#x5E8F;&#x5728;&#x8FD0;&#x884C;&#x65F6;&#x624D;&#x7FFB;&#x8BD1;&#x6210;&#x673A;&#x5668;&#x8BED;&#x8A00;&#xFF0C;&#x6BCF;&#x6267;&#x884C;&#x4E00;&#x6B21;&#x90FD;&#x8981;&#x7FFB;&#x8BD1;&#x4E00;&#x6B21;&#xFF0C;&#x56E0;&#x6B64;<strong>&#x6548;&#x7387;&#x6BD4;&#x8F83;&#x4F4E;</strong>&#x3002;&#x7531;&#x6B64;&#xFF0C;&#x5F53;&#x6D89;&#x53CA;&#x5230;&#x901F;&#x5EA6;&#xFF0C;&#x5185;&#x5B58;&#xFF0C;&#x4F4E;&#x5C42;&#x6B21;&#x7279;&#x6027;(low-level features)&#x5982;&#xFF1A;&#x79FB;&#x52A8;stack pointer&#x7B49;&#x5E38;&#x4F1A;&#x4F7F;&#x7528;C&#x8BED;&#x8A00;&#x3002;</p>
<p>&#x4ECE;&#x5185;&#x5B58;&#x7684;&#x89D2;&#x5EA6;&#x601D;&#x8003;C&#x8BED;&#x8A00;&#xFF0C;&#x76F8;&#x5BF9;&#x4E8E;&#x5176;&#x4ED6;&#x8BED;&#x8A00;&#xFF0C;<strong>&#x6C47;&#x7F16;&#x8BED;&#x8A00;&#x76F4;&#x63A5;&#x64CD;&#x4F5C;&#x5185;&#x5B58;&#xFF1B;C&#x3001;C++&#x8BBF;&#x95EE;&#x5185;&#x5B58;&#xFF1B;Java,C#,Scheme/LISP,ML&#x4F7F;&#x7528;&#x7684;&#x662F;&#x5185;&#x5B58;&#x81EA;&#x52A8;&#x7BA1;&#x7406;&#x673A;&#x5236;</strong>&#x3002; C&#x8BED;&#x8A00;&#x901A;&#x8FC7;&#x5806;(heap)&#x548C;&#x6808;&#xFF08;stack&#xFF09;&#x8BBF;&#x95EE;&#x7684;&#x5185;&#x5B58;&#xFF0C;C&#x51FD;&#x6570;&#x5C06;&#x4F1A;&#x5206;&#x914D;&#x5230;&#x68E7;&#x4E2D;&#xFF0C;&#x51FD;&#x6570;&#x5728;&#x88AB;&#x8C03;&#x7528;&#x65F6;&#x8FDB;&#x68E7;(pushed on to stack)&#xFF0C; &#x51FD;&#x6570;&#x5728;&#x8FD4;&#x56DE;&#x65F6;&#x51FA;&#x68E7;(popefd off the stack)&#xFF0C;&#x51FD;&#x6570;&#x80FD;&#x8BBF;&#x95EE;&#x5F53;&#x524D;&#x68E7;&#x9876;&#x90E8;&#x4EE5;&#x4E0B;&#x7684;&#x6240;&#x6709;&#x5185;&#x5B58;&#xFF1B;&#x5806;&#x662F;&#x4E00;&#x5757;&#x513F;&#x7528;&#x4E8E;&#x52A8;&#x6001;&#x5185;&#x5B58;&#x5206;&#x914D;&#x7684;&#x5185;&#x5B58;&#x533A;&#x57DF;&#xFF0C;&#x53EF;&#x4EE5;&#x628A;&#x5B83;&#x60F3;&#x50CF;&#x79F0;&#x4E3A;&#x4E00;&#x4E2A;&#x5DE8;&#x5927;&#x7684;&#x6570;&#x7EC4; &#xFF0C;&#x901A;&#x8FC7;&#x6307;&#x9488;(pointer)&#x6765;&#x8BBF;&#x95EE;&#xFF0C;&#x5982;&#x679C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5141;&#x8BB8;&#xFF0C;&#x6574;&#x4E2A;&#x7A0B;&#x5E8F;&#x90FD;&#x80FD;&#x8BBF;&#x95EE;&#x5806;&#x3002;C&#x8BED;&#x8A00;&#x4EBA;&#x5DE5;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x76EE;&#x7684;&#x662F;&#x5141;&#x8BB8;&#x7A0B;&#x5E8F;&#x80FD;&#x591F;&#x5206;&#x914D;&#x5185;&#x5B58;&#x7528;&#x4E8E;&#x5F53;&#x524D;&#x7684;&#x4F7F;&#x7528; &#xFF1B;&#x5F53;&#x7A0B;&#x5E8F;&#x6267;&#x884C;&#x5B8C;&#x540E;&#xFF0C;&#x80FD;&#x591F;&#x91CA;&#x653E;&#x5185;&#x5B58;&#xFF0C;&#x7528;&#x4E8E;&#x91CD;&#x65B0;&#x5206;&#x914D; &#xFF0C;C&#x8BED;&#x8A00;&#x7684;&#x6807;&#x51C6;&#x7C7B;&#x5E93;&#x4E2D;&#x6709;malloc&#x548C;free&#x4E24;&#x4E2A;&#x51FD;&#x6570;&#x652F;&#x6301;&#x5185;&#x5B58;&#x7BA1;&#x7406; &#x3002;&#x4ECE;&#x5185;&#x5B58;&#x7684;&#x5C42;&#x9762;&#xFF0C;C&#x8BED;&#x8A00;&#x867D;&#x7136;&#x4F7F;&#x7528;&#x8D77;&#x6765;&#x66F4;&#x590D;&#x6742;&#x4E9B;&#xFF0C;&#x4F46;&#x5728;&#x53EF;&#x64CD;&#x4F5C;&#x6027;&#x4E0A;&#x66F4;&#x597D;&#x4E00;&#x4E9B;&#xFF0C;&#x6BD5;&#x7ADF;&#x81EA;&#x52A8;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#xFF0C;&#x5185;&#x5B58;&#x7684;&#x91CA;&#x653E;&#x4E0D;&#x662F;&#x7ACB;&#x5373;&#x7684;&#x3002;</p>
<p>C&#x8BED;&#x8A00;&#x6BD4;&#x8D77;&#x5176;&#x4ED6;&#x7684;&#x9AD8;&#x7EA7;&#x8BED;&#x8A00;&#x6765;&#x8BF4;&#xFF0C;&#x66F4;&#x63A5;&#x8FD1;&#x8BA1;&#x7B97;&#x673A;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x5B83;&#x4ECB;&#x4E8E;&#x9AD8;&#x7EA7;&#x8BED;&#x8A00;&#x548C;&#x6C47;&#x7F16;&#x8BED;&#x8A00;&#x4E4B;&#x95F4;&#xFF0C;&#x901A;&#x5E38;&#x6765;&#x8BF4;&#x6BD4;&#x5176;&#x4ED6;&#x9AD8;&#x7EA7;&#x8BED;&#x8A00;&#x6267;&#x884C;&#x6548;&#x7387;&#x66F4;&#x9AD8;&#x4E00;&#x70B9;&#x3002;&#x5F53;&#x7136;&#xFF0C;C&#x8BED;&#x8A00;&#x7684;&#x51FD;&#x6570;&#x5316;&#x7279;&#x70B9;&#xFF08;&#x5373;&#x6240;&#x6709;C&#x7A0B;&#x5E8F;&#x90FD;&#x662F;&#x7531;&#x51FD;&#x6570;&#x6784;&#x6210;&#xFF09;&#x548C;&#x7075;&#x6D3B;&#x7684;&#x8BED;&#x6CD5;&#x4E5F;&#x662F;&#x5438;&#x5F15;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x8005;&#x7684;&#x5730;&#x65B9;&#x3002;</p>
<h4 id="C&#x8BED;&#x8A00;&#x7684;&#x4F18;&#x52BF;"><a href="#C&#x8BED;&#x8A00;&#x7684;&#x4F18;&#x52BF;" class="headerlink" title="C&#x8BED;&#x8A00;&#x7684;&#x4F18;&#x52BF;"></a>C&#x8BED;&#x8A00;&#x7684;&#x4F18;&#x52BF;</h4><p>C&#x8BED;&#x8A00;&#x4E00;&#x5171;&#x53EA;&#x6709;32&#x4E2A;&#x5173;&#x952E;&#x5B57;&#xFF0C;9&#x79CD;&#x63A7;&#x5236;&#x8BED;&#x53E5;&#xFF0C;&#x7A0B;&#x5E8F;&#x4E66;&#x5199;&#x5F62;&#x5F0F;&#x81EA;&#x7531;&#xFF0C;&#x533A;&#x5206;&#x5927;&#x5C0F;&#x5199;&#x3002;&#x628A;&#x9AD8;&#x7EA7;&#x8BED;&#x8A00;&#x7684;&#x57FA;&#x672C;&#x7ED3;&#x6784;&#x548C;&#x8BED;&#x53E5;&#x4E0E;&#x4F4E;&#x7EA7;&#x8BED;&#x8A00;&#x7684;&#x5B9E;&#x7528;&#x6027;&#x7ED3;&#x5408;&#x8D77;&#x6765;&#x3002;C&#x8BED;&#x8A00;&#x5141;&#x8BB8;&#x76F4;&#x63A5;&#x8BBF;&#x95EE;&#x7269;&#x7406;&#x5730;&#x5740;&#xFF0C;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x5BF9;&#x786C;&#x4EF6;&#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#xFF0C;&#x56E0;&#x6B64;&#x5B83;&#x65E2;&#x5177;&#x6709;&#x9AD8;&#x7EA7;&#x8BED;&#x8A00;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x53C8;&#x5177;&#x6709;&#x4F4E;&#x7EA7;&#x8BED;&#x8A00;&#x7684;&#x8BB8;&#x591A;&#x529F;&#x80FD;&#xFF0C;C&#x8BED;&#x8A00;&#x53EF;&#x4EE5;&#x50CF;&#x6C47;&#x7F16;&#x8BED;&#x8A00;&#x4E00;&#x6837;&#x5BF9;<strong>&#x4F4D;&#x3001;&#x5B57;&#x8282;&#x548C;&#x5730;&#x5740;</strong>&#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#xFF0C;&#x800C;&#x8FD9;&#x4E09;&#x8005;&#x662F;&#x8BA1;&#x7B97;&#x673A;&#x6700;&#x57FA;&#x672C;&#x7684;&#x5DE5;&#x4F5C;&#x5355;&#x5143;&#xFF0C;&#x53EF;&#x7528;&#x6765;&#x5199;&#x7CFB;&#x7EDF;&#x8F6F;&#x4EF6;&#xFF0C;&#x53C8;&#x53EF;&#x7528;&#x6765;&#x5F00;&#x53D1;&#x5E94;&#x7528;&#x8F6F;&#x4EF6;&#xFF0C;&#x5DF2;&#x6210;&#x4E3A;&#x4E00;&#x79CD;&#x901A;&#x7528;&#x7A0B;&#x5E8F;&#x8BBE;&#x8BA1;&#x8BED;&#x8A00;&#x3002;&#x53E6;&#x5916;C&#x8BED;&#x8A00;&#x5177;&#x6709;&#x5F3A;&#x5927;&#x7684;&#x56FE;&#x5F62;&#x529F;&#x80FD;&#xFF0C;&#x652F;&#x6301;&#x591A;&#x79CD;&#x663E;&#x793A;&#x5668;&#x548C;&#x9A71;&#x52A8;&#x5668;&#x3002;&#x4E14;&#x8BA1;&#x7B97;&#x529F;&#x80FD;&#x3001;&#x903B;&#x8F91;&#x5224;&#x65AD;&#x529F;&#x80FD;&#x5F3A;&#x5927;&#x3002;    </p>
<p>C&#x8BED;&#x8A00;&#x7684;&#x8FD0;&#x7B97;&#x7B26;&#x5305;&#x542B;&#x7684;&#x8303;&#x56F4;&#x5F88;&#x5E7F;&#x6CDB;&#xFF0C;&#x5171;&#x6709;34&#x79CD;&#x8FD0;&#x7B97;&#x7B26;&#x3002;C&#x8BED;&#x8A00;&#x628A;&#x62EC;&#x53F7;&#x3001;&#x8D4B;&#x503C;&#x3001;&#x5F3A;&#x5236;&#x7C7B;&#x578B;&#x8F6C;&#x6362;&#x7B49;&#x90FD;&#x4F5C;&#x4E3A;&#x8FD0;&#x7B97;&#x7B26;&#x5904;&#x7406;&#x3002;&#x4ECE;&#x800C;&#x4F7F;C&#x8BED;&#x8A00;&#x7684;&#x8FD0;&#x7B97;&#x7C7B;&#x578B;&#x6781;&#x5176;&#x4E30;&#x5BCC;&#xFF0C;&#x8868;&#x8FBE;&#x5F0F;&#x7C7B;&#x578B;&#x591A;&#x6837;&#x5316;&#x3002;&#x7075;&#x6D3B;&#x4F7F;&#x7528;&#x5404;&#x79CD;&#x8FD0;&#x7B97;&#x7B26;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x5728;&#x5176;&#x5B83;&#x9AD8;&#x7EA7;&#x8BED;&#x8A00;&#x4E2D;&#x96BE;&#x4EE5;&#x5B9E;&#x73B0;&#x7684;&#x8FD0;&#x7B97;&#x3002; C&#x8BED;&#x8A00;&#x7684;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x6709;&#xFF1A;&#x6574;&#x578B;&#x3001;&#x5B9E;&#x578B;&#x3001;&#x5B57;&#x7B26;&#x578B;&#x3001;&#x6570;&#x7EC4;&#x7C7B;&#x578B;&#x3001;&#x6307;&#x9488;&#x7C7B;&#x578B;&#x3001;&#x7ED3;&#x6784;&#x4F53;&#x7C7B;&#x578B;&#x3001;&#x5171;&#x7528;&#x4F53;&#x7C7B;&#x578B;&#x7B49;&#x3002;&#x80FD;&#x7528;&#x6765;&#x5B9E;&#x73B0;&#x5404;&#x79CD;&#x590D;&#x6742;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x7684;&#x8FD0;&#x7B97;&#x3002;&#x5E76;&#x5F15;&#x5165;&#x4E86;&#x6307;&#x9488;&#x6982;&#x5FF5;&#xFF0C;&#x4F7F;&#x7A0B;&#x5E8F;&#x6548;&#x7387;&#x66F4;&#x9AD8;&#x3002;    </p>
<p>C&#x8BED;&#x8A00;&#x751F;&#x6210;&#x76EE;&#x6807;&#x4EE3;&#x7801;&#x8D28;&#x91CF;&#x9AD8;&#xFF0C;&#x7A0B;&#x5E8F;&#x6267;&#x884C;&#x6548;&#x7387;&#x9AD8;&#xFF0C;C&#x8BED;&#x8A00;&#x63CF;&#x8FF0;&#x95EE;&#x9898;&#x6BD4;&#x6C47;&#x7F16;&#x8BED;&#x8A00;&#x8FC5;&#x901F;&#xFF0C;&#x5DE5;&#x4F5C;&#x91CF;&#x5C0F;&#x3001;&#x53EF;&#x8BFB;&#x6027;&#x597D;&#xFF0C;&#x6613;&#x4E8E;&#x8C03;&#x8BD5;&#x3001;&#x4FEE;&#x6539;&#x548C;&#x79FB;&#x690D;&#xFF0C;&#x800C;&#x4EE3;&#x7801;&#x8D28;&#x91CF;&#x4E0E;&#x6C47;&#x7F16;&#x8BED;&#x8A00;&#x76F8;&#x5F53;&#x3002;C&#x8BED;&#x8A00;&#x4E00;&#x822C;&#x53EA;&#x6BD4;&#x6C47;&#x7F16;&#x7A0B;&#x5E8F;&#x751F;&#x6210;&#x7684;&#x76EE;&#x6807;&#x4EE3;&#x7801;&#x6548;&#x7387;&#x4F4E;10%&#xFF5E;20%&#x3002;&#x53EF;&#x79FB;&#x690D;&#x6027;&#x597D;&#xFF0C;C&#x8BED;&#x8A00;&#x5728;&#x4E0D;&#x540C;&#x673A;&#x5668;&#x4E0A;&#x7684;C&#x7F16;&#x8BD1;&#x7A0B;&#x5E8F;&#xFF0C;86%&#x7684;&#x4EE3;&#x7801;&#x662F;&#x516C;&#x5171;&#x7684;&#xFF0C;&#x6240;&#x4EE5;C&#x8BED;&#x8A00;&#x7684;&#x7F16;&#x8BD1;&#x7A0B;&#x5E8F;&#x4FBF;&#x4E8E;&#x79FB;&#x690D;&#x3002;&#x5728;&#x4E00;&#x4E2A;&#x73AF;&#x5883;&#x4E0A;&#x7528;C&#x8BED;&#x8A00;&#x7F16;&#x5199;&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x4E0D;&#x6539;&#x52A8;&#x6216;&#x7A0D;&#x52A0;&#x6539;&#x52A8;&#xFF0C;&#x5C31;&#x53EF;&#x79FB;&#x690D;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x5B8C;&#x5168;&#x4E0D;&#x540C;&#x7684;&#x73AF;&#x5883;&#x4E2D;&#x8FD0;&#x884C;&#x3002;    </p>
<h4 id="&#x5F53;&#x524D;&#x65B0;&#x53D1;&#x660E;&#x7684;&#x8BED;&#x8A00;Swift&#x7684;&#x6BD4;&#x8F83;"><a href="#&#x5F53;&#x524D;&#x65B0;&#x53D1;&#x660E;&#x7684;&#x8BED;&#x8A00;Swift&#x7684;&#x6BD4;&#x8F83;" class="headerlink" title="&#x5F53;&#x524D;&#x65B0;&#x53D1;&#x660E;&#x7684;&#x8BED;&#x8A00;Swift&#x7684;&#x6BD4;&#x8F83;"></a>&#x5F53;&#x524D;&#x65B0;&#x53D1;&#x660E;&#x7684;&#x8BED;&#x8A00;Swift&#x7684;&#x6BD4;&#x8F83;</h4><p>Swift&#x5305;&#x542B;&#x4E86;&#x5F88;&#x591A;&#x73B0;&#x4EE3;&#x8BED;&#x8A00;&#x7279;&#x6027;&#x5C24;&#x5176;&#x662F;&#x4ECE;&#x4E00;&#x4E9B;&#x811A;&#x672C;&#x8BED;&#x8A00;&#x5982;Javascript/Ruby&#x4E2D;&#x6C72;&#x53D6;&#x4E86;&#x8425;&#x517B;&#xFF0C;&#x6B64;&#x5916;&#x82F9;&#x679C;&#x53D1;&#x5E03;Swift&#x65F6;&#xFF0C;&#x4F7F;&#x7528;&#x7279;&#x522B;&#x9009;&#x7528;&#x7684;&#x4E00;&#x4E9B;&#x4F8B;&#x5B50;&#x6765;&#x5BA3;&#x79F0;Swift&#x6027;&#x80FD;&#x5BF9;&#x4E8E;Ojbective C&#x7684;&#x5927;&#x5E45;&#x63D0;&#x5347;&#xFF08;40~50%&#xFF09;&#xFF0C;&#x5982;&#x590D;&#x6742;&#x5BF9;&#x8C61;&#x6392;&#x5E8F;&#x7B49;&#x3002;&#x4F46;&#x662F;&#x5F00;&#x53D1;&#x8005;&#x5B9E;&#x9645;&#x6D4B;&#x8BD5;&#x51FA;&#x6765;&#x7684;&#x60C5;&#x51B5;&#x5374;&#x76F8;&#x53CD;&#x3002;&#x5B9E;&#x9645;&#x6570;&#x636E;&#x663E;&#x793A;&#xFF0C;Swift&#x5728;&#x7B80;&#x5355;&#x5FAA;&#x73AF;&#x3001;&#x9012;&#x589E;&#x3001;&#x8D4B;&#x503C;&#x3001;&#x6570;&#x7EC4;&#x6269;&#x5C55;&#x3001;&#x5B57;&#x7B26;&#x4E32;&#x62FC;&#x63A5;&#x4E0A;&#x6027;&#x80FD;&#x8FDC;&#x4E0D;&#x5982;Objective C&#x3002;&#x53EF;&#x80FD;&#x7684;&#x4E00;&#x4E2A;&#x89E3;&#x91CA;&#x662F;Swift&#x4F7F;&#x7528;&#x7C7B;classes&#xFF0C;&#x603B;&#x5728;&#x6267;&#x884C;ARC&#xFF08;Auto Referrence Count&#xFF09;&#xFF0C;&#x800C;Objective C&#x5219;&#x66F4;&#x591A;&#x4F7F;&#x7528;C&#x98CE;&#x683C;&#x7684;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x3002;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1170656-8ef4897116759a68.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="C"></p>

            <div class="clearfix"></div>
            <hr class="nogutter">
        </div>


        <nav class="pagination" role="pagination">


<div class="ds-share flat" data-thread-key="2015/07/01/谈谈C的性能特点/" data-title="谈谈C的性能特点" data-images="https://avatars0.githubusercontent.com/u/10378248?v=3&s=460" data-content="谈谈C的性能特点 是最近写的文章，希望能帮到您！" data-url="https://dangdangfeng.github.io/2015/07/01/谈谈C的性能特点/">
    <div class="ds-share-inline">
      <ul  class="ds-share-icons-16">
        
        <li data-toggle="ds-share-icons-more"><a class="ds-more" href="javascript:void(0);">分享到：</a></li>
        <li><a class="ds-weibo" href="javascript:void(0);" data-service="weibo">微博</a></li>
        <li><a class="ds-qzone" href="javascript:void(0);" data-service="qzone">QQ空间</a></li>
        <li><a class="ds-qqt" href="javascript:void(0);" data-service="qqt">腾讯微博</a></li>
        <li><a class="ds-wechat" href="javascript:void(0);" data-service="wechat">微信</a></li>
        
      </ul>
      <div class="ds-share-icons-more">
      </div>
    </div>
 </div>

 <br/>

    
    <a class="pull-left" href="/2015/08/21/如何优雅的谈论Hybrid-App/" style="float: left;">
        ← 如何幽雅的谈论Hybrid App
    </a>
    
    
    <a class="pull-right" href="/2015/05/13/iOS9之后我们需要关注的事情/">
        iOS9之后我们需要关注的事情 →
    </a>
    

    
</nav>



        
        <div class="duoshuo">


<div class="ds-thread" data-thread-key="2015/07/01/谈谈C的性能特点/" data-title="谈谈C的性能特点" data-url="https://dangdangfeng.github.io/2015/07/01/谈谈C的性能特点/"></div>



<script type="text/javascript">
var duoshuoQuery = {short_name:"deter"};
(function() {
	var ds = document.createElement('script');
	ds.type = 'text/javascript';ds.async = true;
	ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
	ds.charset = 'UTF-8';
	(document.getElementsByTagName('head')[0] 
	 || document.getElementsByTagName('body')[0]).appendChild(ds);
})();
</script>
</div>
    </div>
</section>


      
<!-- ============================ Footer =========================== -->

<footer>
    <div class="container">
            <div class="copy">
                <p>
                    &copy; 2010<script>new Date().getFullYear()>2010&&document.write("-"+new Date().getFullYear());</script>, Content By 吴白. All Rights Reserved.
                </p>
                <p>Theme By <a href="//go.kieran.top" style="color: #767D84">Kieran</a></p>
            </div>
            <div class="social">
                <ul>
                    
                    <li><a href="https://github.com/" title="Github" target="_blank"><i class="icon-github"></i></a>&nbsp;</li>
                    
                    
                    <li><a href="https://twitter.com/" title="Twitter" target="_blank"><i class="icon-twitter"></i></a>&nbsp;</li>
                    
                    
                    <li><a href="https://www.facebook.com/" title="Facebook" target="_blank"><i class="icon-facebook"></i></a>&nbsp;</li>
                    
                    
                    <li><a href="https://google.com/" title="Google-Plus" target="_blank"><i class="icon-google-plus"></i></a>&nbsp;</li>
                    
                    
                    <li><a href="http://weibo.com/" title="Sina-Weibo" target="_blank"><i class="icon-sina-weibo"></i></a>&nbsp;</li>
                    
                </ul>
            </div>
            <div class="clearfix"> </div>
        </div>
</footer>

<!-- ============================ END Footer =========================== -->
      <!-- Load our scripts -->
        
<!-- Resizable 'on-demand' full-height hero -->
<script type="text/javascript">
    
    var resizeHero = function () {
        var hero = $(".cover,.heightblock"),
            window1 = $(window);
        hero.css({
            "height": window1.height()
        });
    };
    
    resizeHero();
    
    $(window).resize(function () {
        resizeHero();
    });
</script>
<script src="/js/plugins.min.js"></script><!-- Bootstrap core and concatenated plugins always load here -->
<script src="/js/jquery.flexslider-min.js"></script><!-- Flexslider plugin -->
<script src="/js/scripts.js"></script><!-- Theme scripts -->

<!-- Initiate flexslider plugin -->
<script type="text/javascript">
    $(document).ready(function($) {
      $('.flexslider').flexslider({
        animation: "fade",
        prevText: "",
        nextText: "",
        directionNav: true
      });
    });
</script>

</body>
</html>
