<!DOCTYPE html>
<!--[if lte IE 8 ]>
<html class="ie" xmlns="http://www.w3.org/1999/xhtml" xml:lang="en-US" lang="en-US">
<![endif]-->
<!--[if (gte IE 9)|!(IE)]><!-->
<!--
***************  *      *     *
      8          *    *       *
      8          *  *         *
      8          **           *
      8          *  *         *
      8          *    *       *
      8          *      *     *
      8          *        *   ***********    -----Theme By Kieran(http://go.kieran.top)
-->
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en-US" lang="en-US">
<!--<![endif]-->

<head>
  <title>从0开始看一个项目 | 流城</title>
  <!-- Meta data -->
    <meta http-equiv="Content-Type" content="text/html" charset="UTF-8" >
    <meta http-equiv="X-UA-Compatible" content="IE=edge"/>
    <meta name="viewport" content="width=device-width, initial-scale=1.0" />
    <meta name="generator" content="流城">
    <meta name="author" content="吴白">
    <meta name="description" content="" />
    <meta name="keywords" content="" />

    <!-- Favicon, (keep icon in root folder) -->
    <link rel="Shortcut Icon" href="/img/favicon.ico" type="image/ico">

    <link rel="alternate" href="/atom.xml" title="流城" type="application/atom+xml">
    <link rel="stylesheet" href="/css/all.css" media="screen" type="text/css">
	
    <link rel="stylesheet" href="/highlightjs/vs.css" type="text/css">
    
    

    <!-- Custom stylesheet, (add custom styles here, always load last) -->
    <!-- Load our stylesheet for IE8 -->
    <!--[if IE 8]>
    <link rel="stylesheet" type="text/css" href="/css/ie8.css" />
    <![endif]-->

    <!-- Google Webfonts (Monserrat 400/700, Open Sans 400/600) -->
    <!--<link href='//fonts.useso.com/css?family=Montserrat:400,700' rel='stylesheet' type='text/css'>-->
    <!--<link href='//fonts.useso.com/css?family=Open+Sans:400,600' rel='stylesheet' type='text/css'>-->

    <!-- Load our fonts individually if IE8+, to avoid faux bold & italic rendering -->
    <!--[if IE]>
    <!--<link href='http://fonts.useso.com/css?family=Montserrat:400' rel='stylesheet' type='text/css'> -->
    <!--<link href='http://fonts.useso.com/css?family=Montserrat:700' rel='stylesheet' type='text/css'> -->
    <!--<link href='http://fonts.useso.com/css?family=Open+Sans:400' rel='stylesheet' type='text/css'>-->
    <!--<link href='http://fonts.useso.com/css?family=Open+Sans:600' rel='stylesheet' type='text/css'>-->
    <![endif]-->

    <!-- jQuery | Load our jQuery, with an alternative source fallback to a local version if request is unavailable -->
    <script src="/js/jquery-1.11.1.min.js"></script>
    <script>window.jQuery || document.write('<script src="js/jquery-1.11.1.min.js"><\/script>')</script>

    <!-- Load these in the <head> for quicker IE8+ load times -->
    <!-- HTML5 shim and Respond.js IE8 support of HTML5 elements and media queries -->
    <!--[if lt IE 9]>
    <script src="/js/html5shiv.min.js"></script>
    <script src="/js/respond.min.js"></script>
    <![endif]-->










  
  
  <link rel="alternate" type="application/atom+xml" title="Atom 0.3" href="atom.xml">
  
  

  
  <style>.col-md-8.col-md-offset-2.opening-statement img{display:none;}</style>
</head>

<!--
<body class="post-template">
-->
<body id="index" class="lightnav animsition">

      <!-- ============================ Off-canvas navigation =========================== -->

    <div class="sb-slidebar sb-right sb-style-overlay sb-momentum-scrolling">
        <div class="sb-close" aria-label="Close Menu" aria-hidden="true">
            <img src="/img/close.png" alt="Close"/>
        </div>
        <!-- Lists in Slidebars -->
        <ul class="sb-menu">
            <li><a href="/" class="animsition-link" title="Home">Home</a></li>
            <li><a href="/archives" class="animsition-link" title="archive">archives</a></li>
            <!-- Dropdown Menu -->
			 
            <li>
                <a class="sb-toggle-submenu">Works<span class="sb-caret"></span></a>
                <ul class="sb-submenu">
                    
                        <li><a href="http://www.gome.com.cn" target="_BLANK" class="animsition-link">Gome</a></li>
                    
                        <li><a href="http://www.yintai.com" target="_BLANK" class="animsition-link">YinTai</a></li>
                    
                </ul>
            </li>
            
            
            
            <li>
                <a class="sb-toggle-submenu">Links<span class="sb-caret"></span></a>
                <ul class="sb-submenu">
                    
                    <li><a href="http://www.jianshu.com/users/211925b3ca7c/latest_articles" class="animsition-link">吴白</a></li>
                    
                    <li><a href="http://www.jianshu.com/users/19f4bf67c705/latest_articles" class="animsition-link">吴禅</a></li>
                    
                </ul>
            </li>
            
        </ul>
        <!-- Lists in Slidebars -->
        <ul class="sb-menu secondary">
            <li><a href="/about" class="animsition-link" title="about">About</a></li>
            <li><a href="/atom.xml" class="animsition-link" title="rss">RSS</a></li>
        </ul>
    </div>
    
    <!-- ============================ END Off-canvas navigation =========================== -->

    <!-- ============================ #sb-site Main Page Wrapper =========================== -->

    <div id="sb-site">
        <!-- #sb-site - All page content should be contained within this id, except the off-canvas navigation itself -->

        <!-- ============================ Header & Logo bar =========================== -->

        <div id="navigation" class="navbar navbar-fixed-top">
            <div class="navbar-inner">
                <div class="container">
                    <!-- Nav logo -->
                    <div class="logo">
                        <a href="/" title="Logo" class="animsition-link">
                         <img src="/img/logo.png" alt="Logo" width="35px;"/> 
                        </a>
                    </div>
                    <!-- // Nav logo -->
                    <!-- Info-bar -->
                    <nav>
                        <ul class="nav">
                            <li><a href="/" class="animsition-link">流城</a></li>
                            <li class="nolink"><span>Always </span>Creative.</li>
                            
                            <li><a href="https://github.com/" title="Github" target="_blank"><i class="icon-github"></i></a></li>
                            
                            
                            <li><a href="https://twitter.com/" title="Twitter" target="_blank"><i class="icon-twitter"></i></a></li>
                            
                            
                            <li><a href="https://www.facebook.com/" title="Facebook" target="_blank"><i class="icon-facebook"></i></a></li>
                            
                            
                            <li><a href="https://google.com/" title="Google-Plus" target="_blank"><i class="icon-google-plus"></i></a></li>
                            
                            
                            <li><a href="http://weibo.com/" title="Sina-Weibo" target="_blank"><i class="icon-sina-weibo"></i></a></li>
                            
                            <li class="nolink"><span>Welcome!</span></li>
                        </ul>
                    </nav>
                    <!--// Info-bar -->
                </div>
                <!-- // .container -->
                <div class="learnmore sb-toggle-right">More</div>
                <button type="button" class="navbar-toggle menu-icon sb-toggle-right" title="More">
                <span class="sr-only">Toggle navigation</span>
                <span class="icon-bar before"></span>
                <span class="icon-bar main"></span>
                <span class="icon-bar after"></span>
                </button>
            </div>
            <!-- // .navbar-inner -->
        </div>

        <!-- ============================ Header & Logo bar =========================== -->


      
<section id="intro">
    <div class="container">
        <div class="row col-md-offset-2">
            <div class="col-md-8">
    			<span class="post-meta">
      <time datetime="2013-10-01T02:40:37.000Z" itemprop="datePublished">
          2013-10-01
      </time>
    
</span>
                <h1>从0开始看一个项目</h1>
            </div>
        </div>
        <!--<div class="col-md-8 col-md-offset-2">-->
        <div class="col-md-offset-2">
      		<p>&#x5728;&#x7740;&#x624B;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#x524D;<strong>&#x5148;&#x8BFB;&#x6587;&#x6863;</strong>&#xFF08;&#x5982;&#x679C;&#x6709;&#x6587;&#x6863;&#x7684;&#x8BDD;&#xFF09;&#x3002;&#x5C3D;&#x7BA1;&#x8BFB;&#x4E86;&#x6587;&#x6863;&#x4F60;&#x4E0D;&#x4E00;&#x5B9A;&#x77E5;&#x9053;&#x6BCF;&#x4E00;&#x4E2A;&#x4EE3;&#x7801;&#x7684;&#x7EC6;&#x8282;&#xFF0C;&#x4F46;&#x662F;&#x5982;&#x679C;&#x4F60;&#x4E86;&#x89E3;&#x90A3;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#x8BDD;&#xFF0C;&#x4F60;&#x4E00;&#x5B9A;&#x77E5;&#x9053;&#x600E;&#x4E48;&#x5199;&#x53EF;&#x4EE5;&#x5199;&#x51FA;&#x4E00;&#x4E2A;&#x6EE1;&#x8DB3;&#x6587;&#x6863;&#x7684;&#x5185;&#x5BB9;&#x3002;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x5927;&#x8111;&#x91CC;&#x9762;&#x5C31;&#x53EF;&#x4EE5;&#x6709;&#x4E2A;&#x6846;&#x67B6;&#xFF0C;&#x5148;&#x731C;&#x4E00;&#x731C;&#xFF0C;&#x7136;&#x540E;&#x770B;&#x4EE3;&#x7801;&#xFF0C;&#x4E8B;&#x534A;&#x529F;&#x500D;&#x3002;&#x627E;&#x4E0D;&#x5230;&#x597D;&#x7684;&#x6587;&#x6863;&#xFF0C;&#x5C31;&#x770B;&#x4ED6;&#x7684;<strong>&#x6D4B;&#x8BD5;&#x7528;&#x4F8B;</strong>&#xFF0C;&#x4E5F;&#x662F;&#x6709;&#x4E00;&#x6837;&#x7684;&#x529F;&#x6548;&#x7684;&#x3002;&#x56E0;&#x4E3A;&#x6D4B;&#x8BD5;&#x90FD;&#x662F;&#x4ECE;&#x6587;&#x6863;&#x51FA;&#x53D1;&#x7F16;&#x5199;&#x7684;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4ECE;&#x4EE3;&#x7801;&#x51FA;&#x53D1;&#x7F16;&#x5199;&#x7684;&#x3002;&#x627E;&#x4E0D;&#x5230;&#x6587;&#x6863;&#x548C;&#x6D4B;&#x8BD5;&#x7528;&#x4F8B;&#xFF1F;&#x90A3;&#x5C31;&#x76F4;&#x63A5;Gank&#x5427;&#x3002;</p>
<p><strong>&#x8BFB;&#x4EE3;&#x7801;&#x8981;&#x5C42;&#x6B21;&#x5316;&#x3001;&#x5E26;&#x7740;&#x95EE;&#x9898;&#x53BB;&#x9605;&#x8BFB;</strong>&#x3002;&#x9996;&#x5148;&#x6574;&#x4F53;&#x4E86;&#x89E3;&#x8FD9;&#x4E2A;&#x8F6F;&#x4EF6;&#x662F;&#x5E72;&#x4EC0;&#x4E48;&#xFF1F;&#x89E3;&#x51B3;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#xFF1F;&#x5305;&#x542B;&#x54EA;&#x4E9B;&#x5927;&#x7684;&#x6A21;&#x5757;&#xFF0C;&#x5404;&#x4E2A;&#x6A21;&#x5757;&#x7684;&#x4F5C;&#x7528;&#x662F;&#x4EC0;&#x4E48;&#xFF0C;&#x5404;&#x4E2A;&#x6A21;&#x5757;&#x7684;&#x8C03;&#x7528;&#x5173;&#x7CFB;&#x600E;&#x4E48;&#x6837;&#xFF1F;&#x7136;&#x540E;&#x5BF9;&#x4E8E;&#x6BCF;&#x4E00;&#x4E2A;&#x6A21;&#x5757;&#xFF0C;&#x8FD9;&#x4E2A;&#x6A21;&#x5757;&#x662F;&#x5E72;&#x4EC0;&#x4E48;&#x7684;&#xFF1F;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x6709;&#x8FD9;&#x4E2A;&#x6A21;&#x5757;&#xFF1F;&#x8FD9;&#x4E2A;&#x6A21;&#x5757;&#x600E;&#x4E48;&#x5B9E;&#x73B0;&#x7684;&#xFF1F;&#x6700;&#x540E;&#x7EC6;&#x5316;&#x5230;&#x6BCF;&#x4E00;&#x4E2A;&#x5305;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x7C7B;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x65B9;&#x6CD5;&#x3002;&#x4ECE;&#x4E0A;&#x5230;&#x4E0B;&#xFF0C;&#x4E00;&#x4E00;&#x51FB;&#x7834;&#x6BCF;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x8BA4;&#x771F;&#x53BB;<strong>&#x601D;&#x8003;</strong>&#x4ED6;&#x8FD9;&#x6837;&#x8BBE;&#x8BA1;&#x3001;&#x5199;&#x4EE3;&#x7801;&#x7684;&#x597D;&#x5904;&#xFF0C;&#x56E0;&#x4E3A;&#x597D;&#x7684;&#x8F6F;&#x4EF6;&#x90FD;&#x4F1A;&#x6EE1;&#x8DB3;&#x8FD9;&#x79CD;&#x4ECE;&#x62BD;&#x8C61;-&gt;&#x5177;&#x4F53;&#x7684;&#x539F;&#x5219;&#x7684;&#x3002;</p>
<p>&#x5728;&#x5F00;&#x59CB;&#x8BFB;&#x5177;&#x4F53;&#x4EE3;&#x7801;&#x524D;<strong>&#x5B9A;&#x4F4D;&#x597D;&#x6240;&#x6709;&#x8981;&#x8BFB;&#x7684;&#x6587;&#x4EF6;</strong>&#xFF0C;&#x77E5;&#x9053;&#x4ED6;&#x4EEC;&#x7684;&#x4F4D;&#x7F6E;&#x548C;&#x540D;&#x5B57;&#xFF0C;&#x8BBE;&#x8BA1;&#x826F;&#x597D;&#x7684;&#x5DE5;&#x7A0B;&#x5149;&#x770B;&#x5DE5;&#x7A0B;&#x7684;&#x76EE;&#x5F55;&#x7ED3;&#x6784;&#x548C;&#x6587;&#x4EF6;&#x540D;&#x5C31;&#x80FD;&#x77E5;&#x9053;&#x4E2A;&#x5927;&#x6982;&#x529F;&#x80FD;&#x4E86;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#x9605;&#x8BFB;&#x4EE3;&#x7801;&#x7684;&#x96BE;&#x6613;&#x7A0B;&#x5EA6;70%&#x53D6;&#x51B3;&#x4E8E;&#x4EE3;&#x7801;&#x4E66;&#x5199;&#x7684;&#x89C4;&#x8303;&#x7A0B;&#x5EA6;&#xFF0C;&#x5199;&#x4E71;&#x6389;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x5927;&#x5E08;&#x4E5F;&#x8BFB;&#x4E0D;&#x61C2;&#x3002;&#x4E4B;&#x540E;&#x6839;&#x636E;&#x4F60;&#x5BF9;&#x76EE;&#x5F55;&#x7ED3;&#x6784;&#x7684;&#x7406;&#x89E3;&#x786E;&#x5B9A;&#x6587;&#x4EF6;&#x9605;&#x8BFB;&#x7684;&#x987A;&#x5E8F;&#xFF08;&#x6211;&#x53CD;&#x6B63;&#x90FD;&#x662F;&#x4ECE;main&#x51FD;&#x6570;&#x5F00;&#x59CB;&#x8BFB;&#x7684;&#xFF09;&#x3002;&#x4F60;&#x6700;&#x597D;&#x5BF9;<strong>&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;</strong>&#x6709;&#x4E00;&#x5B9A;&#x4E86;&#x89E3;&#xFF0C;&#x5426;&#x5219;&#x4F60;&#x8BFB;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;code&#x65F6;&#x4F1A;&#x7ECF;&#x5E38;&#x65E0;&#x6CD5;&#x7406;&#x89E3;code&#x4E3A;&#x5565;&#x8981;&#x5F04;&#x5F97;&#x8FD9;&#x4E48;&#x5C42;&#x5C42;&#x5D4C;&#x5957;&#x3002;&#x9605;&#x8BFB;&#x4EE3;&#x7801;&#x4E00;&#x4E2A;&#x6700;&#x91CD;&#x8981;&#x7684;&#x63D0;&#x5347;&#x6C34;&#x5E73;&#x7684;&#x5730;&#x65B9;&#x5C31;&#x662F;&#x7406;&#x89E3;&#x597D;&#x7684;&#x4EE3;&#x7801;&#x5982;&#x4F55;&#x5408;&#x7406;&#x4F7F;&#x7528;&#x8BBE;&#x8BA1;&#x6A21;&#x5F0F;&#x3002;&#x57FA;&#x672C;&#x7684;&#x9605;&#x8BFB;&#x8D77;&#x70B9;&#x90FD;&#x4F1A;&#x9009;&#x62E9;main&#x51FD;&#x6570;&#x6216;&#x8005;&#x7C7B;&#x7684;&#x6784;&#x9020;&#x51FD;&#x6570;&#x3002;&#x7136;&#x540E;&#x628A;&#x81EA;&#x5DF1;&#x60F3;&#x8C61;&#x6210;cpu&#x6267;&#x884C;&#x7A0B;&#x5E8F;&#x90A3;&#x6837;&#x53BB;&#x9605;&#x8BFB;&#x4F60;&#x7684;&#x4EE3;&#x7801;&#x3002;&#x9047;&#x5230;&#x9700;&#x8981;&#x8DF3;&#x8F6C;&#x51FD;&#x6570;&#x65F6;&#xFF0C;&#x4E0D;&#x8981;&#x6025;&#x4E8E;&#x8DF3;&#x8F6C;&#xFF0C;&#x4EE5;&#x4E86;&#x89E3;&#x51FD;&#x6570;&#x529F;&#x80FD;&#x548C;&#x8F93;&#x5165;&#x8F93;&#x51FA;&#x4E3A;&#x76EE;&#x6807;&#xFF0C;&#x8BFB;&#x4EE3;&#x7801;&#x6700;&#x5FCC;&#x8BB3;&#x7684;&#x662F;&#x4E0D;&#x6293;&#x7ED3;&#x6784;&#x6293;&#x7EC6;&#x8282;&#xFF0C;&#x53EA;&#x89C1;&#x6811;&#x6728;&#x4E0D;&#x89C1;&#x68EE;&#x6797;&#xFF0C;<strong>&#x6BD4;&#x8D77;&#x67D0;&#x4E2A;&#x51FD;&#x6570;&#x5177;&#x4F53;&#x529F;&#x80FD;&#x6765;&#x8BF4;&#x5BF9;&#x7ED3;&#x6784;&#x7684;&#x5168;&#x5C40;&#x628A;&#x63E1;&#x66F4;&#x91CD;&#x8981;</strong>&#x3002;&#x529F;&#x80FD;&#x4E86;&#x89E3;&#x6E05;&#x695A;&#x540E;&#x7EE7;&#x7EED;&#x8DF3;&#x56DE;&#x6765;&#xFF08;&#x8FD9;&#x91CC;&#x5C31;&#x53EF;&#x4EE5;&#x533A;&#x5206;&#x4EE3;&#x7801;&#x5199;&#x7684;&#x4F18;&#x4E0D;&#x4F18;&#x79C0;&#xFF0C;&#x4F18;&#x79C0;&#x7684;&#x4EE3;&#x7801;&#x5149;&#x770B;&#x51FD;&#x6570;&#x540D;&#x5B57;&#x5C31;&#x77E5;&#x9053;&#x529F;&#x80FD;&#xFF0C;&#x8FDE;&#x8DF3;&#x8F6C;&#x90FD;&#x4E0D;&#x7528;&#xFF09;&#x3002;&#x7ED3;&#x6784;&#x5F04;&#x6E05;&#x695A;&#x4E86;&#xFF0C;&#x77E5;&#x9053;&#x7A0B;&#x5E8F;&#x600E;&#x4E48;&#x8DD1;&#x4E86;&#xFF0C;source code&#x7684;&#x7CBE;&#x534E;&#x4F60;&#x5DF2;&#x7ECF;&#x8BFB;&#x4E86;60%&#x4E86;&#xFF0C;&#x4E4B;&#x540E;&#x6839;&#x636E;&#x9700;&#x8981;&#x518D;&#x5BF9;&#x5177;&#x4F53;&#x51FD;&#x6570;&#x6DF1;&#x5165;&#x5206;&#x6790;&#xFF0C;&#x5230;&#x8FD9;&#x91CC;&#x6574;&#x4E2A;&#x4EE3;&#x7801;&#x5DF2;&#x7ECF;&#x88AB;&#x4F60;&#x6252;&#x5149;&#x4E86;&#xFF0C;&#x6CA1;&#x4EC0;&#x4E48;&#x795E;&#x79D8;&#x4E86;&#x3002;</p>
<p>&#x9605;&#x8BFB;&#x4EE3;&#x7801;&#x6709;&#x4E24;&#x79CD;&#x6A21;&#x5F0F;&#xFF1A;<strong>top-down</strong> &#x548C; <strong>bottom-up</strong>&#x3002;Top-down &#x6A21;&#x5F0F;&#xFF0C;&#x5C31;&#x662F;&#x5148;&#x8BBE;&#x5B9A;&#x4E00;&#x4E2A; use case&#xFF0C;&#x6BD4;&#x5982;&#x8BF4;&#x6253;&#x5F00;&#x4E00;&#x4E2A;&#x6587;&#x4EF6;&#x3002;&#x7136;&#x540E;&#x9759;&#x6001;&#x8DDF;&#x7740;&#x4EE3;&#x7801;&#x770B;&#xFF0C;&#x6216;&#x8005;&#x7528; debugger &#x8DDF;&#x7740;&#x770B;&#x3002;&#x6BCF;&#x6B21;&#x51FA;&#x73B0;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x628A;&#x51FD;&#x6570;&#x7684;&#x6267;&#x884C;&#x5C42;&#x6B21;&#x7EAA;&#x5F55;&#x4E0B;&#x6765;&#x3002;&#x5927;&#x81F4;&#x5982;&#x4E0B;&#xFF1A;</p>
<pre><code>func1( )
   func2(  )
       func(  )
   func3(  )
</code></pre><p>&#x8FD9;&#x79CD;&#x56FE;&#x8868;&#x5F88;&#x968F;&#x610F;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x81EA;&#x5DF1;&#x7684;&#x9700;&#x8981;&#x589E;&#x52A0;&#x4FE1;&#x606F;&#xFF0C;&#x53EF;&#x4EE5;&#x628A;&#x91CD;&#x8981;&#x7684;&#x300C;&#x5B9E;&#x9645;&#x53C2;&#x6570;&#x300D;&#x4E00;&#x76F4;&#x6807;&#x4E0B;&#x6765;&#xFF0C;&#x753B;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x56FE;&#xFF0C;&#x7136;&#x540E;&#x6807;&#x6CE8;&#x6BCF;&#x4E2A;&#x51FD;&#x6570;&#x5728;&#x5E72;&#x4EC0;&#x4E48;&#x3002;&#x4E0D;&#x8FC7;&#x8FD9;&#x4E2A;&#x56FE;&#x65E0;&#x6CD5;&#x6E05;&#x695A;&#x5730;&#x8868;&#x660E;&#x4E00;&#x4E2A;&#x53D8;&#x91CF;&#x7684;&#x8F68;&#x8FF9;&#xFF0C;&#x9700;&#x8981;&#x53E6;&#x5916;&#x7684;&#x56FE;&#x6765;&#x6807;&#x793A;&#x53D8;&#x91CF;&#x7684;&#x53D8;&#x5316;&#x8F68;&#x8FF9;&#x3002;&#x8981;&#x662F;&#x60F3;&#x63D0;&#x9AD8;&#x9605;&#x8BFB;&#x4EE3;&#x7801;&#x7684;&#x901F;&#x5EA6;&#xFF0C;&#x5F52;&#x6839;&#x7ED3;&#x5E95;&#x8981;&#x591A;&#x8BFB;&#x591A;&#x5199;&#x3002;&#x719F;&#x6089;&#x7A0B;&#x5E8F;&#x7684;&#x57FA;&#x672C;&#x6784;&#x6210;&#x5355;&#x5143;&#xFF08;&#x4F8B;&#x5982;&#x5FAA;&#x73AF;&#x3001;&#x5206;&#x652F;&#xFF09;&#x7684;&#x5E38;&#x89C1;&#x5199;&#x6CD5;&#xFF0C;&#x5404;&#x79CD;lib, api&#x7684;&#x8C03;&#x7528;&#x65B9;&#x5F0F;&#x3002;&#x8FD9;&#x6837;&#x9605;&#x8BFB;&#x6DF1;&#x5C42;&#x6B21;&#x4EE3;&#x7801;&#x4E0D;&#x7528;&#x518D;&#x56DE;&#x5934;&#x67E5;&#x5F62;&#x5F0F;&#x53C2;&#x6570;&#x5230;&#x5E95;&#x6307;&#x4EC0;&#x4E48;&#x3002;&#x8FD9;&#x4E2A;&#x56FE;&#x7684;&#x57FA;&#x672C;&#x4F5C;&#x7528;&#x662F;&#x9632;&#x6B62;&#x5728;&#x9605;&#x8BFB;&#x6DF1;&#x5C42;&#x6B21;&#x4EE3;&#x7801;&#x65F6;&#x5FD8;&#x8BB0;&#x603B;&#x4F53;&#x6267;&#x884C;&#x5C42;&#x6B21;&#x3002;Top-down &#x6A21;&#x5F0F;&#x8FDB;&#x884C;&#x5230;&#x4E00;&#x5B9A;&#x5C42;&#x6B21;&#xFF0C;&#x5F80;&#x5F80;&#x4F1A;&#x53D1;&#x73B0;&#x867D;&#x7136;&#x56FE;&#x753B;&#x4E86;&#x51FA;&#x6765;&#xFF0C;&#x4F46;&#x8FD8;&#x662F;&#x65E0;&#x6CD5;&#x4E86;&#x89E3;&#x7A0B;&#x5E8F;&#x5728;&#x5E72;&#x4EC0;&#x4E48;&#x3002;&#x8FD9;&#x65F6;&#x9700;&#x8981;&#x8F6C;&#x5165; bottom-up &#x6A21;&#x5F0F;&#xFF0C;&#x4E00;&#x76F4;&#x6DF1;&#x5165;&#x5230;&#x6700;&#x5E95;&#x5C42;&#xFF0C;&#x7ED9;&#x80FD;&#x4E86;&#x89E3;&#x4F5C;&#x7528;&#x7684;&#x5E95;&#x5C42;&#x51FD;&#x6570;&#x4E00;&#x4E2A;&#x4E00;&#x4E2A;&#x7684;&#x5199;&#x6587;&#x6863;&#x3002;&#x5F53;&#x7136;&#x8FD9;&#x65F6;&#x7684;&#x6587;&#x6863;&#x662F;&#x5B8C;&#x5168;&#x5E95;&#x5C42;&#x7684;&#x89C2;&#x70B9;&#x3002;bottom-up&#x7684;&#x9605;&#x8BFB;&#x65B9;&#x6CD5;&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x4F1A;&#x4E00;&#x5934;&#x624E;&#x8FDB;&#x53BB;&#xFF0C;&#x51FA;&#x4E0D;&#x6765;&#x4E86;&#x3002;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x9002;&#x5408;&#x8BFB;&#x4E00;&#x4E9B;&#x6BD4;&#x8F83;&#x4F18;&#x79C0;&#x7684;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x4E5F;&#x4F1A;&#x5F88;&#x597D;&#x5730;&#x63D0;&#x9AD8;&#x5185;&#x529F;&#x3002;&#x7136;&#x540E;&#x5C31;&#x662F;&#x4E0D;&#x65AD;&#x5728;&#x4E24;&#x4E2A;&#x6A21;&#x5F0F;&#x4E4B;&#x95F4;&#x8F6C;&#x6362;&#xFF0C;&#x4E0D;&#x65AD;&#x7684;&#x7EC6;&#x5316;&#x4E24;&#x79CD;&#x6A21;&#x5F0F;&#x7684;&#x7406;&#x89E3;&#x3002;</p>
<p>&#x6700;&#x540E;&#xFF0C;&#x5BF9;&#x4E8E;OC&#x5DE5;&#x7A0B;&#x53EF;&#x4EE5;&#x53BB;GitHub&#x627E;<a href="https://github.com/RuiAAPeres/UIViewController-Swizzled" target="_blank" rel="external">UIViewController-Swizzled</a>&#x8FD9;&#x4E2A;&#x5E93;&#xFF0C;&#x62C9;&#x4E0B;&#x6765;&#x653E;&#x5230;&#x9879;&#x76EE;&#x91CC;&#xFF0C;&#x4ED6;&#x6709;&#x4EC0;&#x4E48;&#x7528;&#x5462;&#xFF1F;&#x4ED6;&#x53EF;&#x4EE5;&#x628A;&#x6BCF;&#x4E2A;&#x9875;&#x9762;&#x7684;&#x7C7B;&#x540D;&#x6253;&#x51FA;&#x6765;&#x3002;&#x800C;&#x4E14;&#x6709;&#x5C42;&#x6B21;&#x7ED3;&#x6784;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x4F60;&#x53EA;&#x9700;&#x8981;&#x6253;&#x5F00;&#x9879;&#x76EE;&#x70B9;&#x70B9;&#x70B9;&#xFF0C;&#x5C31;&#x77E5;&#x9053;&#x8FD9;&#x4E2A;App&#x8FD0;&#x884C;&#x7684;&#x987A;&#x5E8F;&#x4E86;&#x3002;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1170656-299eea93eaaceba3.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="&#x9879;&#x76EE;"></p>

            <div class="clearfix"></div>
            <hr class="nogutter">
        </div>


        <nav class="pagination" role="pagination">


<div class="ds-share flat" data-thread-key="2013/10/01/从0开始看一个项目/" data-title="从0开始看一个项目" data-images="https://avatars0.githubusercontent.com/u/10378248?v=3&s=460" data-content="从0开始看一个项目 是最近写的文章，希望能帮到您！" data-url="https://dangdangfeng.github.io/2013/10/01/从0开始看一个项目/">
    <div class="ds-share-inline">
      <ul  class="ds-share-icons-16">
        
        <li data-toggle="ds-share-icons-more"><a class="ds-more" href="javascript:void(0);">分享到：</a></li>
        <li><a class="ds-weibo" href="javascript:void(0);" data-service="weibo">微博</a></li>
        <li><a class="ds-qzone" href="javascript:void(0);" data-service="qzone">QQ空间</a></li>
        <li><a class="ds-qqt" href="javascript:void(0);" data-service="qqt">腾讯微博</a></li>
        <li><a class="ds-wechat" href="javascript:void(0);" data-service="wechat">微信</a></li>
        
      </ul>
      <div class="ds-share-icons-more">
      </div>
    </div>
 </div>

 <br/>

    
    <a class="pull-left" href="/2013/12/01/如何编写稳定流畅的iOS移动端应用/" style="float: left;">
        ← 如何编写稳定流畅的iOS移动端应用
    </a>
    
    
    <a class="pull-right" href="/2013/09/01/动画中的运动曲线/">
        动画中的运动曲线 →
    </a>
    

    
</nav>



        
        <div class="duoshuo">


<div class="ds-thread" data-thread-key="2013/10/01/从0开始看一个项目/" data-title="从0开始看一个项目" data-url="https://dangdangfeng.github.io/2013/10/01/从0开始看一个项目/"></div>



<script type="text/javascript">
var duoshuoQuery = {short_name:"deter"};
(function() {
	var ds = document.createElement('script');
	ds.type = 'text/javascript';ds.async = true;
	ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
	ds.charset = 'UTF-8';
	(document.getElementsByTagName('head')[0] 
	 || document.getElementsByTagName('body')[0]).appendChild(ds);
})();
</script>
</div>
    </div>
</section>


      
<!-- ============================ Footer =========================== -->

<footer>
    <div class="container">
            <div class="copy">
                <p>
                    &copy; 2010<script>new Date().getFullYear()>2010&&document.write("-"+new Date().getFullYear());</script>, Content By 吴白. All Rights Reserved.
                </p>
                <p>Theme By <a href="//go.kieran.top" style="color: #767D84">Kieran</a></p>
            </div>
            <div class="social">
                <ul>
                    
                    <li><a href="https://github.com/" title="Github" target="_blank"><i class="icon-github"></i></a>&nbsp;</li>
                    
                    
                    <li><a href="https://twitter.com/" title="Twitter" target="_blank"><i class="icon-twitter"></i></a>&nbsp;</li>
                    
                    
                    <li><a href="https://www.facebook.com/" title="Facebook" target="_blank"><i class="icon-facebook"></i></a>&nbsp;</li>
                    
                    
                    <li><a href="https://google.com/" title="Google-Plus" target="_blank"><i class="icon-google-plus"></i></a>&nbsp;</li>
                    
                    
                    <li><a href="http://weibo.com/" title="Sina-Weibo" target="_blank"><i class="icon-sina-weibo"></i></a>&nbsp;</li>
                    
                </ul>
            </div>
            <div class="clearfix"> </div>
        </div>
</footer>

<!-- ============================ END Footer =========================== -->
      <!-- Load our scripts -->
        
<!-- Resizable 'on-demand' full-height hero -->
<script type="text/javascript">
    
    var resizeHero = function () {
        var hero = $(".cover,.heightblock"),
            window1 = $(window);
        hero.css({
            "height": window1.height()
        });
    };
    
    resizeHero();
    
    $(window).resize(function () {
        resizeHero();
    });
</script>
<script src="/js/plugins.min.js"></script><!-- Bootstrap core and concatenated plugins always load here -->
<script src="/js/jquery.flexslider-min.js"></script><!-- Flexslider plugin -->
<script src="/js/scripts.js"></script><!-- Theme scripts -->

<!-- Initiate flexslider plugin -->
<script type="text/javascript">
    $(document).ready(function($) {
      $('.flexslider').flexslider({
        animation: "fade",
        prevText: "",
        nextText: "",
        directionNav: true
      });
    });
</script>

</body>
</html>
