<!DOCTYPE html>
<!--[if lte IE 8 ]>
<html class="ie" xmlns="http://www.w3.org/1999/xhtml" xml:lang="en-US" lang="en-US">
<![endif]-->
<!--[if (gte IE 9)|!(IE)]><!-->
<!--
***************  *      *     *
      8          *    *       *
      8          *  *         *
      8          **           *
      8          *  *         *
      8          *    *       *
      8          *      *     *
      8          *        *   ***********    -----Theme By Kieran(http://go.kieran.top)
-->
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en-US" lang="en-US">
<!--<![endif]-->

<head>
  <title>程序员的前路 | 流城</title>
  <!-- Meta data -->
    <meta http-equiv="Content-Type" content="text/html" charset="UTF-8" >
    <meta http-equiv="X-UA-Compatible" content="IE=edge"/>
    <meta name="viewport" content="width=device-width, initial-scale=1.0" />
    <meta name="generator" content="流城">
    <meta name="author" content="吴白">
    <meta name="description" content="" />
    <meta name="keywords" content="" />

    <!-- Favicon, (keep icon in root folder) -->
    <link rel="Shortcut Icon" href="/img/favicon.ico" type="image/ico">

    <link rel="alternate" href="/atom.xml" title="流城" type="application/atom+xml">
    <link rel="stylesheet" href="/css/all.css" media="screen" type="text/css">
	
    <link rel="stylesheet" href="/highlightjs/vs.css" type="text/css">
    
    

    <!-- Custom stylesheet, (add custom styles here, always load last) -->
    <!-- Load our stylesheet for IE8 -->
    <!--[if IE 8]>
    <link rel="stylesheet" type="text/css" href="/css/ie8.css" />
    <![endif]-->

    <!-- Google Webfonts (Monserrat 400/700, Open Sans 400/600) -->
    <!--<link href='//fonts.useso.com/css?family=Montserrat:400,700' rel='stylesheet' type='text/css'>-->
    <!--<link href='//fonts.useso.com/css?family=Open+Sans:400,600' rel='stylesheet' type='text/css'>-->

    <!-- Load our fonts individually if IE8+, to avoid faux bold & italic rendering -->
    <!--[if IE]>
    <!--<link href='http://fonts.useso.com/css?family=Montserrat:400' rel='stylesheet' type='text/css'> -->
    <!--<link href='http://fonts.useso.com/css?family=Montserrat:700' rel='stylesheet' type='text/css'> -->
    <!--<link href='http://fonts.useso.com/css?family=Open+Sans:400' rel='stylesheet' type='text/css'>-->
    <!--<link href='http://fonts.useso.com/css?family=Open+Sans:600' rel='stylesheet' type='text/css'>-->
    <![endif]-->

    <!-- jQuery | Load our jQuery, with an alternative source fallback to a local version if request is unavailable -->
    <script src="/js/jquery-1.11.1.min.js"></script>
    <script>window.jQuery || document.write('<script src="js/jquery-1.11.1.min.js"><\/script>')</script>

    <!-- Load these in the <head> for quicker IE8+ load times -->
    <!-- HTML5 shim and Respond.js IE8 support of HTML5 elements and media queries -->
    <!--[if lt IE 9]>
    <script src="/js/html5shiv.min.js"></script>
    <script src="/js/respond.min.js"></script>
    <![endif]-->










  
  
  <link rel="alternate" type="application/atom+xml" title="Atom 0.3" href="atom.xml">
  
  

  
  <style>.col-md-8.col-md-offset-2.opening-statement img{display:none;}</style>
</head>

<!--
<body class="post-template">
-->
<body id="index" class="lightnav animsition">

      <!-- ============================ Off-canvas navigation =========================== -->

    <div class="sb-slidebar sb-right sb-style-overlay sb-momentum-scrolling">
        <div class="sb-close" aria-label="Close Menu" aria-hidden="true">
            <img src="/img/close.png" alt="Close"/>
        </div>
        <!-- Lists in Slidebars -->
        <ul class="sb-menu">
            <li><a href="/" class="animsition-link" title="Home">Home</a></li>
            <li><a href="/archives" class="animsition-link" title="archive">archives</a></li>
            <!-- Dropdown Menu -->
			 
            <li>
                <a class="sb-toggle-submenu">Works<span class="sb-caret"></span></a>
                <ul class="sb-submenu">
                    
                        <li><a href="http://www.gome.com.cn" target="_BLANK" class="animsition-link">Gome</a></li>
                    
                        <li><a href="http://www.yintai.com" target="_BLANK" class="animsition-link">YinTai</a></li>
                    
                </ul>
            </li>
            
            
            
            <li>
                <a class="sb-toggle-submenu">Links<span class="sb-caret"></span></a>
                <ul class="sb-submenu">
                    
                    <li><a href="http://www.jianshu.com/users/211925b3ca7c/latest_articles" class="animsition-link">吴白</a></li>
                    
                    <li><a href="http://www.jianshu.com/users/19f4bf67c705/latest_articles" class="animsition-link">吴禅</a></li>
                    
                </ul>
            </li>
            
        </ul>
        <!-- Lists in Slidebars -->
        <ul class="sb-menu secondary">
            <li><a href="/about" class="animsition-link" title="about">About</a></li>
            <li><a href="/atom.xml" class="animsition-link" title="rss">RSS</a></li>
        </ul>
    </div>
    
    <!-- ============================ END Off-canvas navigation =========================== -->

    <!-- ============================ #sb-site Main Page Wrapper =========================== -->

    <div id="sb-site">
        <!-- #sb-site - All page content should be contained within this id, except the off-canvas navigation itself -->

        <!-- ============================ Header & Logo bar =========================== -->

        <div id="navigation" class="navbar navbar-fixed-top">
            <div class="navbar-inner">
                <div class="container">
                    <!-- Nav logo -->
                    <div class="logo">
                        <a href="/" title="Logo" class="animsition-link">
                         <img src="/img/logo.png" alt="Logo" width="35px;"/> 
                        </a>
                    </div>
                    <!-- // Nav logo -->
                    <!-- Info-bar -->
                    <nav>
                        <ul class="nav">
                            <li><a href="/" class="animsition-link">流城</a></li>
                            <li class="nolink"><span>Always </span>Creative.</li>
                            
                            <li><a href="https://github.com/" title="Github" target="_blank"><i class="icon-github"></i></a></li>
                            
                            
                            <li><a href="https://twitter.com/" title="Twitter" target="_blank"><i class="icon-twitter"></i></a></li>
                            
                            
                            <li><a href="https://www.facebook.com/" title="Facebook" target="_blank"><i class="icon-facebook"></i></a></li>
                            
                            
                            <li><a href="https://google.com/" title="Google-Plus" target="_blank"><i class="icon-google-plus"></i></a></li>
                            
                            
                            <li><a href="http://weibo.com/" title="Sina-Weibo" target="_blank"><i class="icon-sina-weibo"></i></a></li>
                            
                            <li class="nolink"><span>Welcome!</span></li>
                        </ul>
                    </nav>
                    <!--// Info-bar -->
                </div>
                <!-- // .container -->
                <div class="learnmore sb-toggle-right">More</div>
                <button type="button" class="navbar-toggle menu-icon sb-toggle-right" title="More">
                <span class="sr-only">Toggle navigation</span>
                <span class="icon-bar before"></span>
                <span class="icon-bar main"></span>
                <span class="icon-bar after"></span>
                </button>
            </div>
            <!-- // .navbar-inner -->
        </div>

        <!-- ============================ Header & Logo bar =========================== -->


      
<section id="intro">
    <div class="container">
        <div class="row col-md-offset-2">
            <div class="col-md-8">
    			<span class="post-meta">
      <time datetime="2015-01-03T04:33:29.000Z" itemprop="datePublished">
          2015-01-03
      </time>
    
    
    | 
    <a href='/tags/杂谈/'>杂谈</a>
    
    
</span>
                <h1>程序员的前路</h1>
            </div>
        </div>
        <!--<div class="col-md-8 col-md-offset-2">-->
        <div class="col-md-offset-2">
      		<blockquote>
<p>&#x56DE;&#x5FC6;&#x5F80;&#x4E8B;&#xFF0C;&#x5F88;&#x591A;&#x4E60;&#x60EF;&#x6E90;&#x4E8E;&#x7B2C;&#x4E00;&#x5BB6;&#x516C;&#x53F8;&#x65F6;&#x5019;&#x7ECF;&#x5386;&#x7684;&#x4E00;&#x5207;&#x3002;&#x6709;&#x65F6;&#x5019;&#x6211;&#x4F1A;&#x60F3;&#xFF0C;&#x4E00;&#x4E2A;&#x7A0B;&#x5E8F;&#x5458;&#x7684;&#x7B2C;&#x4E00;&#x4EFD;&#x5DE5;&#x4F5C;&#xFF0C;&#x5F88;&#x53EF;&#x80FD;&#x5F71;&#x54CD;&#x4E86;&#x4ED6;&#x672A;&#x6765;&#x7684;&#x9053;&#x8DEF;&#x3002;</p>
</blockquote>
<p>&#x901A;&#x5E38;&#xFF0C;&#x8F6F;&#x4EF6;&#x6280;&#x672F;&#x4EBA;&#x5458;&#x7684;&#x804C;&#x4E1A;&#x53D1;&#x5C55;&#x6709;&#x51E0;&#x4E2A;&#x9009;&#x62E9;&#xFF1A;&#x4E13;&#x6CE8;&#x4E8E;&#x6280;&#x672F;&#xFF0C;&#x6210;&#x4E3A;&#x6280;&#x672F;&#x4E13;&#x5BB6;;&#x8F6C;&#x578B;&#x5230;&#x6280;&#x672F;&#x578B;&#x9500;&#x552E;&#x3001;&#x6280;&#x672F;&#x652F;&#x6301;&#x7B49;;&#x968F;&#x7740;&#x6280;&#x672F;&#x6210;&#x957F;&#xFF0C;&#x4ECE;&#x6280;&#x672F;&#x6027;&#x7BA1;&#x7406;&#x5230;&#x9AD8;&#x7EA7;&#x7BA1;&#x7406;&#x3002;&#x524D;&#x63D0;&#x662F;&#x4F60;&#x4E00;&#x5B9A;&#x8981;&#x4E86;&#x89E3;&#x81EA;&#x5DF1;&#x7684;&#x7279;&#x70B9;&#x548C;&#x4F18;&#x52BF;&#xFF0C;&#x5C31;&#x597D;&#x6BD4;&#x9EC4;&#x74DC;&#x79CD;&#x5B50;&#x662F;&#x4E0D;&#x53EF;&#x80FD;&#x57F9;&#x80B2;&#x6210;&#x897F;&#x74DC;&#x4E00;&#x6837;&#x3002;&#x5728;&#x624E;&#x5B9E;&#x7684;&#x6280;&#x672F;&#x57FA;&#x7840;&#x4E0A;(&#x9AD8;&#x7EA7;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#x5E08;)&#xFF0C;&#x5982;&#x679C;&#x6709;&#x7740;&#x6BD4;&#x8F83;&#x5F3A;&#x7684;&#x62BD;&#x8C61;&#x8BBE;&#x8BA1;&#x80FD;&#x529B;&#xFF0C;&#x53C8;&#x6253;&#x7B97;&#x4E13;&#x6CE8;&#x4E8E;&#x6280;&#x672F;&#x5F00;&#x53D1;&#xFF0C;&#x67B6;&#x6784;&#x5E08;&#x662F;&#x4E2A;&#x597D;&#x7684;&#x9009;&#x62E9;;&#x5982;&#x679C; &#x6027;&#x683C;&#x66F4;&#x9002;&#x5408;&#x505A;&#x7BA1;&#x7406;&#xFF0C;&#x60C5;&#x5546;&#x80FD;&#x529B;&#x7A81;&#x51FA;&#xFF0C;&#x6280;&#x672F;&#x578B;&#x7BA1;&#x7406;&#x5E94;&#x8BE5;&#x662F;&#x4E0B;&#x4E00;&#x6B65;&#x7684;&#x65B9;&#x5411;&#x3002;&#x51B3;&#x80DC;&#x70B9;&#x5728;&#x4E8E;&#x957F;&#x671F;&#x7684;&#x70B9;&#x6EF4;&#x79EF;&#x7D2F;&#xFF0C;&#x65E0;&#x8BBA;&#x7A0B;&#x5E8F;&#x5458;&#x4E2A;&#x4F53;&#x4E4B;&#x95F4;&#x5DEE;&#x5F02;&#x6709;&#x591A;&#x5927;&#xFF0C;&#x7A0B;&#x5E8F;&#x5458;&#x4E0A;&#x5347;&#x7A7A;&#x95F4;&#x5728;&#x4E8E;&#x6280;&#x672F;&#x4E0A;&#x7684;&#x53CD;&#x601D;&#x548C;&#x63D0;&#x9AD8;&#x3002;</p>
<p>&#x7A0B;&#x5E8F;&#x5458;&#x5728;&#x7F16;&#x7A0B;&#x5E8F;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4E00;&#x65B9;&#x9762;&#x4F1A;&#x5B9E;&#x73B0;&#x8BBE;&#x8BA1;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x53E6;&#x4E00;&#x65B9;&#x9762; &#x4E5F;&#x5728;&#x5BF9;&#x8BBE;&#x8BA1;&#x6709;&#x4E00;&#x4E2A;&#x7406;&#x89E3;&#x3001;&#x8BA4;&#x8BC6;&#x3001;&#x719F;&#x77E5;&#x7684;&#x8FC7;&#x7A0B;&#x3002;&#x8FDB;&#x800C;&#x6162;&#x6162;&#x5730;&#x4ECE;&#x5B66;&#x4E60;&#x522B;&#x4EBA;&#x8BBE;&#x8BA1;&#xFF0C;&#x8F6C;&#x5411;&#x5230;&#x81EA;&#x5DF1;&#x53C2;&#x4E0E;&#x6216;&#x72EC;&#x7ACB;&#x8BBE;&#x8BA1;&#x3002;&#x5982;&#x679C;&#x8FD9;&#x4E2A;&#x7A0B;&#x5E8F;&#x5458;&#x771F;&#x7684;&#x975E;&#x5E38;&#x975E;&#x5E38;&#x559C;&#x6B22;&#x7A0B;&#x5E8F;&#x5458;&#x8FD9;&#x4E2A;&#x804C;&#x4E1A;&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x8F6C;&#x5411;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x5E08;&#x3002;&#x8FD9;&#x4E2A;&#x8F6C;&#x53D8;&#x5F88;&#x5927;&#x7A0B;&#x5EA6;&#x662F;&#x7A0B;&#x5E8F;&#x5458;&#x610F;&#x8BC6;&#x7684;&#x8F6C;&#x53D8;&#xFF0C;&#x5C31;&#x662F;&#x8BF4;&#x8981;&#x628A;&#x7F16;&#x7A0B;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x9010;&#x6B65;&#x5206;&#x644A;&#x5230;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x4E0A;&#xFF0C;&#x8981;&#x628A;&#x91CD;&#x70B9;&#x4ECE;&#x7F16;&#x7A0B;&#x5B9E;&#x73B0;&#x8F6C;&#x53D8;&#x5230;&#x9879;&#x76EE;&#x7684;&#x529F;&#x80FD;&#x8BBE;&#x8BA1;&#x4E0A;&#x3002;&#x8FD9;&#x91CC;&#x5F3A;&#x8C03;&#x7684;&#x662F;&#x201C;&#x9010;&#x6B65;&#x201D;&#x7684;&#x4E00;&#x4E2A;&#x8FC7;&#x7A0B;&#xFF0C;&#x7A0B;&#x5E8F;&#x5458;&#x8981;&#x9010;&#x6B65;&#x51CF;&#x5C11;&#x7F16;&#x7A0B;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x589E;&#x52A0;&#x8BBE;&#x8BA1;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x8981;&#x514B;&#x670D;&#x7F16;&#x7A0B;&#x7684;&#x5F3A;&#x5927;&#x5438;&#x5F15;&#x529B;&#xFF0C;&#x8981;&#x4E3B;&#x52A8;&#x5730;&#x6500;&#x4E0A;&#x8BBE;&#x8BA1;&#x8FD9;&#x4E2A;&#x53F0;&#x9636;&#x3002;&#x5F88;&#x96BE;&#x6709;&#x4E00;&#x4E2A;&#x8BBE;&#x8BA1;&#x5E08;&#x662F;&#x5B8C;&#x5168;&#x4E0D;&#x7F16;&#x7A0B;&#x7684;&#xFF0C;&#x800C;&#x4E14;&#x6211;&#x8BA4;&#x4E3A;&#xFF0C;&#x4F1A;&#x7F16;&#x7A0B;&#x7684;&#x8BBE;&#x8BA1;&#x5E08;&#x624D;&#x662F;&#x771F;&#x6B63;&#x7684;&#x8BBE;&#x8BA1;&#x5E08;&#x3002;&#x4E00;&#x822C;&#x8FD9;&#x79CD;&#x8F6C;&#x53D8;&#x9700;&#x8981;&#x82B1;&#x4E0A;&#x4E00;&#x5230;&#x4E24;&#x5E74;&#x65F6;&#x95F4;&#x3002;</p>
<p>&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x4E2D;&#x6700;&#x91CD;&#x8981;&#x7684;&#x57FA;&#x672C;&#x539F;&#x5219;&#xFF0C;&#x5176;&#x5B9E;&#x4E5F;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#xFF0C;&#x5F88;&#x591A;&#x5730;&#x65B9;&#x4E5F;&#x90FD;&#x662F;&#x9002;&#x7528;&#x7684;&#xFF1A;&#x7B2C;&#x4E00;&#xFF1A;&#x575A;&#x51B3;&#x907F;&#x514D;&#x91CD;&#x590D;&#xFF1B;&#x7B2C;&#x4E8C;&#xFF1A;&#x9AD8;&#x5185;&#x805A;&#x4F4E;&#x8026;&#x5408;&#x7684;&#x8BBE;&#x8BA1;&#xFF1B;&#x4FD7;&#x8BDD;&#x8BF4;&#x5F97;&#x597D;&#x2014;&#x2014;&#x552F;&#x4E00;&#x4E0D;&#x53D8;&#x7684;&#x5C31;&#x662F;&#x53D8;&#x5316;&#x672C;&#x8EAB;&#xFF01;&#x5982;&#x4F55;&#x9009;&#x62E9;&#x9002;&#x5F53;&#x7684;&#x7C92;&#x5EA6;&#xFF0C;&#x5982;&#x4F55;&#x8FDB;&#x884C;&#x9002;&#x5F53;&#x7684;&#x6A21;&#x5757;&#x5212;&#x5206;&#xFF0C;&#x4ECE;&#x800C;&#x628A;&#x53D8;&#x5316;&#x80FD;&#x591F;&#x5C01;&#x88C5;&#x5728;&#x4E00;&#x4E2A;&#x5C3D;&#x53EF;&#x80FD;&#x7A84;&#x7684;&#x8303;&#x56F4;&#x5185;&#xFF0C;&#x4EE5;&#x4FBF;&#x67D0;&#x4E2A;&#x53D8;&#x5316;&#x53EA;&#x4F1A;&#x9020;&#x6210;&#x5C40;&#x90E8;&#x7684;&#x5F71;&#x54CD;&#xFF0C;&#x800C;&#x6574;&#x4E2A;&#x8F6F;&#x4EF6;&#x6846;&#x67B6;&#x80FD;&#x591F;&#x5C3D;&#x53EF;&#x80FD;&#x7684;&#x4FDD;&#x6301;&#x7A33;&#x5B9A;&#x4E0D;&#x53D8;&#xFF0C;&#x4E0D;&#x4F1A;&#x7275;&#x4E00;&#x53D1;&#x800C;&#x52A8;&#x5168;&#x8EAB;&#xFF0C;&#x8FD9;&#x624D;&#x662F;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x6700;&#x7CBE;&#x5F69;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x4E5F;&#x662F;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x80FD;&#x4ECE;&#x5DE5;&#x7A0B;&#x95EE;&#x9898;&#x53D8;&#x4E3A;&#x827A;&#x672F;&#x95EE;&#x9898;&#x7684;&#x673A;&#x4F1A;&#x3002;</p>
<p>&#x90A3;&#x4E48;&#x95EE;&#x9898;&#x6765;&#x4E86;&#xFF0C;&#x5177;&#x4F53;&#x5982;&#x4F55;&#x505A;&#x624D;&#x80FD;&#x5F97;&#x51FA;&#x5C3D;&#x53EF;&#x80FD;&#x597D;&#x7684;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x5462;&#xFF1F;&#x9664;&#x975E;&#x4F60;&#x5728;&#x5F00;&#x59CB;&#x4E00;&#x4E2A;&#x9879;&#x76EE;&#x524D;&#x6709;&#x8FC7;&#x7C7B;&#x4F3C;&#x9879;&#x76EE;&#x7684;&#x7ECF;&#x9A8C;&#xFF0C;&#x5426;&#x5219;&#xFF0C;&#x4F60;&#x53EA;&#x80FD;&#x591F;&#x5728;&#x5F00;&#x53D1;&#x8FC7;&#x7A0B;&#x4E2D;&#x4E0D;&#x505C;&#x7684;&#x8FDB;&#x884C;&#x8C03;&#x6574;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x4E0D;&#x505C;&#x7684;&#x901A;&#x8FC7;&#x4E0D;&#x65AD;&#x8FED;&#x4EE3;&#x7684;&#x8F6F;&#x4EF6;&#x7248;&#x672C;&#x4E0E;&#x7528;&#x6237;&#x8FDB;&#x884C;&#x4EA4;&#x6D41;&#x6C9F;&#x901A;&#xFF0C;&#x6316;&#x6398;&#x51FA;&#x7528;&#x6237;&#x771F;&#x6B63;&#x7684;&#x9700;&#x6C42;&#x5E76;&#x53CA;&#x65F6;&#x8FDB;&#x884C;&#x4FEE;&#x6B63;&#xFF0C;&#x5FC5;&#x8981;&#x65F6;&#x8FD8;&#x9700;&#x8981;&#x5BF9;&#x6574;&#x4E2A;&#x8F6F;&#x4EF6;&#x8FDB;&#x884C;&#x91CD;&#x6784;&#xFF0C;&#x8FD9;&#x6837;&#x7ECF;&#x8FC7;&#x51E0;&#x6B21;&#x8FED;&#x4EE3;&#x540E;&#xFF0C;&#x624D;&#x6709;&#x5E0C;&#x671B;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x6EE1;&#x8DB3;&#x7528;&#x6237;&#x9700;&#x6C42;&#x7684;&#x63A5;&#x8FD1;&#x5B8C;&#x7F8E;&#x8BBE;&#x8BA1;&#x3002;&#x6700;&#x540E;&#x4E00;&#x70B9;&#x2014;&#x2014;&#x4F60;&#x9700;&#x8981;&#x5177;&#x6709;&#x5728;&#x4EE3;&#x7801;&#x4E2D;&#x7B7E;&#x540D;&#x7684;&#x52C7;&#x6C14;&#xFF0C;&#x8FD9;&#x4E2A;&#x7B7E;&#x540D;&#x5C31;&#x50CF;&#x662F;&#x4E00;&#x4E2A;&#x54C1;&#x724C;&#x6807;&#x8BC6;&#xFF0C;&#x662F;&#x4EE3;&#x7801;&#x8D28;&#x91CF;&#x7684;&#x4FDD;&#x8BC1;&#xFF0C;&#x8868;&#x660E;&#x8FD9;&#x6BB5;&#x4EE3;&#x7801;&#x662F;&#x4F60;&#x5F15;&#x4EE5;&#x4E3A;&#x50B2;&#x7684;&#x4F5C;&#x54C1;&#x3002;</p>
<p>&#x4E5F;&#x6709;&#x4E00;&#x4E9B;&#x7A0B;&#x5E8F;&#x5458;&#x5DE5;&#x4F5C;&#x673A;&#x9047;&#x6BD4;&#x8F83;&#x597D;&#xFF0C;&#x4E0D;&#x4F46;&#x8D1F;&#x8D23;&#x4E86;&#x9879;&#x76EE;&#x7684;&#x8BBE;&#x8BA1;&#x5DE5;&#x4F5C;&#xFF0C;&#x800C;&#x4E14;&#x8D1F;&#x8D23;&#x4E86;&#x9879;&#x76EE;&#x7BA1;&#x7406;&#x5DE5;&#x4F5C;&#x3002;&#x5BF9;&#x9879;&#x76EE;&#x7ECF;&#x7406;&#x8FD9;&#x4E2A;&#x5DE5;&#x4F5C;&#x6709;&#x4E86;&#x4E00;&#x5B9A;&#x7684;&#x5C1D;&#x8BD5;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x8FD9;&#x7C7B;&#x7A0B;&#x5E8F;&#x5458;&#x53EF;&#x4EE5;&#x5BA1;&#x89C6;&#x4E00;&#x4E0B;&#x81EA; &#x5DF1;&#xFF0C;&#x662F;&#x5426;&#x5408;&#x9002;&#x8FD9;&#x9879;&#x5DE5;&#x4F5C;&#x3002;&#x5982;&#x679C;&#x81EA;&#x5DF1;&#x5BF9;&#x8FD9;&#x79CD;&#x5DE5;&#x4F5C;&#x6BD4;&#x8F83;&#x6EE1;&#x610F;&#xFF0C;&#x800C;&#x4E14;&#x5177;&#x5907;&#x9879;&#x76EE;&#x7ECF;&#x7406;&#x7684;&#x8981;&#x6C42;&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x5411;&#x9879;&#x76EE;&#x7ECF;&#x7406;&#x8FD9;&#x4E2A;&#x65B9;&#x5411;&#x53D1;&#x5C55;&#x3002;&#x9879;&#x76EE;&#x7ECF;&#x7406;&#x627F;&#x62C5;&#x7740;&#x9879;&#x76EE;&#x7BA1;&#x7406;&#x7684;&#x804C;&#x8D23;&#xFF0C;&#x5BF9;&#x9879;&#x76EE;&#x8D1F;&#x4E3B; &#x8981;&#x8D23;&#x4EFB;&#x3002;&#x5B83;&#x548C;&#x7A0B;&#x5E8F;&#x5458;&#x7684;&#x4F5C;&#x7528;&#x4E5F;&#x4E0D;&#x76F8;&#x540C;&#xFF0C;&#x9879;&#x76EE;&#x7ECF;&#x7406;&#x7684;&#x91CD;&#x70B9;&#x5DF2;&#x7ECF;&#x4ECE;&#x7F16;&#x7A0B;&#x8F6C;&#x79FB;&#x5230;&#x5BF9;&#x4EBA;&#x3001;&#x5BF9;&#x6280;&#x672F;&#x3001;&#x5BF9;&#x8FDB;&#x5EA6;&#x3001;&#x5BF9;&#x9879;&#x76EE;&#x7684;&#x7BA1;&#x7406;&#x3002;&#x7531;&#x4E8E;&#x8F6F;&#x4EF6;&#x7684;&#x9879;&#x76EE;&#x7ECF;&#x7406;&#x4E0E;&#x8F6F;&#x4EF6;&#x9879;&#x76EE;&#x7684;&#x76F8;&#x5173;&#x6027;&#x592A;&#x5927;&#xFF0C;&#x56E0; &#x6B64;&#xFF0C;&#x4ED6;&#x5FC5;&#x987B;&#x8981;&#x4E86;&#x89E3;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x7684;&#x5404;&#x4E2A;&#x73AF;&#x8282;&#x3001;&#x4E86;&#x89E3;&#x5F00;&#x53D1;&#x7684;&#x5404;&#x79CD;&#x6280;&#x672F;&#x548C;&#x8FD0;&#x7528;&#x3001;&#x4E86;&#x89E3;&#x5F00;&#x53D1;&#x961F;&#x4F0D;&#x4EBA;&#x5458;&#x7684;&#x6C34;&#x5E73;&#x548C;&#x7279;&#x70B9;&#x3002;&#x6240;&#x4EE5;&#x4ED6;&#x4F9D;&#x65E7;&#x548C;&#x7A0B;&#x5E8F;&#x5458;&#x8131;&#x4E0D;&#x4E86;&#x5E72;&#x7CFB;&#x3002;&#x4ECE;&#x7A0B;&#x5E8F;&#x5458;&#x5230;&#x9879;&#x76EE;&#x7ECF;&#x7406;&#x53EF;&#x4EE5; &#x4F7F;&#x5F97;&#x9879;&#x76EE;&#x7ECF;&#x7406;&#x66F4;&#x597D;&#x5730;&#x7406;&#x89E3;&#x7A0B;&#x5E8F;&#x5458;&#x5728;&#x9879;&#x76EE;&#x4E2D;&#x7684;&#x5730;&#x4F4D;&#x548C;&#x4F5C;&#x7528;&#xFF0C;&#x4E86;&#x89E3;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x7684;&#x5404;&#x79CD;&#x89C4;&#x5F8B;&#x6027;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x4ECE;&#x800C;&#x4FDD;&#x8BC1;&#x9879;&#x76EE;&#x7684;&#x6B63;&#x5E38;&#x5B8C;&#x6210;&#x3002;&#x800C;&#x4E14;&#xFF0C;&#x9879;&#x76EE;&#x7ECF;&#x7406;&#x7684;&#x6536;&#x5165;&#x5728;&#x516C;&#x53F8;&#x4E2D;&#x7684;&#x5730;&#x4F4D;&#x4E5F;&#x662F; &#x6BD4;&#x8F83;&#x9AD8;&#x7684;&#x3002;&#x7A0B;&#x5E8F;&#x5458;&#x5728;&#x62C5;&#x4EFB;&#x9879;&#x76EE;&#x7ECF;&#x7406;&#x4E4B;&#x524D;&#x6700;&#x597D;&#x8981;&#x628A;&#x8F6F;&#x4EF6;&#x8BBE;&#x8BA1;&#x5DE5;&#x4F5C;&#x505A;&#x597D;&#xFF0C;&#x8FD9;&#x6837;&#x5728;&#x505A;&#x9879;&#x76EE;&#x7ECF;&#x7406;&#x7684;&#x65F6; &#x5019;&#xFF0C;&#x5C31;&#x4F1A;&#x6709;&#x5F88;&#x597D;&#x7684;&#x57FA;&#x7840;&#x3002;</p>
<p>&#x6700;&#x57FA;&#x7840;&#x7684;&#x9053;&#x7406;&#x90FD;&#x662F;&#x76F8;&#x901A;&#x7684;&#xFF0C;&#x505A;&#x4EBA;&#x662F;&#x4E00;&#x6837;&#xFF0C;&#x5199;&#x7A0B;&#x5E8F;&#x4E5F;&#x662F;&#x4E00;&#x6837;&#x3002;&#x5728;&#x4F60;&#x6210;&#x4E3A;&#x4E00;&#x540D;&#x4F18;&#x79C0;&#x7684;&#x7A0B;&#x5E8F;&#x5458;&#x4E4B;&#x524D;&#xFF0C;&#x9996;&#x5148;&#x9700;&#x8981;&#x7684;&#x4E0D;&#x662F;&#x5404;&#x79CD;&#x795E;&#x6280;&#xFF0C;&#x800C;&#x662F;&#x4E00;&#x9897;&#x8D23;&#x65E0;&#x65C1;&#x8D37;&#x7684;&#x8D23;&#x4EFB;&#x5FC3;&#xFF1A;&#x4E00;&#x65E6;&#x63A5;&#x53D7;&#x4E86;&#x67D0;&#x9879;&#x4EFB;&#x52A1;&#xFF0C;&#x5C31;&#x5E94;&#x8BE5;&#x4E3A;&#x4E4B;&#x8D1F;&#x8D77;&#x5168;&#x90E8;&#x7684;&#x8D23;&#x4EFB;&#xFF0C;&#x60F3;&#x65B9;&#x8BBE;&#x6CD5;&#x4E5F;&#x8981;&#x5C3D;&#x81EA;&#x5DF1;&#x6700;&#x5927;&#x7684;&#x52AA;&#x529B;&#x53BB;&#x5B8C;&#x6210;&#x5B83;&#xFF0C;&#x51ED;&#x4E00;&#x5DF1;&#x4E4B;&#x529B;&#x4E5F;&#x597D;&#xFF0C;&#x5BFB;&#x6C42;&#x4ED6;&#x4EBA;&#x5E2E;&#x52A9;&#x4E5F;&#x7F62;&#xFF0C;&#x8FD9;&#x90FD;&#x53EF;&#x4EE5;&#xFF0C;&#x4F46;&#x987B;&#x59CB;&#x7EC8;&#x7262;&#x8BB0;&#xFF1A;&#x6700;&#x7EC8;&#x627F;&#x62C5;&#x8D23;&#x4EFB;&#x5E76;&#x63A8;&#x52A8;&#x4EFB;&#x52A1;&#x524D;&#x8FDB;&#x7684;&#xFF0C;&#x7EDD;&#x5BF9;&#x53EA;&#x80FD;&#x662F;&#x4F60;&#x81EA;&#x5DF1;&#xFF1B;&#x5176;&#x6B21;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x8981;&#x660E;&#x767D;&#xFF0C;&#x5343;&#x91CC;&#x4E4B;&#x5824;&#x6BC1;&#x4E8E;&#x8681;&#x7A74;&#x3002;&#x5BF9;&#x8F6F;&#x4EF6;&#x4E2D;&#x5B58;&#x5728;&#x7684;&#x201C;&#x7834;&#x7A97;&#x6237;&#x201D;&#x59CB;&#x7EC8;&#x8981;&#x575A;&#x6301;&#x96F6;&#x5BB9;&#x5FCD;&#xFF0C;&#x56E0;&#x4E3A;&#x4E00;&#x65E6;&#x6709;&#x201C;&#x7834;&#x7A97;&#x6237;&#x201D;&#x51FA;&#x73B0;&#xFF0C;&#x90A3;&#x4E48;&#x8F6F;&#x4EF6;&#x9879;&#x76EE;&#x7684;&#x5931;&#x63A7;&#x901F;&#x5EA6;&#x7EDD;&#x5BF9;&#x8FDC;&#x8FDC;&#x8D85;&#x51FA;&#x4F60;&#x7684;&#x9884;&#x671F;&#xFF0C;&#x7B49;&#x4F60;&#x7F13;&#x8FC7;&#x795E;&#x6765;&#xFF0C;&#x4E00;&#x5207;&#x5DF2;&#x4E3A;&#x65F6;&#x5DF2;&#x665A;&#xFF0C;&#x5F25;&#x8865;&#x4EE3;&#x4EF7;&#x751A;&#x81F3;&#x8D85;&#x8FC7;&#x6574;&#x4E2A;&#x63A8;&#x5012;&#x91CD;&#x6765;&#x7684;&#x4EE3;&#x4EF7;&#xFF1B;&#x6700;&#x540E;&#x4E00;&#x70B9;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x662F;&#x4E00;&#x4E2A;&#x5B8C;&#x7F8E;&#x4E3B;&#x4E49;&#x8005;&#xFF0C;&#x59CB;&#x7EC8;&#x5904;&#x4E8E;&#x8FFD;&#x6C42;&#x5B8C;&#x7F8E;&#x7684;&#x9014;&#x4E2D;&#xFF0C;&#x4F46;&#x540C;&#x65F6;&#x4F60;&#x8981;&#x6DF1;&#x6DF1;&#x7684;&#x660E;&#x767D;&#xFF0C;&#x4F60;&#x6C38;&#x8FDC;&#x4E5F;&#x65E0;&#x6CD5;&#x5230;&#x8FBE;&#x5B8C;&#x7F8E;&#x7684;&#x5F7C;&#x5CB8;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#x4E0A;&#x4E0D;&#x5B58;&#x5728;&#x5B8C;&#x7F8E;&#x7684;&#x8F6F;&#x4EF6;&#xFF0C;&#x73B0;&#x5728;&#x6CA1;&#x6709;&#xFF0C;&#x4F60;&#x4E5F;&#x4E0D;&#x5927;&#x53EF;&#x80FD;&#x4F1A;&#x521B;&#x9020;&#x51FA;&#x7B2C;&#x4E00;&#x4E2A;&#xFF0C;&#x6240;&#x4EE5;&#x9700;&#x8981;&#x4F60;&#x5728;&#x9002;&#x5F53;&#x7684;&#x65F6;&#x5019;&#x4E3A;&#x4F60;&#x7684;&#x8F6F;&#x4EF6;&#x753B;&#x4E0A;&#x4F11;&#x6B62;&#x7B26;&#x3002;</p>
<p>&#x6210;&#x529F;&#x4E0E;&#x5931;&#x8D25;&#x7684;&#x533A;&#x522B;&#x5728;&#x4E8E;&#xFF0C;&#x6210;&#x529F;&#x8005;&#x9009;&#x62E9;&#x4E86;&#x6B63;&#x786E;&#x800C;&#x5931;&#x8D25;&#x8005;&#x9009;&#x62E9;&#x4E86;&#x9519;&#x8BEF;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x5E38;&#x5E38;&#x80FD;&#x591F;&#x770B;&#x5230;&#x4E00;&#x4E9B;&#x5929;&#x8D4B;&#x76F8;&#x5DEE;&#x65E0;&#x51E0;&#x7684;&#x4EBA;&#xFF0C;&#x7531;&#x4E8E;&#x9009;&#x62E9;&#x4E86;&#x4E0D;&#x540C;&#x7684;&#x65B9;&#x5411;&#xFF0C;&#x4EBA;&#x751F;&#x5374;&#x8FE5;&#x7136;&#x76F8;&#x5F02;&#x3002;&#x9009;&#x62E9;&#x6B63;&#x786E;&#x7684;&#x65B9;&#x5411;&#x5C24;&#x4E3A;&#x91CD;&#x8981;&#x3002;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x4E5F;&#x662F;&#x6709;&#x5C42;&#x6B21;&#x533A;&#x522B;&#x7684;&#xFF0C;&#x6BD4;&#x5982;&#xFF0C;&#x6309;&#x5C42;&#x6B21;&#x4ECE;&#x9AD8;&#x5230;&#x4F4E;&#x901A;&#x5E38;&#x53EF;&#x5206;&#x4E3A;&#xFF1A;&#x7CFB;&#x7EDF;&#x5F00;&#x53D1;&#xFF1A;&#x5982;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x3001;&#x6570;&#x636E;&#x5E93;&#x7CFB;&#x7EDF;&#x3001;&#x670D;&#x52A1;&#x5668;&#x7CFB;&#x7EDF;&#x5F00;&#x53D1;;&#x4E13;&#x4E1A;&#x5F00;&#x53D1;&#xFF1A;&#x5982;&#x7F51;&#x7EDC;&#x5B89;&#x5168;&#x3001;&#x6E38;&#x620F;&#x3001;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x5F00;&#x53D1;;&#x5E94;&#x7528;&#x5F00;&#x53D1;&#xFF1A;&#x5982;MIS&#x3001;BI&#x3001;ERP&#x7B49;&#x7CFB;&#x7EDF;&#x5F00;&#x53D1;;&#x666E;&#x901A;&#x5F00;&#x53D1;&#xFF1A;&#x5982;&#x7F51;&#x7AD9;&#x3001;&#x7B80;&#x5355;&#x5E94;&#x7528;&#x7CFB;&#x7EDF;&#x5F00;&#x53D1;&#x3002;&#x4E0D;&#x540C;&#x7684;&#x5C42;&#x6B21;&#xFF0C;&#x96BE;&#x5EA6;&#x7CFB;&#x6570;&#x4E0D;&#x4E00;&#x6837;&#xFF0C;&#x5BF9;&#x6280;&#x672F;&#x8981;&#x6C42;&#x3001;&#x4E2A;&#x4EBA;&#x7D20;&#x8D28;&#x8981;&#x6C42;&#x4E5F;&#x4E0D;&#x4E00;&#x6837;&#x3002;&#x8981;&#x6210;&#x4E3A;&#x7CFB;&#x7EDF;&#x5F00;&#x53D1;&#x8005;&#x3001;&#x4E13; &#x4E1A;&#x5F00;&#x53D1;&#x8005;&#x3001;&#x9AD8;&#x7EA7;&#x5E94;&#x7528;&#x5F00;&#x53D1;&#x8005;&#xFF0C;&#x9700;&#x8981;&#x6709;&#x5F88;&#x9AD8;&#x7684;&#x4E13;&#x4E1A;&#x77E5;&#x8BC6;&#x548C;&#x5F88;&#x5F3A;&#x7684;&#x903B;&#x8F91;&#x3001;&#x62BD;&#x8C61;&#x3001;&#x7A7A;&#x95F4;&#x601D;&#x7EF4;&#x80FD;&#x529B;&#xFF0C;&#x8FD9;&#x5C31;&#x8981;&#x6C42;&#x5177;&#x6709;&#x5F88;&#x597D;&#x7684;&#x57FA;&#x7840;&#xFF0C;&#x540C;&#x65F6;&#x5177;&#x6709;&#x8F83;&#x5927;&#x7684;&#x63D0;&#x5347;&#x6F5C;&#x529B;&#x3002;&#x800C;&#x8981;&#x6210;&#x4E3A;&#x7B80;&#x5355;&#x5F00;&#x53D1; &#x8005;&#x548C;&#x521D;&#x7EA7;&#x5E94;&#x7528;&#x5F00;&#x53D1;&#x8005;&#x5219;&#x76F8;&#x5BF9;&#x5BB9;&#x6613;&#x4E9B;&#xFF0C;&#x6B63;&#x662F;&#x8FD9;&#x6837;&#xFF0C;&#x624D;&#x4F7F;&#x5F88;&#x591A;&#x4EBA;&#x8D70;&#x4E0A;&#x4E86;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x7684;&#x9053;&#x8DEF;&#x3002;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1170656-e1aa69f2ec3befa0.jpg?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="&#x7A0B;&#x5E8F;"></p>

            <div class="clearfix"></div>
            <hr class="nogutter">
        </div>


        <nav class="pagination" role="pagination">


<div class="ds-share flat" data-thread-key="2015/01/03/程序员的前路/" data-title="程序员的前路" data-images="https://avatars0.githubusercontent.com/u/10378248?v=3&s=460" data-content="程序员的前路 是最近写的文章，希望能帮到您！" data-url="https://dangdangfeng.github.io/2015/01/03/程序员的前路/">
    <div class="ds-share-inline">
      <ul  class="ds-share-icons-16">
        
        <li data-toggle="ds-share-icons-more"><a class="ds-more" href="javascript:void(0);">分享到：</a></li>
        <li><a class="ds-weibo" href="javascript:void(0);" data-service="weibo">微博</a></li>
        <li><a class="ds-qzone" href="javascript:void(0);" data-service="qzone">QQ空间</a></li>
        <li><a class="ds-qqt" href="javascript:void(0);" data-service="qqt">腾讯微博</a></li>
        <li><a class="ds-wechat" href="javascript:void(0);" data-service="wechat">微信</a></li>
        
      </ul>
      <div class="ds-share-icons-more">
      </div>
    </div>
 </div>

 <br/>

    
    <a class="pull-left" href="/2015/03/25/iOS开发的奇技淫巧/" style="float: left;">
        ← iOS开发的奇技淫巧
    </a>
    
    
    <a class="pull-right" href="/2014/12/30/从UIWindow谈起/">
        从UIWindow谈起 →
    </a>
    

    
</nav>



        
        <div class="duoshuo">


<div class="ds-thread" data-thread-key="2015/01/03/程序员的前路/" data-title="程序员的前路" data-url="https://dangdangfeng.github.io/2015/01/03/程序员的前路/"></div>



<script type="text/javascript">
var duoshuoQuery = {short_name:"deter"};
(function() {
	var ds = document.createElement('script');
	ds.type = 'text/javascript';ds.async = true;
	ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
	ds.charset = 'UTF-8';
	(document.getElementsByTagName('head')[0] 
	 || document.getElementsByTagName('body')[0]).appendChild(ds);
})();
</script>
</div>
    </div>
</section>


      
<!-- ============================ Footer =========================== -->

<footer>
    <div class="container">
            <div class="copy">
                <p>
                    &copy; 2010<script>new Date().getFullYear()>2010&&document.write("-"+new Date().getFullYear());</script>, Content By 吴白. All Rights Reserved.
                </p>
                <p>Theme By <a href="//go.kieran.top" style="color: #767D84">Kieran</a></p>
            </div>
            <div class="social">
                <ul>
                    
                    <li><a href="https://github.com/" title="Github" target="_blank"><i class="icon-github"></i></a>&nbsp;</li>
                    
                    
                    <li><a href="https://twitter.com/" title="Twitter" target="_blank"><i class="icon-twitter"></i></a>&nbsp;</li>
                    
                    
                    <li><a href="https://www.facebook.com/" title="Facebook" target="_blank"><i class="icon-facebook"></i></a>&nbsp;</li>
                    
                    
                    <li><a href="https://google.com/" title="Google-Plus" target="_blank"><i class="icon-google-plus"></i></a>&nbsp;</li>
                    
                    
                    <li><a href="http://weibo.com/" title="Sina-Weibo" target="_blank"><i class="icon-sina-weibo"></i></a>&nbsp;</li>
                    
                </ul>
            </div>
            <div class="clearfix"> </div>
        </div>
</footer>

<!-- ============================ END Footer =========================== -->
      <!-- Load our scripts -->
        
<!-- Resizable 'on-demand' full-height hero -->
<script type="text/javascript">
    
    var resizeHero = function () {
        var hero = $(".cover,.heightblock"),
            window1 = $(window);
        hero.css({
            "height": window1.height()
        });
    };
    
    resizeHero();
    
    $(window).resize(function () {
        resizeHero();
    });
</script>
<script src="/js/plugins.min.js"></script><!-- Bootstrap core and concatenated plugins always load here -->
<script src="/js/jquery.flexslider-min.js"></script><!-- Flexslider plugin -->
<script src="/js/scripts.js"></script><!-- Theme scripts -->

<!-- Initiate flexslider plugin -->
<script type="text/javascript">
    $(document).ready(function($) {
      $('.flexslider').flexslider({
        animation: "fade",
        prevText: "",
        nextText: "",
        directionNav: true
      });
    });
</script>

</body>
</html>
