<!DOCTYPE html>
<!--[if lte IE 8 ]>
<html class="ie" xmlns="http://www.w3.org/1999/xhtml" xml:lang="en-US" lang="en-US">
<![endif]-->
<!--[if (gte IE 9)|!(IE)]><!-->
<!--
***************  *      *     *
      8          *    *       *
      8          *  *         *
      8          **           *
      8          *  *         *
      8          *    *       *
      8          *      *     *
      8          *        *   ***********    -----Theme By Kieran(http://go.kieran.top)
-->
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en-US" lang="en-US">
<!--<![endif]-->

<head>
  <title>如何优雅的谈论OC | 流城</title>
  <!-- Meta data -->
    <meta http-equiv="Content-Type" content="text/html" charset="UTF-8" >
    <meta http-equiv="X-UA-Compatible" content="IE=edge"/>
    <meta name="viewport" content="width=device-width, initial-scale=1.0" />
    <meta name="generator" content="流城">
    <meta name="author" content="吴白">
    <meta name="description" content="" />
    <meta name="keywords" content="" />

    <!-- Favicon, (keep icon in root folder) -->
    <link rel="Shortcut Icon" href="/img/favicon.ico" type="image/ico">

    <link rel="alternate" href="/atom.xml" title="流城" type="application/atom+xml">
    <link rel="stylesheet" href="/css/all.css" media="screen" type="text/css">
	
    <link rel="stylesheet" href="/highlightjs/vs.css" type="text/css">
    
    

    <!-- Custom stylesheet, (add custom styles here, always load last) -->
    <!-- Load our stylesheet for IE8 -->
    <!--[if IE 8]>
    <link rel="stylesheet" type="text/css" href="/css/ie8.css" />
    <![endif]-->

    <!-- Google Webfonts (Monserrat 400/700, Open Sans 400/600) -->
    <!--<link href='//fonts.useso.com/css?family=Montserrat:400,700' rel='stylesheet' type='text/css'>-->
    <!--<link href='//fonts.useso.com/css?family=Open+Sans:400,600' rel='stylesheet' type='text/css'>-->

    <!-- Load our fonts individually if IE8+, to avoid faux bold & italic rendering -->
    <!--[if IE]>
    <!--<link href='http://fonts.useso.com/css?family=Montserrat:400' rel='stylesheet' type='text/css'> -->
    <!--<link href='http://fonts.useso.com/css?family=Montserrat:700' rel='stylesheet' type='text/css'> -->
    <!--<link href='http://fonts.useso.com/css?family=Open+Sans:400' rel='stylesheet' type='text/css'>-->
    <!--<link href='http://fonts.useso.com/css?family=Open+Sans:600' rel='stylesheet' type='text/css'>-->
    <![endif]-->

    <!-- jQuery | Load our jQuery, with an alternative source fallback to a local version if request is unavailable -->
    <script src="/js/jquery-1.11.1.min.js"></script>
    <script>window.jQuery || document.write('<script src="js/jquery-1.11.1.min.js"><\/script>')</script>

    <!-- Load these in the <head> for quicker IE8+ load times -->
    <!-- HTML5 shim and Respond.js IE8 support of HTML5 elements and media queries -->
    <!--[if lt IE 9]>
    <script src="/js/html5shiv.min.js"></script>
    <script src="/js/respond.min.js"></script>
    <![endif]-->










  
  
  <link rel="alternate" type="application/atom+xml" title="Atom 0.3" href="atom.xml">
  
  

  
  <style>.col-md-8.col-md-offset-2.opening-statement img{display:none;}</style>
</head>

<!--
<body class="post-template">
-->
<body id="index" class="lightnav animsition">

      <!-- ============================ Off-canvas navigation =========================== -->

    <div class="sb-slidebar sb-right sb-style-overlay sb-momentum-scrolling">
        <div class="sb-close" aria-label="Close Menu" aria-hidden="true">
            <img src="/img/close.png" alt="Close"/>
        </div>
        <!-- Lists in Slidebars -->
        <ul class="sb-menu">
            <li><a href="/" class="animsition-link" title="Home">Home</a></li>
            <li><a href="/archives" class="animsition-link" title="archive">archives</a></li>
            <!-- Dropdown Menu -->
			 
            <li>
                <a class="sb-toggle-submenu">Works<span class="sb-caret"></span></a>
                <ul class="sb-submenu">
                    
                        <li><a href="http://www.gome.com.cn" target="_BLANK" class="animsition-link">Gome</a></li>
                    
                        <li><a href="http://www.yintai.com" target="_BLANK" class="animsition-link">YinTai</a></li>
                    
                </ul>
            </li>
            
            
            
            <li>
                <a class="sb-toggle-submenu">Links<span class="sb-caret"></span></a>
                <ul class="sb-submenu">
                    
                    <li><a href="http://www.jianshu.com/users/211925b3ca7c/latest_articles" class="animsition-link">吴白</a></li>
                    
                    <li><a href="http://www.jianshu.com/users/19f4bf67c705/latest_articles" class="animsition-link">吴禅</a></li>
                    
                </ul>
            </li>
            
        </ul>
        <!-- Lists in Slidebars -->
        <ul class="sb-menu secondary">
            <li><a href="/about" class="animsition-link" title="about">About</a></li>
            <li><a href="/atom.xml" class="animsition-link" title="rss">RSS</a></li>
        </ul>
    </div>
    
    <!-- ============================ END Off-canvas navigation =========================== -->

    <!-- ============================ #sb-site Main Page Wrapper =========================== -->

    <div id="sb-site">
        <!-- #sb-site - All page content should be contained within this id, except the off-canvas navigation itself -->

        <!-- ============================ Header & Logo bar =========================== -->

        <div id="navigation" class="navbar navbar-fixed-top">
            <div class="navbar-inner">
                <div class="container">
                    <!-- Nav logo -->
                    <div class="logo">
                        <a href="/" title="Logo" class="animsition-link">
                         <img src="/img/logo.png" alt="Logo" width="35px;"/> 
                        </a>
                    </div>
                    <!-- // Nav logo -->
                    <!-- Info-bar -->
                    <nav>
                        <ul class="nav">
                            <li><a href="/" class="animsition-link">流城</a></li>
                            <li class="nolink"><span>Always </span>Creative.</li>
                            
                            <li><a href="https://github.com/" title="Github" target="_blank"><i class="icon-github"></i></a></li>
                            
                            
                            <li><a href="https://twitter.com/" title="Twitter" target="_blank"><i class="icon-twitter"></i></a></li>
                            
                            
                            <li><a href="https://www.facebook.com/" title="Facebook" target="_blank"><i class="icon-facebook"></i></a></li>
                            
                            
                            <li><a href="https://google.com/" title="Google-Plus" target="_blank"><i class="icon-google-plus"></i></a></li>
                            
                            
                            <li><a href="http://weibo.com/" title="Sina-Weibo" target="_blank"><i class="icon-sina-weibo"></i></a></li>
                            
                            <li class="nolink"><span>Welcome!</span></li>
                        </ul>
                    </nav>
                    <!--// Info-bar -->
                </div>
                <!-- // .container -->
                <div class="learnmore sb-toggle-right">More</div>
                <button type="button" class="navbar-toggle menu-icon sb-toggle-right" title="More">
                <span class="sr-only">Toggle navigation</span>
                <span class="icon-bar before"></span>
                <span class="icon-bar main"></span>
                <span class="icon-bar after"></span>
                </button>
            </div>
            <!-- // .navbar-inner -->
        </div>

        <!-- ============================ Header & Logo bar =========================== -->


      
<section id="intro">
    <div class="container">
        <div class="row col-md-offset-2">
            <div class="col-md-8">
    			<span class="post-meta">
      <time datetime="2014-08-30T15:35:30.000Z" itemprop="datePublished">
          2014-08-30
      </time>
    
    
    | 
    <a href='/tags/technology/'>technology</a>
    
    
</span>
                <h1>如何优雅的谈论OC</h1>
            </div>
        </div>
        <!--<div class="col-md-8 col-md-offset-2">-->
        <div class="col-md-offset-2">
      		<p>&#x672C;&#x6587;&#x5305;&#x62EC;&#xFF1A;</p>
<ul>
<li>OC&#x7684;&#x9762;&#x5411;&#x5BF9;&#x8C61;</li>
<li>&#x8FD0;&#x884C;&#x65F6;Runtime</li>
<li>&#x8FD0;&#x884C;&#x5FAA;&#x73AF;RunLoop</li>
<li>&#x4E8B;&#x4EF6;&#x54CD;&#x5E94;&#x94FE;</li>
<li>&#x5F15;&#x7528;&#x8BA1;&#x6570;</li>
<li>&#x751F;&#x547D;&#x5468;&#x671F;</li>
<li>&#x4E0E;&#x5176;&#x4ED6;&#x8BED;&#x8A00;&#x7684;&#x533A;&#x522B;</li>
</ul>
<hr>
<p>Objective-C &#x7B80;&#x79F0;OC&#xFF08;&#x4E0B;&#x9762;&#x4EE5;&#x6B64;&#x4EE3;&#x79F0;&#xFF09;&#xFF0C;&#x662F;&#x5728;C&#x8BED;&#x8A00;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#xFF0C;&#x589E;&#x52A0;&#x4E86;&#x4E00;&#x5C42;&#x6700;&#x5C0F;&#x7684;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x8BED;&#x8A00;&#x3002;&#x662F;&#x4E00;&#x79CD;&#x9759;&#x6001;&#x8F93;&#x5165;&#x7684;&#x8BED;&#x8A00;&#xFF0C;&#x5373;&#x201C;&#x5FC5;&#x987B;&#x5148;&#x58F0;&#x660E;&#x6570;&#x636E;&#x4E2D;&#x6BCF;&#x4E2A;&#x53D8;&#x91CF;&#xFF08;&#x6216;&#x8005;&#x5BB9;&#x5668;&#xFF09;&#x7684;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x201D;&#x3002;&#x4F46;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x52A8;&#x6001;&#x8BED;&#x8A00;&#xFF0C;&#x4EE3;&#x7801;&#x4E2D;&#x7684;&#x67D0;&#x4E00;&#x90E8;&#x5206;&#x53EF;&#x4EE5;&#x5728;app&#x8FD0;&#x884C;&#x7684;&#x65F6;&#x5019;&#x88AB;&#x6269;&#x5C55;&#x548C;&#x4FEE;&#x6539;&#xFF08;&#x6BD4;&#x5982;&#xFF0C;&#x5728;&#x88AB;&#x7F16;&#x8BD1;&#x4E4B;&#x540E;&#xFF09;&#x3002;OC&#x5B8C;&#x5168;&#x517C;&#x5BB9;C&#x8BED;&#x8A00;&#xFF0C;&#x5728;&#x4EE3;&#x7801;&#x4E2D;&#xFF0C;&#x53EF;&#x4EE5;&#x6DF7;&#x7528;c&#xFF0C;&#x751A;&#x81F3;&#x662F;c++&#x4EE3;&#x7801;&#x3002;</p>
<h3 id="&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x4E09;&#x539F;&#x5219;&#xFF08;&#x5C01;&#x88C5;&#xFF0C;&#x7EE7;&#x627F;&#xFF0C;&#x591A;&#x6001;&#xFF09;"><a href="#&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x4E09;&#x539F;&#x5219;&#xFF08;&#x5C01;&#x88C5;&#xFF0C;&#x7EE7;&#x627F;&#xFF0C;&#x591A;&#x6001;&#xFF09;" class="headerlink" title="&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x4E09;&#x539F;&#x5219;&#xFF08;&#x5C01;&#x88C5;&#xFF0C;&#x7EE7;&#x627F;&#xFF0C;&#x591A;&#x6001;&#xFF09;"></a>&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x4E09;&#x539F;&#x5219;&#xFF08;&#x5C01;&#x88C5;&#xFF0C;&#x7EE7;&#x627F;&#xFF0C;&#x591A;&#x6001;&#xFF09;</h3><p>&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x5177;&#x6709;&#x56DB;&#x4E2A;&#x57FA;&#x672C;&#x7279;&#x5F81;&#xFF1A;&#x62BD;&#x8C61;&#xFF0C;&#x5C01;&#x88C5;&#xFF0C;&#x7EE7;&#x627F;&#x548C;&#x591A;&#x6001;&#x3002;</p>
<p>C&#x8BED;&#x8A00;&#x662F;&#x9762;&#x5411;&#x8FC7;&#x7A0B;&#x7684;&#x8BED;&#x8A00;(&#x5173;&#x6CE8;&#x7684;&#x662F;&#x51FD;&#x6570;)&#xFF0C;OC,C++,JAVA,C#,PHP,Swift&#x662F;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#xFF0C;&#x9762;&#x5411;&#x8FC7;&#x7A0B;&#x5173;&#x6CE8;&#x7684;&#x662F;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x6D89;&#x53CA;&#x7684;&#x6B65;&#x9AA4;&#xFF0C;&#x800C;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x5173;&#x6CE8;&#x7684;&#x662F;&#x8BBE;&#x8BA1;&#x80FD;&#x591F;&#x5B9E;&#x73B0;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#x6240;&#x9700;&#x529F;&#x80FD;&#x7684;&#x7C7B;&#x3002;&#x62BD;&#x8C61;&#x662F;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684;&#x601D;&#x60F3;&#x57FA;&#x7840;&#x3002;</p>
<p>&#x62BD;&#x8C61;&#x5305;&#x62EC;&#x4E24;&#x4E2A;&#x65B9;&#x9762;&#xFF0C;&#x4E00;&#x662F;&#x8FC7;&#x7A0B;&#x62BD;&#x8C61;&#xFF0C;&#x4E8C;&#x662F;&#x6570;&#x636E;&#x62BD;&#x8C61;&#x3002;&#x8FC7;&#x7A0B;&#x62BD;&#x8C61;&#x662F;&#x6307;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x660E;&#x786E;&#x5B9A;&#x4E49;&#x529F;&#x80FD;&#x7684;&#x64CD;&#x4F5C;&#x90FD;&#x53EF;&#x88AB;&#x4F7F;&#x7528;&#x8005;&#x770B;&#x4F5C;&#x5355;&#x4E2A;&#x7684;&#x5B9E;&#x4F53;&#x770B;&#x5F85;&#xFF0C;&#x5C3D;&#x7BA1;&#x8FD9;&#x4E2A;&#x64CD;&#x4F5C;&#x5B9E;&#x9645;&#x4E0A;&#x53EF;&#x80FD;&#x7531;&#x4E00;&#x7CFB;&#x5217;&#x66F4;&#x4F4E;&#x7EA7;&#x7684;&#x64CD;&#x4F5C;&#x6765;&#x5B8C;&#x6210;&#x3002;&#x6570;&#x636E;&#x62BD;&#x8C61;&#x5B9A;&#x4E49;&#x4E86;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x548C;&#x65BD;&#x52A0;&#x4E8E;&#x8BE5;&#x7C7B;&#x578B;&#x5BF9;&#x8C61;&#x4E0A;&#x7684;&#x64CD;&#x4F5C;&#xFF0C;&#x5E76;&#x9650;&#x5B9A;&#x4E86;&#x5BF9;&#x8C61;&#x7684;&#x503C;&#x53EA;&#x80FD;&#x901A;&#x8FC7;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x64CD;&#x4F5C;&#x4FEE;&#x6539;&#x548C;&#x89C2;&#x5BDF;&#x3002;&#x62BD;&#x8C61;&#x662F;&#x4E00;&#x79CD;&#x601D;&#x60F3;&#xFF0C;&#x5C01;&#x88C5;&#x7EE7;&#x627F;&#x548C;&#x591A;&#x6001;&#x662F;&#x8FD9;&#x79CD;&#x601D;&#x60F3;&#x7684;&#x5B9E;&#x73B0;&#x3002;</p>
<h5 id="&#x5C01;&#x88C5;"><a href="#&#x5C01;&#x88C5;" class="headerlink" title="&#x5C01;&#x88C5;"></a>&#x5C01;&#x88C5;</h5><p>&#x5C01;&#x88C5;&#x662F;&#x628A;&#x8FC7;&#x7A0B;&#x548C;&#x6570;&#x636E;&#x5305;&#x56F4;&#x8D77;&#x6765;&#xFF08;&#x5373;&#x51FD;&#x6570;&#x548C;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x51FD;&#x6570;&#x662F;&#x884C;&#x4E3A;&#xFF0C;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x662F;&#x63CF;&#x8FF0;&#xFF09;&#xFF0C;&#x6709;&#x9650;&#x5236;&#x7684;&#x5BF9;&#x6570;&#x636E;&#x7684;&#x8BBF;&#x95EE;&#x3002;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x57FA;&#x4E8E;&#x8FD9;&#x4E2A;&#x57FA;&#x672C;&#x6982;&#x5FF5;&#x5F00;&#x59CB;&#x7684;&#xFF08;<em>&#x56E0;&#x4E3A;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x66F4;&#x6CE8;&#x91CD;&#x7684;&#x662F;&#x7C7B;</em>&#xFF09;&#xFF0C;&#x5373;&#x73B0;&#x5B9E;&#x4E16;&#x754C;&#x53EF;&#x4EE5;&#x88AB;&#x63CF;&#x7ED8;&#x6210;&#x4E00;&#x7CFB;&#x5217;&#x5B8C;&#x5168;&#x81EA;&#x6CBB;&#x3001;&#x5C01;&#x88C5;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x8FD9;&#x4E9B;&#x5BF9;&#x8C61;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x53D7;&#x4FDD;&#x62A4;&#x7684;&#x63A5;&#x53E3;&#x8BBF;&#x95EE;&#x5176;&#x4ED6;&#x5BF9;&#x8C61;&#x3002;&#x4E00;&#x65E6;&#x5B9A;&#x4E49;&#x4E86;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x7279;&#x6027;&#xFF0C;&#x5219;&#x6709;&#x5FC5;&#x8981;&#x51B3;&#x5B9A;&#x8FD9;&#x4E9B;&#x7279;&#x6027;&#x7684;&#x53EF;&#x89C1;&#x6027;&#xFF0C;&#x5C01;&#x88C5;&#x4FDD;&#x8BC1;&#x4E86;&#x6A21;&#x5757;&#x5177;&#x6709;&#x8F83;&#x597D;&#x7684;&#x72EC;&#x7ACB;&#x6027;&#xFF0C;&#x4F7F;&#x5F97;&#x7A0B;&#x5E8F;&#x7EF4;&#x62A4;&#x4FEE;&#x6539;&#x8F83;&#x4E3A;&#x5BB9;&#x6613;&#x3002;&#x5BF9;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x4FEE;&#x6539;&#x4EC5;&#x9650;&#x4E8E;&#x7C7B;&#x7684;&#x5185;&#x90E8;&#xFF0C;&#x56E0;&#x800C;&#x53EF;&#x4EE5;&#x5C06;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4FEE;&#x6539;&#x5E26;&#x6765;&#x7684;&#x5F71;&#x54CD;&#x51CF;&#x5C11;&#x5230;&#x6700;&#x4F4E;&#x9650;&#x5EA6;&#x3002;&#x4F46;&#x662F;&#x5C01;&#x88C5;&#x4F1A;&#x5BFC;&#x81F4;&#x5E76;&#x884C;&#x6548;&#x7387;&#x95EE;&#x9898;&#xFF0C;&#x56E0;&#x4E3A;&#x6267;&#x884C;&#x90E8;&#x5206;&#x548C;&#x6570;&#x636E;&#x90E8;&#x5206;&#x88AB;&#x7ED1;&#x5B9A;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x5236;&#x7EA6;&#x4E86;&#x5E76;&#x884C;&#x7A0B;&#x5EA6;&#x3002;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x601D;&#x60F3;&#x5C06;&#x51FD;&#x6570;&#x548C;&#x6570;&#x636E;&#x7ED1;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x6269;&#x5927;&#x4E86;&#x4EE3;&#x7801;&#x91CD;&#x7528;&#x65F6;&#x7684;&#x7C92;&#x5EA6;&#x3002;&#x800C;&#x4E14;&#x5C01;&#x88C5;&#x4E0B;&#x7684;&#x62C6;&#x7BB1;&#x88C5;&#x7BB1;&#x8FC7;&#x7A0B;&#x4E2D;&#x4E5F;&#x4F1A;&#x5BFC;&#x81F4;&#x5185;&#x5B58;&#x7684;&#x6D6A;&#x8D39;&#x3002;</p>
<h5 id="&#x7EE7;&#x627F;"><a href="#&#x7EE7;&#x627F;" class="headerlink" title="&#x7EE7;&#x627F;"></a>&#x7EE7;&#x627F;</h5><p>&#x7EE7;&#x627F;&#x662F;&#x4E00;&#x79CD;&#x5C42;&#x6B21;&#x6A21;&#x578B;&#xFF0C;&#x5141;&#x8BB8;&#x548C;&#x9F13;&#x52B1;&#x7C7B;&#x7684;<em>&#x91CD;&#x7528;</em>&#xFF0C;&#x5E76;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x79CD;&#x660E;&#x786E;&#x8868;&#x8FF0;<em>&#x5171;&#x6027;</em>&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x65B0;&#x7C7B;&#x7EE7;&#x627F;&#x4E86;&#x539F;&#x59CB;&#x7C7B;&#x7684;&#x7279;&#x6027;&#xFF0C;&#x65B0;&#x7C7B;&#x79F0;&#x4E3A;&#x539F;&#x59CB;&#x7C7B;&#x7684;&#x6D3E;&#x751F;&#x7C7B;&#xFF08;&#x5B50;&#x7C7B;&#x548C;&#x7236;&#x7C7B;&#xFF09;&#x3002;&#x6D3E;&#x751F;&#x7C7B;&#x53EF;&#x4EE5;&#x4ECE;&#x5B83;&#x7684;&#x57FA;&#x7C7B;&#x90A3;&#x91CC;&#x7EE7;&#x627F;&#x65B9;&#x6CD5;&#x548C;&#x5B9E;&#x4F8B;&#x53D8;&#x91CF;&#xFF0C;&#x5E76;&#x4E14;&#x7C7B;&#x53EF;&#x4EE5;&#x4FEE;&#x6539;&#x6216;&#x589E;&#x52A0;&#x65B0;&#x7684;&#x65B9;&#x6CD5;&#x4F7F;&#x4E4B;&#x66F4;&#x9002;&#x5408;&#x7279;&#x6B8A;&#x7684;&#x9700;&#x8981;&#x3002;&#x7EE7;&#x627F;&#x6027;&#x5F88;&#x597D;&#x7684;&#x89E3;&#x51B3;&#x4E86;&#x8F6F;&#x4EF6;&#x7684;&#x53EF;&#x91CD;&#x7528;&#x6027;&#x95EE;&#x9898;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x4E0D;&#x6070;&#x5F53;&#x5730;&#x4F7F;&#x7528;&#x7EE7;&#x627F;&#x5BFC;&#x81F4;&#x7684;&#x6700;&#x5927;&#x7684;&#x4E00;&#x4E2A;&#x7F3A;&#x9677;&#x7279;&#x5F81;&#x5C31;&#x662F;&#x9AD8;&#x8026;&#x5408;&#xFF08;&#x5373;&#x201C;&#x7275;&#x4E00;&#x53D1;&#x800C;&#x52A8;&#x5168;&#x8EAB;&#x201D;&#xFF0C;&#x662F;&#x8BBE;&#x8BA1;&#x7C7B;&#x65F6;<em>&#x5C42;&#x6B21;</em>&#x6CA1;&#x5206;&#x6E05;&#x5BFC;&#x81F4;&#x7684;&#xFF09;&#x3002;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x662F;&#x7528;&#x7EC4;&#x5408;&#x66FF;&#x4EE3;&#x7EE7;&#x627F;&#x3002;&#x5C06;&#x6A21;&#x5757;&#x62C6;&#x5F00;&#xFF0C;&#x7136;&#x540E;&#x901A;&#x8FC7;&#x5B9A;&#x4E49;&#x597D;&#x7684;&#x63A5;&#x53E3;&#x8FDB;&#x884C;&#x4EA4;&#x4E92;&#xFF0C;&#x4E00;&#x822C;&#x6765;&#x8BF4;&#x53EF;&#x4EE5;&#x9009;&#x62E9;Delegate&#x6A21;&#x5F0F;&#x6765;&#x4EA4;&#x4E92;&#x3002;&#x4F7F;&#x7528;&#x7EE7;&#x627F;&#x5176;&#x5B9E;&#x662F;&#x5982;&#x4F55;&#x7ED9;&#x4E00;&#x7C7B;&#x5BF9;&#x8C61;&#x5212;&#x5206;&#x5C42;&#x6B21;&#x7684;&#x95EE;&#x9898;&#x3002;&#x5728;&#x6B63;&#x786E;&#x7684;&#x7EE7;&#x627F;&#x65B9;&#x5F0F;&#x4E2D;&#xFF0C;&#x7236;&#x7C7B;&#x5E94;&#x5F53;&#x626E;&#x6F14;&#x7684;&#x662F;&#x5E95;&#x5C42;&#x7684;&#x89D2;&#x8272;&#xFF0C;&#x5B50;&#x7C7B;&#x662F;&#x4E0A;&#x5C42;&#x7684;&#x4E1A;&#x52A1;&#x3002;&#x7236;&#x7C7B;&#x53EA;&#x662F;&#x7ED9;&#x5B50;&#x7C7B;&#x63D0;&#x4F9B;&#x670D;&#x52A1;&#xFF0C;&#x5E76;&#x4E0D;&#x6D89;&#x53CA;&#x5B50;&#x7C7B;&#x7684;&#x4E1A;&#x52A1;&#x903B;&#x8F91;&#xFF1B;&#x5C42;&#x7EA7;&#x5173;&#x7CFB;&#x660E;&#x663E;&#xFF0C;&#x529F;&#x80FD;&#x5212;&#x5206;&#x6E05;&#x6670;&#xFF1B;&#x7236;&#x7C7B;&#x7684;&#x6240;&#x6709;&#x53D8;&#x5316;&#xFF0C;&#x90FD;&#x9700;&#x8981;&#x5728;&#x5B50;&#x7C7B;&#x4E2D;&#x4F53;&#x73B0;&#xFF0C;&#x6B64;&#x65F6;&#x8026;&#x5408;&#x5DF2;&#x7ECF;&#x6210;&#x4E3A;&#x9700;&#x6C42;&#x3002;</p>
<h5 id="&#x591A;&#x6001;"><a href="#&#x591A;&#x6001;" class="headerlink" title="&#x591A;&#x6001;"></a>&#x591A;&#x6001;</h5><p>&#x591A;&#x6001;&#x6027;&#x662F;&#x6307;&#x5141;&#x8BB8;&#x4E0D;&#x540C;&#x7C7B;&#x7684;&#x5BF9;&#x8C61;&#x5BF9;&#x540C;&#x4E00;&#x6D88;&#x606F;&#x4F5C;&#x51FA;&#x54CD;&#x5E94;&#x3002;&#x591A;&#x6001;&#x6027;&#x5305;&#x62EC;<em>&#x53C2;&#x6570;&#x5316;&#x591A;&#x6001;&#x6027;&#x548C;&#x5305;&#x542B;&#x591A;&#x6001;&#x6027;</em>&#x3002;&#x5F88;&#x597D;&#x7684;&#x89E3;&#x51B3;&#x4E86;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x51FD;&#x6570;&#x540C;&#x540D;&#x95EE;&#x9898;&#xFF0C;&#x591A;&#x6001;&#x4E00;&#x822C;&#x90FD;&#x8981;&#x8DDF;&#x7EE7;&#x627F;&#x7ED3;&#x5408;&#x8D77;&#x6765;&#x8BF4;&#xFF0C;&#x5176;&#x672C;&#x8D28;&#x662F;&#x5B50;&#x7C7B;&#x901A;&#x8FC7;&#x8986;&#x76D6;&#x6216;&#x91CD;&#x8F7D;&#x7236;&#x7C7B;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x6765;&#x4F7F;&#x5F97;&#x5BF9;&#x540C;&#x4E00;&#x7C7B;&#x5BF9;&#x8C61;&#x540C;&#x4E00;&#x65B9;&#x6CD5;&#x7684;&#x8C03;&#x7528;&#x4EA7;&#x751F;&#x4E0D;&#x540C;&#x7684;&#x7ED3;&#x679C;&#x3002;&#x8986;&#x76D6;&#x662F;&#x5BF9;&#x63A5;&#x53E3;&#x65B9;&#x6CD5;&#x7684;&#x5B9E;&#x73B0;&#xFF0C;&#x7EE7;&#x627F;&#x4E2D;&#x4E5F;&#x53EF;&#x80FD;&#x4F1A;&#x5728;&#x5B50;&#x7C7B;&#x8986;&#x76D6;&#x7236;&#x7C7B;&#x4E2D;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x91CD;&#x8F7D;&#xFF0C;&#x662F;&#x6307;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5B9A;&#x4E49;&#x4E00;&#x4E9B;&#x540D;&#x79F0;&#x76F8;&#x540C;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x901A;&#x8FC7;&#x5B9A;&#x4E49;&#x4E0D;&#x540C;&#x7684;&#x8F93;&#x5165;&#x53C2;&#x6570;&#x6765;&#x533A;&#x5206;&#x8FD9;&#x4E9B;&#x65B9;&#x6CD5;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x8C03;&#x7528;&#x65F6;&#xFF0C;VM&#x5C31;&#x4F1A;&#x6839;&#x636E;&#x4E0D;&#x540C;&#x7684;&#x53C2;&#x6570;&#x6837;&#x5F0F;&#xFF0C;&#x6765;&#x9009;&#x62E9;&#x5408;&#x9002;&#x7684;&#x65B9;&#x6CD5;&#x6267;&#x884C;&#x3002;&#x5728;&#x4F7F;&#x7528;&#x91CD;&#x8F7D;&#x65F6;&#x53EA;&#x80FD;&#x901A;&#x8FC7;&#x4E0D;&#x540C;&#x7684;&#x53C2;&#x6570;&#x6837;&#x5F0F;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x53C2;&#x6570;&#x7C7B;&#x578B;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x53C2;&#x6570;&#x4E2A;&#x6570;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x53C2;&#x6570;&#x987A;&#x5E8F;&#xFF08;&#x5F53;&#x7136;&#xFF0C;&#x540C;&#x4E00;&#x65B9;&#x6CD5;&#x5185;&#x7684;&#x51E0;&#x4E2A;&#x53C2;&#x6570;&#x7C7B;&#x578B;&#x5FC5;&#x987B;&#x4E0D;&#x4E00;&#x6837;&#xFF09;&#xFF1B; &#x4F46;&#x7EE7;&#x627F;&#x4F1A;&#x5F15;&#x5165;&#x591A;&#x6001;&#x4F7F;&#x7528;&#x6DF7;&#x4E71;&#x7684;&#x5883;&#x51B5;&#x5E76;&#x4EA7;&#x751F;&#x8026;&#x5408;&#xFF0C;&#x66F4;&#x597D;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x4F7F;&#x7528;&#x63A5;&#x53E3;&#x3002;&#x901A;&#x8FC7;IOP&#x5C06;&#x5B50;&#x7C7B;&#x4E0E;&#x53EF;&#x80FD;&#x88AB;&#x5B50;&#x7C7B;&#x5F15;&#x5165;&#x7684;&#x4E0D;&#x76F8;&#x5173;&#x903B;&#x8F91;&#x5265;&#x79BB;&#x5F00;&#x6765;&#xFF0C;&#x63D0;&#x9AD8;&#x4E86;&#x5B50;&#x7C7B;&#x7684;&#x53EF;&#x91CD;&#x7528;&#x6027;&#xFF0C;&#x964D;&#x4F4E;&#x4E86;&#x8FC1;&#x79FB;&#x65F6;&#x53EF;&#x80FD;&#x7684;&#x8026;&#x5408;&#x3002;&#x63A5;&#x53E3;&#x89C4;&#x8303;&#x4E86;&#x5B50;&#x7C7B;&#x54EA;&#x4E9B;&#x5FC5;&#x987B;&#x5B9E;&#x73B0;&#xFF0C;&#x54EA;&#x4E9B;&#x53EF;&#x9009;&#x5B9E;&#x73B0;&#x3002;&#x90A3;&#x4E9B;&#x4E0D;&#x5728;&#x63A5;&#x53E3;&#x5B9A;&#x4E49;&#x7684;&#x65B9;&#x6CD5;&#x5217;&#x8868;&#x91CC;&#x7684;&#x7236;&#x7C7B;&#x65B9;&#x6CD5;&#xFF0C;&#x4E8B;&#x5B9E;&#x4E0A;&#x5C31;&#x662F;&#x4E0D;&#x5EFA;&#x8BAE;&#x8986;&#x91CD;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x5982;&#x679C;&#x5F15;&#x5165;&#x591A;&#x6001;&#x4E4B;&#x540E;&#x5BFC;&#x81F4;&#x5BF9;&#x8C61;&#x89D2;&#x8272;&#x4E0D;&#x591F;&#x5355;&#x7EAF;&#xFF0C;&#x90A3;&#x5C31;&#x4E0D;&#x5E94;&#x5F53;&#x5F15;&#x5165;&#x591A;&#x6001;&#xFF0C;&#x5982;&#x679C;&#x5F15;&#x5165;&#x591A;&#x6001;&#x4E4B;&#x540E;&#x4F9D;&#x65E7;&#x662F;&#x5355;&#x7EAF;&#x89D2;&#x8272;&#xFF0C;&#x90A3;&#x5C31;&#x53EF;&#x4EE5;&#x5F15;&#x5165;&#x591A;&#x6001;&#xFF1B;&#x5982;&#x679C;&#x8981;&#x8986;&#x91CD;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x89D2;&#x8272;&#x4E1A;&#x52A1;&#x7684;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x7EC4;&#x6210;&#x90E8;&#x5206;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x6700;&#x597D;&#x4E0D;&#x8981;&#x7528;&#x591A;&#x6001;&#x7684;&#x65B9;&#x6848;&#xFF0C;&#x7528;IOP&#xFF0C;&#x56E0;&#x4E3A;&#x5728;&#x5916;&#x754C;&#x8C03;&#x7528;&#x7684;&#x65F6;&#x5019;&#x5176;&#x5B9E;&#x5E76;&#x4E0D;&#x9700;&#x8981;&#x901A;&#x8FC7;&#x591A;&#x6001;&#x6765;&#x6EE1;&#x8DB3;&#x5B9A;&#x5236;&#x5316;&#x7684;&#x9700;&#x6C42;&#x3002;</p>
<h3 id="&#x52A8;&#x6001;&#x6027;&#xFF08;Runtime&#xFF09;"><a href="#&#x52A8;&#x6001;&#x6027;&#xFF08;Runtime&#xFF09;" class="headerlink" title="&#x52A8;&#x6001;&#x6027;&#xFF08;Runtime&#xFF09;"></a>&#x52A8;&#x6001;&#x6027;&#xFF08;Runtime&#xFF09;</h3><p>Objective-C &#x662F;&#x9762;&#x76F8;&#x8FD0;&#x884C;&#x65F6;&#x7684;&#x8BED;&#x8A00;&#xFF0C;&#x5B83;&#x4F1A;&#x5C3D;&#x53EF;&#x80FD;&#x7684;&#x628A;&#x7F16;&#x8BD1;&#x548C;&#x94FE;&#x63A5;&#x65F6;&#x8981;&#x6267;&#x884C;&#x7684;&#x903B;&#x8F91;&#x5EF6;&#x8FDF;&#x5230;&#x8FD0;&#x884C;&#x65F6;&#x3002;&#x4F7F;&#x7528;Runtime&#x53EF;&#x4EE5;&#x6309;&#x9700;&#x8981;&#x628A;&#x6D88;&#x606F;&#x91CD;&#x5B9A;&#x5411;&#x7ED9;&#x5408;&#x9002;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x4EA4;&#x6362;&#x65B9;&#x6CD5;&#x7684;&#x5B9E;&#x73B0;&#x7B49;&#x7B49;&#x3002;</p>
<p>Runtime&#x7B80;&#x79F0;&#x8FD0;&#x884C;&#x65F6;&#xFF0C;&#x5176;&#x4E2D;&#x6700;&#x4E3B;&#x8981;&#x7684;&#x662F;&#x6D88;&#x606F;&#x673A;&#x5236;&#xFF0C;&#x662F;&#x4E00;&#x4E2A;&#x4E3B;&#x8981;&#x4F7F;&#x7528; C &#x548C;&#x6C47;&#x7F16;&#x5199;&#x7684;&#x5E93;&#xFF0C;&#x4E3A; C &#x6DFB;&#x52A0;&#x4E86;&#x9762;&#x76F8;&#x5BF9;&#x8C61;&#x7684;&#x80FD;&#x529B;&#x5E76;&#x521B;&#x9020;&#x4E86; Objective-C&#x3002;&#x3002;OC&#x7684;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x79F0;&#x4E3A;&#x6D88;&#x606F;&#x53D1;&#x9001;&#x3002;&#x5C5E;&#x4E8E;&#x52A8;&#x6001;&#x8C03;&#x7528;&#x8FC7;&#x7A0B;&#x3002;&#x5728;&#x7F16;&#x8BD1;&#x7684;&#x65F6;&#x5019;&#x5E76;&#x4E0D;&#x80FD;&#x51B3;&#x5B9A;&#x771F;&#x6B63;&#x8C03;&#x7528;&#x54EA;&#x4E2A;&#x51FD;&#x6570;&#xFF08;&#x5728;&#x7F16; &#x8BD1;&#x9636;&#x6BB5;&#xFF0C;OC&#x53EF;&#x4EE5;&#x8C03;&#x7528;&#x4EFB;&#x4F55;&#x51FD;&#x6570;&#xFF0C;&#x5373;&#x4F7F;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x5E76;&#x672A;&#x5B9E;&#x73B0;&#xFF0C;&#x53EA;&#x8981;&#x58F0;&#x660E;&#x8FC7;&#x5C31;&#x4E0D;&#x4F1A;&#x62A5;&#x9519;&#x3002;&#x800C;C&#x8BED;&#x8A00;&#x5728;&#x7F16;&#x8BD1;&#x9636;&#x6BB5;&#x5C31;&#x4F1A;&#x62A5;&#x9519;&#xFF09;&#x3002;&#x53EA;&#x6709;&#x5728;&#x771F;&#x6B63;&#x8FD0;&#x884C;&#x7684;&#x65F6;&#x5019;&#x624D;&#x4F1A;&#x6839;&#x636E;&#x51FD;&#x6570;&#x7684;&#x540D;&#x79F0;&#x627E; &#x5230;&#x5BF9;&#x5E94;&#x7684;&#x51FD;&#x6570;&#x6765;&#x8C03;&#x7528;&#x3002;</p>
<p>&#x5982;&#xFF1A;</p>
<pre><code>[obj makeText];
&#xFF1D;&#xFF1D;&#x300B;
objc_msgSend(obj,@selector(makeText));
</code></pre><p>&#x7F16;&#x8BD1;&#x5668;&#x6267;&#x884C;&#x4E0A;&#x8FF0;&#x8F6C;&#x6362;&#x3002;&#x5728;objc_msgSend&#x51FD;&#x6570;&#x4E2D;&#xFF0C;&#x9996;&#x5148;&#x901A;&#x8FC7;obj&#x7684;isa&#x6307;&#x9488;&#x627E;&#x5230;obj&#x5BF9;&#x5E94;&#x7684;class&#x3002;&#x6BCF;&#x4E2A;&#x5BF9;&#x8C61;&#x5185;&#x90E8;&#x90FD;&#x9ED8;&#x8BA4;&#x6709;&#x4E00;&#x4E2A;isa&#x6307;&#x9488;&#x6307;&#x5411;&#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#x6240;&#x4F7F;&#x7528;&#x7684;&#x7C7B;&#x3002;isa&#x662F;&#x5BF9;&#x8C61;&#x4E2D;&#x7684;&#x9690;&#x85CF;&#x6307;&#x9488;&#xFF0C;&#x6307;&#x5411;&#x521B;&#x5EFA;&#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#x7684;&#x7C7B;&#x3002;&#x5728;Class&#x4E2D;&#x5148;&#x53BB;cache&#x4E2D;&#x901A;&#x8FC7;SEL&#x67E5;&#x627E;&#x5BF9;&#x5E94;&#x51FD;&#x6570;method&#xFF08;cache&#x4E2D;method&#x5217;&#x8868;&#x662F;&#x4EE5;SEL&#x4E3A;key&#x901A;&#x8FC7;hash&#x8868;&#x6765;&#x5B58;&#x50A8;&#x7684;&#xFF0C;&#x8FD9;&#x6837;&#x80FD;&#x63D0;&#x9AD8;&#x51FD;&#x6570;&#x67E5;&#x627E;&#x901F;&#x5EA6;&#xFF09;&#xFF0C;&#x82E5;cache&#x4E2D;&#x672A;&#x627E;&#x5230;,&#x518D;&#x53BB;methodList&#x4E2D;&#x67E5;&#x627E;&#xFF0C;&#x82E5;methodlist&#x4E2D;&#x672A;&#x627E;&#x5230;&#xFF0C;&#x5219;&#x53D6;superClass&#x4E2D;&#x67E5;&#x627E;&#x3002;&#x82E5;&#x80FD;&#x627E;&#x5230;&#xFF0C;&#x5219;&#x5C06;method&#x52A0;&#x5165;&#x5230;cache&#x4E2D;&#xFF0C;&#x4EE5;&#x65B9;&#x4FBF;&#x4E0B;&#x6B21;&#x67E5;&#x627E;&#xFF0C;&#x5E76;&#x901A;&#x8FC7;method&#x4E2D;&#x7684;&#x51FD;&#x6570;&#x6307;&#x9488;&#x8DF3;&#x8F6C;&#x5230;&#x5BF9;&#x5E94;&#x7684;&#x51FD;&#x6570;&#x4E2D;&#x53BB;&#x6267;&#x884C;&#x3002;</p>
<h4 id="&#x52A8;&#x6001;&#x6027;&#x7684;&#x4E09;&#x65B9;&#x9762;"><a href="#&#x52A8;&#x6001;&#x6027;&#x7684;&#x4E09;&#x65B9;&#x9762;" class="headerlink" title="&#x52A8;&#x6001;&#x6027;&#x7684;&#x4E09;&#x65B9;&#x9762;"></a>&#x52A8;&#x6001;&#x6027;&#x7684;&#x4E09;&#x65B9;&#x9762;</h4><p>OC&#x7684;&#x52A8;&#x6001;&#x7279;&#x6027;&#x8868;&#x73B0;&#x4E3A;&#x4E86;&#x4E09;&#x4E2A;&#x65B9;&#x9762;&#xFF1A;&#x52A8;&#x6001;&#x7C7B;&#x578B;&#x3001;&#x52A8;&#x6001;&#x7ED1;&#x5B9A;&#x3001;&#x52A8;&#x6001;&#x52A0;&#x8F7D;&#x3002;&#x4E4B;&#x6240;&#x4EE5;&#x53EB;&#x505A;&#x52A8;&#x6001;&#xFF0C;&#x662F;&#x56E0;&#x4E3A;&#x5FC5;&#x987B;&#x5230;&#x8FD0;&#x884C;&#x65F6;(runtime)&#x624D;&#x4F1A;&#x505A;&#x4E00;&#x4E9B;&#x4E8B;&#x60C5;&#x3002;</p>
<p>&#x52A8;&#x6001;&#x7C7B;&#x578B;&#xFF0C;&#x5C31;&#x662F;id&#x7C7B;&#x578B;&#x3002;&#x52A8;&#x6001;&#x7C7B;&#x578B;&#x662F;&#x8DDF;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x76F8;&#x5BF9;&#x7684;&#x3002;&#x5185;&#x7F6E;&#x7684;&#x57FA;&#x672C;&#x7C7B;&#x578B;&#x90FD;&#x5C5E;&#x4E8E;&#x9759;&#x6001;&#x7C7B;&#x578B;(int&#x3001;NSString&#x7B49;)&#x3002;&#x9759;&#x6001;&#x7C7B;&#x578B;&#x5728;&#x7F16;&#x8BD1;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x80FD;&#x88AB;&#x8BC6;&#x522B;&#x51FA;&#x6765;&#xFF08;&#x5373;&#x524D;&#x9762;&#x8BF4;&#x7684;&#x9759;&#x6001;&#x8F93;&#x5165;&#xFF09;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x82E5;&#x7A0B;&#x5E8F;&#x53D1;&#x751F;&#x4E86;&#x7C7B;&#x578B;&#x4E0D;&#x5BF9;&#x5E94;&#xFF0C;&#x7F16;&#x8BD1;&#x5668;&#x5C31;&#x4F1A;&#x53D1;&#x51FA;&#x8B66;&#x544A;&#x3002;&#x800C;&#x52A8;&#x6001;&#x7C7B;&#x578B;&#x5C31;&#x7F16;&#x8BD1;&#x5668;&#x7F16;&#x8BD1;&#x7684;&#x65F6;&#x5019;&#x662F;&#x4E0D;&#x80FD;&#x88AB;&#x8BC6;&#x522B;&#x7684;&#xFF0C;&#x8981;&#x7B49;&#x5230;&#x8FD0;&#x884C;&#x65F6;(runtime)&#xFF0C;&#x5373;&#x7A0B;&#x5E8F;&#x8FD0;&#x884C;&#x7684;&#x65F6;&#x5019;&#x624D;&#x4F1A;&#x6839;&#x636E;&#x8BED;&#x5883;&#x6765;&#x8BC6;&#x522B;&#x3002;&#x6240;&#x4EE5;&#x8FD9;&#x91CC;&#x9762;&#x5C31;&#x6709;&#x4E24;&#x4E2A;&#x6982;&#x5FF5;&#x8981;&#x5206;&#x6E05;&#xFF1A;&#x7F16;&#x8BD1;&#x65F6;&#x8DDF;&#x8FD0;&#x884C;&#x65F6;&#x3002;</p>
<p>&#x52A8;&#x6001;&#x8BED;&#x8A00;&#x548C;&#x9759;&#x6001;&#x8BED;&#x8A00;&#x7684;&#x4E00;&#x4E2A;&#x533A;&#x522B;&#x662F;&#x9759;&#x6001;&#x8BED;&#x8A00;&#x63D0;&#x524D;&#x7F16;&#x8BD1;&#x597D;&#x6587;&#x4EF6;&#xFF0C;&#x5373;&#x6240;&#x6709;&#x7684;&#x903B;&#x8F91;&#x5DF2;&#x5728;&#x7F16;&#x8BD1;&#x65F6;&#x786E;&#x5B9A;&#xFF0C;&#x8FD0;&#x884C;&#x65F6;&#x76F4;&#x63A5;&#x52A0;&#x8F7D;&#x7F16;&#x8BD1;&#x540E;&#x7684;&#x6587;&#x4EF6;&#xFF1B;&#x800C;&#x52A8;&#x6001;&#x8BED;&#x8A00;&#x662F;&#x5728;&#x8FD0;&#x884C;&#x65F6;&#x624D;&#x786E;&#x5B9A;&#x5B9E;&#x73B0;&#x3002;&#x5178;&#x578B;&#x7684;&#x9759;&#x6001;&#x8BED;&#x8A00;&#x662F;C&#xFF0B;&#xFF0B;&#xFF0C;&#x52A8;&#x6001;&#x8BED;&#x8A00;&#x5305;&#x62EC;OC&#xFF0C;JAVA&#xFF0C;C#&#x7B49;&#xFF1B;&#x56E0;&#x4E3A;&#x9759;&#x6001;&#x8BED;&#x8A00;&#x63D0;&#x524D;&#x7F16;&#x8BD1;&#x597D;&#x4E86;&#x6267;&#x884C;&#x6587;&#x4EF6;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x901A;&#x5E38;&#x6240;&#x8BF4;&#x7684;&#x9759;&#x6001;&#x8BED;&#x8A00;&#x6548;&#x7387;&#x8F83;&#x9AD8;&#x7684;&#x539F;&#x56E0;&#x3002;</p>
<p>&#x52A8;&#x6001;&#x7ED1;&#x5B9A;(dynamic binding)&#x9700;&#x8981;&#x7528;&#x5230;@selector/SEL&#x3002;&#x5148;&#x6765;&#x770B;&#x770B;&#x201C;&#x51FD;&#x6570;&#x201D;&#xFF0C;&#x5BF9;&#x4E8E;&#x5176;&#x4ED6;&#x4E00;&#x4E9B;&#x9759;&#x6001;&#x8BED;&#x8A00;&#xFF0C;&#x6BD4;&#x5982;c++,&#x4E00;&#x822C;&#x5728;&#x7F16;&#x8BD1;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x5DF2;&#x7ECF;&#x5C06;&#x8981;&#x8C03;&#x7528;&#x7684;&#x51FD;&#x6570;&#x7684;&#x51FD;&#x6570;&#x7B7E;&#x540D;&#x90FD;&#x544A;&#x8BC9;&#x7F16;&#x8BD1;&#x5668;&#x4E86;&#x3002;&#x9759;&#x6001;&#x7684;&#xFF0C;&#x4E0D;&#x80FD;&#x6539;&#x53D8;&#x3002;&#x800C;&#x5728;OC&#x4E2D;&#xFF0C;&#x5176;&#x5B9E;&#x662F;&#x6CA1;&#x6709;&#x51FD;&#x6570;&#x7684;&#x6982;&#x5FF5;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x53EB;&#x201C;&#x6D88;&#x606F;&#x673A;&#x5236;&#x201D;&#xFF0C;&#x6240;&#x8C13;&#x7684;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x5C31;&#x662F;&#x7ED9;&#x5BF9;&#x8C61;&#x53D1;&#x9001;&#x4E00;&#x6761;&#x6D88;&#x606F;&#x3002;&#x8FD9;&#x65F6;&#xFF0C;&#x52A8;&#x6001;&#x7ED1;&#x5B9A;&#x7684;&#x7279;&#x6027;&#x5C31;&#x6765;&#x4E86;&#x3002;OC&#x53EF;&#x4EE5;&#x5148;&#x8DF3;&#x8FC7;&#x7F16;&#x8BD1;&#xFF0C;&#x5230;&#x8FD0;&#x884C;&#x7684;&#x65F6;&#x5019;&#x624D;&#x52A8;&#x6001;&#x5730;&#x6DFB;&#x52A0;&#x51FD;&#x6570;&#x8C03;&#x7528;&#xFF0C;&#x5728;&#x8FD0;&#x884C;&#x65F6;&#x624D;&#x51B3;&#x5B9A;&#x8981;&#x8C03;&#x7528;&#x4EC0;&#x4E48;&#x65B9;&#x6CD5;&#xFF0C;&#x9700;&#x8981;&#x4F20;&#x4EC0;&#x4E48;&#x53C2;&#x6570;&#x8FDB;&#x53BB;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x52A8;&#x6001;&#x7ED1;&#x5B9A;&#x3002;&#x8981;&#x5B9E;&#x73B0;&#x4ED6;&#x5C31;&#x5FC5;&#x987B;&#x7528;SEL&#x53D8;&#x91CF;&#x7ED1;&#x5B9A;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#x3002;&#x6700;&#x7EC8;&#x5F62;&#x6210;&#x7684;&#x8FD9;&#x4E2A;SEL&#x53D8;&#x91CF;&#x5C31;&#x4EE3;&#x8868;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#x7684;&#x5F15;&#x7528;&#x3002;&#x8FD9;&#x91CC;&#x8981;&#x6CE8;&#x610F;&#x4E00;&#x70B9;&#xFF1A;SEL&#x5E76;&#x4E0D;&#x662F;C&#x91CC;&#x9762;&#x7684;&#x51FD;&#x6570;&#x6307;&#x9488;&#xFF0C;&#x867D;&#x7136;&#x5F88;&#x50CF;&#xFF0C;&#x4F46;&#x771F;&#x5FC3;&#x4E0D;&#x662F;&#x51FD;&#x6570;&#x6307;&#x9488;&#x3002;SEL&#x53D8;&#x91CF;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x6574;&#x6570;&#xFF0C;&#x4ED6;&#x662F;&#x8BE5;&#x65B9;&#x6CD5;&#x7684;ID&#x3002;&#x4EE5;&#x524D;&#x7684;&#x51FD;&#x6570;&#x8C03;&#x7528;&#xFF0C;&#x662F;&#x6839;&#x636E;&#x51FD;&#x6570;&#x540D;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x5B57;&#x7B26;&#x4E32;&#x53BB;&#x67E5;&#x627E;&#x51FD;&#x6570;&#x4F53;&#x3002;&#x4F46;&#x73B0;&#x5728;&#xFF0C;&#x6211;&#x4EEC;&#x662F;&#x6839;&#x636E;&#x4E00;&#x4E2A;ID&#x6574;&#x6570;&#x6765;&#x67E5;&#x627E;&#x65B9;&#x6CD5;&#xFF0C;&#x6574;&#x6570;&#x7684;&#x67E5;&#x627E;&#x81EA;&#x7136;&#x8981;&#x6BD4;&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x67E5;&#x627E;&#x5FEB;&#x5F97;&#x591A;&#xFF01;&#x6240;&#x4EE5;&#xFF0C;&#x52A8;&#x6001;&#x7ED1;&#x5B9A;&#x7684;&#x7279;&#x5B9A;&#x4E0D;&#x4EC5;&#x65B9;&#x4FBF;&#xFF0C;&#x800C;&#x4E14;&#x6548;&#x7387;&#x66F4;&#x9AD8;&#x3002;</p>
<p>&#x52A8;&#x6001;&#x52A0;&#x8F7D;&#x5C31;&#x662F;&#x6839;&#x636E;&#x9700;&#x6C42;&#x52A8;&#x6001;&#x5730;&#x52A0;&#x8F7D;&#x8D44;&#x6E90;&#xFF0C;&#x5728;&#x8FD0;&#x884C;&#x65F6;&#x52A0;&#x8F7D;&#x65B0;&#x7C7B;&#x3002;&#x5728;&#x8FD0;&#x884C;&#x65F6;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x7C7B;,&#x53EA;&#x9700;&#x8981;3&#x6B65;:</p>
<p>1&#x3001;&#x4E3A; class pair&#x5206;&#x914D;&#x5B58;&#x50A8;&#x7A7A;&#x95F4; ,&#x4F7F;&#x7528; objc_allocateClassPair&#x51FD;&#x6570;</p>
<p>2&#x3001;&#x589E;&#x52A0;&#x9700;&#x8981;&#x7684;&#x65B9;&#x6CD5;&#x4F7F;&#x7528;class_addMethod&#x51FD;&#x6570;,&#x589E;&#x52A0;&#x5B9E;&#x4F8B;&#x53D8;&#x91CF;&#x7528;class_addIvar</p>
<p>3 &#x3001;&#x7528;objc_registerClassPair&#x51FD;&#x6570;&#x6CE8;&#x518C;&#x8FD9;&#x4E2A;&#x7C7B;,&#x4EE5;&#x4FBF;&#x5B83;&#x80FD;&#x88AB;&#x522B;&#x4EBA;&#x4F7F;&#x7528;&#x3002;</p>
<h5 id="Method-Swizzling"><a href="#Method-Swizzling" class="headerlink" title="Method Swizzling"></a>Method Swizzling</h5><p>&#x5728;Objective-C&#x4E2D;&#x8C03;&#x7528;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#xFF0C;&#x5176;&#x5B9E;&#x662F;&#x5411;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x53D1;&#x9001;&#x6D88;&#x606F;&#xFF0C;&#x67E5;&#x627E;&#x6D88;&#x606F;&#x7684;&#x552F;&#x4E00;&#x4F9D;&#x636E;&#x662F;selector&#x7684;&#x540D;&#x5B57;&#x3002;&#x5229;&#x7528;Objective-C&#x7684;&#x52A8;&#x6001;&#x7279;&#x6027;&#xFF0C;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x5728;&#x8FD0;&#x884C;&#x65F6;&#x5077;&#x6362;selector&#x5BF9;&#x5E94;&#x7684;&#x65B9;&#x6CD5;&#x5B9E;&#x73B0;&#xFF0C;&#x8FBE;&#x5230;&#x7ED9;&#x65B9;&#x6CD5;&#x6302;&#x94A9;&#x7684;&#x76EE;&#x7684;&#x3002;&#x6BCF;&#x4E2A;&#x7C7B;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x65B9;&#x6CD5;&#x5217;&#x8868;&#xFF0C;&#x5B58;&#x653E;&#x7740;selector&#x7684;&#x540D;&#x5B57;&#x548C;&#x65B9;&#x6CD5;&#x5B9E;&#x73B0;&#x7684;&#x6620;&#x5C04;&#x5173;&#x7CFB;&#x3002;IMP&#x7C7B;&#x4F3C;&#x51FD;&#x6570;&#x6307;&#x9488;&#xFF0C;&#x6307;&#x5411;&#x5177;&#x4F53;&#x7684;Method&#x5B9E;&#x73B0;&#x3002;</p>
<p>&#x7528; method_exchangeImplementations &#x6765;&#x4EA4;&#x6362;2&#x4E2A;&#x65B9;&#x6CD5;&#x4E2D;&#x7684;IMP&#xFF0C;<br>&#x7528; class_replaceMethod &#x6765;&#x4FEE;&#x6539;&#x7C7B;&#xFF0C;<br>&#x7528; method_setImplementation &#x6765;&#x76F4;&#x63A5;&#x8BBE;&#x7F6E;&#x67D0;&#x4E2A;&#x65B9;&#x6CD5;&#x7684;IMP&#xFF0C;&#x5F52;&#x6839;&#x7ED3;&#x5E95;&#xFF0C;&#x90FD;&#x662F;&#x5077;&#x6362;&#x4E86;selector&#x7684;IMP&#x3002;</p>
<h3 id="RunLoop"><a href="#RunLoop" class="headerlink" title="RunLoop"></a>RunLoop</h3><p>RunLoop&#x662F;&#x4E00;&#x8BA9;&#x7EBF;&#x7A0B;&#x80FD;&#x968F;&#x65F6;&#x5904;&#x7406;&#x4E8B;&#x4EF6;&#x4F46;&#x4E0D;&#x9000;&#x51FA;&#x7684;&#x673A;&#x5236;&#x3002;RunLoop&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#xFF0C;&#x8FD9;&#x4E2A;&#x5BF9;&#x8C61;&#x7BA1;&#x7406;&#x4E86;&#x5176;&#x9700;&#x8981;&#x5904;&#x7406;&#x7684;&#x4E8B;&#x4EF6;&#x548C;&#x6D88;&#x606F;&#xFF0C;&#x5E76;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x5165;&#x53E3;&#x51FD;&#x6570;&#x6765;&#x6267;&#x884C;Event Loop&#x7684;&#x903B;&#x8F91;&#x3002;&#x7EBF;&#x7A0B;&#x6267;&#x884C;&#x4E86;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x540E;&#xFF0C;&#x5C31;&#x4F1A;&#x4E00;&#x76F4;&#x5904;&#x4E8E;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x5185;&#x90E8; &#x201C;&#x63A5;&#x53D7;&#x6D88;&#x606F;-&gt;&#x7B49;&#x5F85;-&gt;&#x5904;&#x7406;&#x201D; &#x7684;&#x5FAA;&#x73AF;&#x4E2D;&#xFF0C;&#x76F4;&#x5230;&#x8FD9;&#x4E2A;&#x5FAA;&#x73AF;&#x7ED3;&#x675F;&#xFF08;&#x6BD4;&#x5982;&#x4F20;&#x5165; quit &#x7684;&#x6D88;&#x606F;&#xFF09;&#xFF0C;&#x51FD;&#x6570;&#x8FD4;&#x56DE;&#x3002;&#x8BA9;&#x7EBF;&#x7A0B;&#x5728;&#x6CA1;&#x6709;&#x5904;&#x7406;&#x6D88;&#x606F;&#x65F6;&#x4F11;&#x7720;&#x4EE5;&#x907F;&#x514D;&#x8D44;&#x6E90;&#x5360;&#x7528;&#x3001;&#x5728;&#x6709;&#x6D88;&#x606F;&#x5230;&#x6765;&#x65F6;&#x7ACB;&#x523B;&#x88AB;&#x5524;&#x9192;&#x3002;&#x4E00;&#x4E2A;runloop&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#x5FAA;&#x73AF;&#xFF0C;&#x7528;&#x6765;&#x4E0D;&#x505C;&#x7684;&#x76D1;&#x542C;&#x548C;&#x5904;&#x7406;&#x8F93;&#x5165;&#x4E8B;&#x4EF6;&#x5E76;&#x5C06;&#x5176;&#x5206;&#x914D;&#x5230;&#x5BF9;&#x5E94;&#x7684;&#x76EE;&#x6807;&#x4E0A;&#x8FDB;&#x884C;&#x5904;&#x7406;&#x3002;</p>
<p>RunLoop&#x7684;&#x56DB;&#x4E2A;&#x4F5C;&#x7528;&#x4E3A;:&#x4F7F;&#x7A0B;&#x5E8F;&#x4E00;&#x76F4;&#x8FD0;&#x884C;&#x63A5;&#x53D7;&#x7528;&#x6237;&#x8F93;&#x5165;;&#x51B3;&#x5B9A;&#x7A0B;&#x5E8F;&#x5728;&#x4F55;&#x65F6;&#x5E94;&#x8BE5;&#x5904;&#x7406;&#x54EA;&#x4E9B;Event;&#x8C03;&#x7528;&#x89E3;&#x8026;;&#x8282;&#x7701;CPU&#x65F6;&#x95F4;&#x3002;</p>
<p>&#x7EBF;&#x7A0B;&#x548C; RunLoop &#x4E4B;&#x95F4;&#x662F;&#x4E00;&#x4E00;&#x5BF9;&#x5E94;&#x7684;&#xFF0C;&#x5176;&#x5173;&#x7CFB;&#x662F;&#x4FDD;&#x5B58;&#x5728;&#x4E00;&#x4E2A;&#x5168;&#x5C40;&#x7684; Dictionary &#x91CC;&#x3002;&#x7EBF;&#x7A0B;&#x521A;&#x521B;&#x5EFA;&#x65F6;&#x5E76;&#x6CA1;&#x6709; RunLoop&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x4E0D;&#x4E3B;&#x52A8;&#x83B7;&#x53D6;&#xFF0C;&#x90A3;&#x5B83;&#x4E00;&#x76F4;&#x90FD;&#x4E0D;&#x4F1A;&#x6709;&#x3002;RunLoop &#x7684;&#x521B;&#x5EFA;&#x662F;&#x53D1;&#x751F;&#x5728;&#x7B2C;&#x4E00;&#x6B21;&#x83B7;&#x53D6;&#x65F6;&#xFF0C;RunLoop &#x7684;&#x9500;&#x6BC1;&#x662F;&#x53D1;&#x751F;&#x5728;&#x7EBF;&#x7A0B;&#x7ED3;&#x675F;&#x65F6;&#x3002;&#x4F60;&#x53EA;&#x80FD;&#x5728;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x7684;&#x5185;&#x90E8;&#x83B7;&#x53D6;&#x5176;RunLoop&#xFF08;&#x4E3B;&#x7EBF;&#x7A0B;&#x9664;&#x5916;&#xFF09;&#x3002;</p>
<p>&#x4E3B;&#x7EBF;&#x7A0B;&#x7684;runloop&#x9ED8;&#x8BA4;&#x662F;&#x542F;&#x52A8;&#x7684;&#x3002;</p>
<p>OSX/iOS &#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x63D0;&#x4F9B;&#x4E86;&#x4E24;&#x4E2A;&#x8FD9;&#x6837;&#x7684;&#x5BF9;&#x8C61;&#xFF1A;NSRunLoop&#x548C;CFRunLoopRef&#x3002;CFRunLoopRef &#x662F;&#x5728; CoreFoundation &#x6846;&#x67B6;&#x5185;&#x7684;&#xFF0C;&#x5B83;&#x63D0;&#x4F9B;&#x4E86;&#x7EAF; C &#x51FD;&#x6570;&#x7684; API&#xFF0C;&#x6240;&#x6709;&#x8FD9;&#x4E9B; API &#x90FD;&#x662F;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;&#x3002;NSRunLoop &#x662F;&#x57FA;&#x4E8E; CFRunLoopRef &#x7684;&#x5C01;&#x88C5;&#xFF0C;&#x63D0;&#x4F9B;&#x4E86;&#x9762;&#x5411;&#x5BF9;&#x8C61;&#x7684; API&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x4E9B; API &#x4E0D;&#x662F;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;&#x3002;</p>
<p>NSRunLoop&#x662F;&#x4E00;&#x79CD;&#x66F4;&#x52A0;&#x9AD8;&#x660E;&#x7684;&#x6D88;&#x606F;&#x5904;&#x7406;&#x6A21;&#x5F0F;&#xFF0C;&#x5728;&#x5BF9;&#x6D88;&#x606F;&#x5904;&#x7406;&#x8FC7;&#x7A0B;&#x8FDB;&#x884C;&#x4E86;&#x66F4;&#x597D;&#x7684;&#x62BD;&#x8C61;&#x548C;&#x5C01;&#x88C5;&#xFF0C;&#x4E0D;&#x7528;&#x5904;&#x7406;&#x4E00;&#x4E9B;&#x5F88;&#x7410;&#x788E;&#x5F88;&#x4F4E;&#x5C42;&#x6B21;&#x7684;&#x5177;&#x4F53;&#x6D88;&#x606F;&#x7684;&#x5904;&#x7406;&#xFF0C;&#x5728;NSRunLoop&#x4E2D;&#x6BCF;&#x4E00;&#x4E2A;&#x6D88;&#x606F;&#x5C31;&#x88AB;&#x6253;&#x5305;&#x5728;input source&#x6216;&#x8005;&#x662F;timer source&#x4E2D;&#x4E86;&#x3002;&#x4F7F;&#x7528;run loop&#x53EF;&#x4EE5;&#x4F7F;&#x4F60;&#x7684;&#x7EBF;&#x7A0B;&#x5728;&#x6709;&#x5DE5;&#x4F5C;&#x7684;&#x65F6;&#x5019;&#x5DE5;&#x4F5C;&#xFF0C;&#x6CA1;&#x6709;&#x5DE5;&#x4F5C;&#x7684;&#x65F6;&#x5019;&#x4F11;&#x7720;&#xFF0C;&#x53EF;&#x4EE5;&#x5927;&#x5927;&#x8282;&#x7701;&#x7CFB;&#x7EDF;&#x8D44;&#x6E90;&#x3002;</p>
<p>&#x5BF9;&#x5176;&#x5B83;&#x7EBF;&#x7A0B;&#x6765;&#x8BF4;&#xFF0C;runloop&#x9ED8;&#x8BA4;&#x662F;&#x6CA1;&#x6709;&#x542F;&#x52A8;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x9700;&#x8981;&#x66F4;&#x591A;&#x7684;&#x7EBF;&#x7A0B;&#x4EA4;&#x4E92;&#x5219;&#x53EF;&#x4EE5;&#x624B;&#x52A8;&#x914D;&#x7F6E;&#x548C;&#x542F;&#x52A8;&#xFF0C;&#x5982;&#x679C;&#x7EBF;&#x7A0B;&#x53EA;&#x662F;&#x53BB;&#x6267;&#x884C;&#x4E00;&#x4E2A;&#x957F;&#x65F6;&#x95F4;&#x7684;&#x5DF2;&#x786E;&#x5B9A;&#x7684;&#x4EFB;&#x52A1;&#x5219;&#x4E0D;&#x9700;&#x8981;&#x3002;&#x5728;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;Cocoa&#x7A0B;&#x5E8F;&#x7684;&#x7EBF;&#x7A0B;&#x4E2D;&#xFF0C;&#x90FD;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#xFF1A;</p>
<pre><code>NSRunLoop   *runloop = [NSRunLoop currentRunLoop];
</code></pre><p>&#x83B7;&#x53D6;&#x5230;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;&#x7684;runloop&#x3002;</p>
<p>Cocoa&#x4E2D;&#x7684;NSRunLoop&#x7C7B;&#x5E76;&#x4E0D;&#x662F;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;<br>&#x6211;&#x4EEC;&#x4E0D;&#x80FD;&#x5728;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x4E2D;&#x53BB;&#x64CD;&#x4F5C;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x7684;runloop&#x5BF9;&#x8C61;&#xFF0C;&#x90A3;&#x5F88;&#x53EF;&#x80FD;&#x4F1A;&#x9020;&#x6210;&#x610F;&#x60F3;&#x4E0D;&#x5230;&#x7684;&#x540E;&#x679C;&#x3002;&#x4F46;&#x662F;CoreFundation&#x4E2D;&#x7684;&#x4E0D;&#x900F;&#x660E;&#x7C7B;CFRunLoopRef&#x662F;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;&#xFF0C;&#x800C;&#x4E14;&#x4E24;&#x79CD;&#x7C7B;&#x578B;&#x7684;runloop&#x5B8C;&#x5168;&#x53EF;&#x4EE5;&#x6DF7;&#x5408;&#x4F7F;&#x7528;&#x3002;Cocoa&#x4E2D;&#x7684;NSRunLoop&#x7C7B;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5B9E;&#x4F8B;&#x65B9;&#x6CD5;&#xFF1A;</p>
<pre><code>- (CFRunLoopRef)getCFRunLoop;
</code></pre><p>&#x83B7;&#x53D6;&#x5BF9;&#x5E94;&#x7684;CFRunLoopRef&#x7C7B;&#xFF0C;&#x6765;&#x8FBE;&#x5230;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;&#x76EE;&#x7684;&#x3002;</p>
<p>Runloop&#x7684;&#x7BA1;&#x7406;&#x5E76;&#x4E0D;&#x5B8C;&#x5168;&#x662F;&#x81EA;&#x52A8;&#x7684;&#x3002;&#x6211;&#x4EEC;&#x4ECD;&#x5FC5;&#x987B;&#x8BBE;&#x8BA1;&#x7EBF;&#x7A0B;&#x4EE3;&#x7801;&#x4EE5;&#x5728;&#x9002;&#x5F53;&#x7684;&#x65F6;&#x5019;&#x542F;&#x52A8;runloop&#x5E76;&#x6B63;&#x786E;&#x54CD;&#x5E94;&#x8F93;&#x5165;&#x4E8B;&#x4EF6;&#xFF0C;&#x5F53;&#x7136;&#x524D;&#x63D0;&#x662F;&#x7EBF;&#x7A0B;&#x4E2D;&#x9700;&#x8981;&#x7528;&#x5230;runloop&#x3002;&#x800C;&#x4E14;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x9700;&#x8981;&#x4F7F;&#x7528;while/for&#x8BED;&#x53E5;&#x6765;&#x9A71;&#x52A8;runloop&#x80FD;&#x591F;&#x5FAA;&#x73AF;&#x8FD0;&#x884C;&#xFF0C;&#x4E0B;&#x9762;&#x7684;&#x4EE3;&#x7801;&#x5C31;&#x6210;&#x529F;&#x9A71;&#x52A8;&#x4E86;&#x4E00;&#x4E2A;run loop&#xFF1A;</p>
<pre><code>BOOL isRunning = NO;
do {
 isRunning = [[NSRunLoop currentRunLoop] runMode:NSDefaultRunLoopMode beforeDate:[NSDatedistantFuture]];
} while (isRunning);
</code></pre><p>Runloop&#x540C;&#x65F6;&#x4E5F;&#x8D1F;&#x8D23;autorelease pool&#x7684;&#x521B;&#x5EFA;&#x548C;&#x91CA;&#x653E;<br>&#x5728;&#x4F7F;&#x7528;&#x624B;&#x52A8;&#x7684;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x65B9;&#x5F0F;&#x7684;&#x9879;&#x76EE;&#x4E2D;&#xFF0C;&#x4F1A;&#x7ECF;&#x5E38;&#x7528;&#x5230;&#x5F88;&#x591A;&#x81EA;&#x52A8;&#x91CA;&#x653E;&#x7684;&#x5BF9;&#x8C61;&#xFF0C;&#x5982;&#x679C;&#x8FD9;&#x4E9B;&#x5BF9;&#x8C61;&#x4E0D;&#x80FD;&#x591F;&#x88AB;&#x5373;&#x65F6;&#x91CA;&#x653E;&#x6389;&#xFF0C;&#x4F1A;&#x9020;&#x6210;&#x5185;&#x5B58;&#x5360;&#x7528;&#x91CF;&#x6025;&#x5267;&#x589E;&#x5927;&#x3002;Runloop&#x5C31;&#x4E3A;&#x6211;&#x4EEC;&#x505A;&#x4E86;&#x8FD9;&#x6837;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x6BCF;&#x5F53;&#x4E00;&#x4E2A;&#x8FD0;&#x884C;&#x5FAA;&#x73AF;&#x7ED3;&#x675F;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5B83;&#x90FD;&#x4F1A;&#x91CA;&#x653E;&#x4E00;&#x6B21;autorelease pool&#xFF0C;&#x540C;&#x65F6;pool&#x4E2D;&#x7684;&#x6240;&#x6709;&#x81EA;&#x52A8;&#x91CA;&#x653E;&#x7C7B;&#x578B;&#x53D8;&#x91CF;&#x90FD;&#x4F1A;&#x88AB;&#x91CA;&#x653E;&#x6389;&#x3002;</p>
<p><strong>&#x7CFB;&#x7EDF;&#x9ED8;&#x8BA4;&#x6CE8;&#x518C;&#x4E86;5&#x4E2A;Mode:</strong></p>
<p>kCFRunLoopDefaultMode: App&#x7684;&#x9ED8;&#x8BA4; Mode&#xFF0C;&#x901A;&#x5E38;&#x4E3B;&#x7EBF;&#x7A0B;&#x662F;&#x5728;&#x8FD9;&#x4E2A; Mode &#x4E0B;&#x8FD0;&#x884C;&#x7684;&#x3002;</p>
<p>UITrackingRunLoopMode: &#x754C;&#x9762;&#x8DDF;&#x8E2A; Mode&#xFF0C;&#x7528;&#x4E8E; ScrollView &#x8FFD;&#x8E2A;&#x89E6;&#x6478;&#x6ED1;&#x52A8;&#xFF0C;&#x4FDD;&#x8BC1;&#x754C;&#x9762;&#x6ED1;&#x52A8;&#x65F6;&#x4E0D;&#x53D7;&#x5176;&#x4ED6; Mode &#x5F71;&#x54CD;&#x3002;</p>
<p>UIInitializationRunLoopMode: &#x5728;&#x521A;&#x542F;&#x52A8; App &#x65F6;&#x7B2C;&#x8FDB;&#x5165;&#x7684;&#x7B2C;&#x4E00;&#x4E2A; Mode&#xFF0C;&#x542F;&#x52A8;&#x5B8C;&#x6210;&#x540E;&#x5C31;&#x4E0D;&#x518D;&#x4F7F;&#x7528;&#x3002;</p>
<p>GSEventReceiveRunLoopMode: &#x63A5;&#x53D7;&#x7CFB;&#x7EDF;&#x4E8B;&#x4EF6;&#x7684;&#x5185;&#x90E8; Mode&#xFF0C;&#x901A;&#x5E38;&#x7528;&#x4E0D;&#x5230;&#x3002;</p>
<p>kCFRunLoopCommonModes: &#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x5360;&#x4F4D;&#x7684; Mode&#xFF0C;&#x6CA1;&#x6709;&#x5B9E;&#x9645;&#x4F5C;&#x7528;&#x3002;</p>
<p><strong>&#x8F6E;&#x64AD;&#x56FE;&#x4E2D;&#x7684;NSTimer&#x95EE;&#x9898;</strong><br>&#x521B;&#x5EFA;&#x5B9A;&#x65F6;&#x5668;&#xFF1A;</p>
<pre><code>1&#xFF1A;NSTimer *timer = [NSTimer timerWithTimeInterval:2 target:self selector:@selector(changeImage) userInfo:nil repeats:YES];
</code></pre><p>&#x6B64;&#x65B9;&#x6CD5;&#x521B;&#x5EFA;&#x7684;&#x5B9A;&#x65F6;&#x5668;&#xFF0C;&#x5FC5;&#x987B;&#x52A0;&#x5230;NSRunLoop&#x4E2D;&#x3002;</p>
<pre><code>NSRunLoop *runLoop = [NSRunLoop currentRunLoop]; 
[runLoop addTimer:timer forMode: NSRunLoopCommonModes];
</code></pre><p> forMode&#x7684;&#x53C2;&#x6570;&#x6709;&#x4E24;&#x79CD;&#x7C7B;&#x578B;&#x53EF;&#x4F9B;&#x9009;&#x62E9;&#xFF1A;<code> NSDefaultRunLoopMode &#xFF0C; NSRunLoopCommonModes</code>&#xFF0C;&#x7B2C;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x4E3A;&#x9ED8;&#x8BA4;&#x53C2;&#x6570;&#xFF0C;&#x5F53;&#x4E0B;&#x9762;&#x6709;textView&#xFF0C;textfield&#x7B49;&#x63A7;&#x4EF6;&#x65F6;&#xFF0C;&#x62D6;&#x62FD;&#x63A7;&#x4EF6;&#xFF0C;&#x6B64;&#x65F6;&#x8F6E;&#x64AD;&#x5668;&#x4F1A;&#x505C;&#x6B62;&#x8F6E;&#x64AD;&#xFF0C;&#x662F;&#x56E0;&#x4E3A;NSRunLoop&#x7684;&#x539F;&#x56E0;&#xFF0C;NSRunLoop&#x4E3A;&#x4E00;&#x4E2A;&#x6B7B;&#x5FAA;&#x73AF;&#xFF0C;&#x5B9E;&#x65F6;&#x76D1;&#x6D4B;&#x6709;&#x65E0;&#x4E8B;&#x4EF6;&#x54CD;&#x5E94;&#xFF0C;&#x5982;&#x679C;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;&#x5C31;&#x662F;&#x4E3B;&#x7EBF;&#x7A0B;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;UI&#x7EBF;&#x7A0B;&#x65F6;&#xFF0C;&#x67D0;&#x4E9B;UI&#x4E8B;&#x4EF6;&#xFF0C;&#x6BD4;&#x5982;UIScrollView&#x7684;&#x62D6;&#x52A8;&#x64CD;&#x4F5C;&#xFF0C;&#x4F1A;&#x5C06;Run Loop&#x5207;&#x6362;&#x6210;NSEventTrackingRunLoopMode&#x6A21;&#x5F0F;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x9ED8;&#x8BA4;&#x7684;NSDefaultRunLoopMode&#x6A21;&#x5F0F;&#x4E2D;&#x6CE8;&#x518C;&#x7684;&#x4E8B;&#x4EF6;&#x662F;&#x4E0D;&#x4F1A;&#x88AB;&#x6267;&#x884C;&#x7684;&#x3002;NSRunLoopCommonModes &#x80FD;&#x591F;&#x5728;&#x591A;&#x7EBF;&#x7A0B;&#x4E2D;&#x8D77;&#x4F5C;&#x7528;&#xFF0C;&#x8FD9;&#x4E2A;&#x6A21;&#x5F0F;&#x7B49;&#x6548;&#x4E8E;NSDefaultRunLoopMode&#x548C;NSEventTrackingRunLoopMode&#x7684;&#x7ED3;&#x5408;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x5C06;modes&#x6362;&#x4E3A;NSRunLoopCommonModes&#x4FBF;&#x53EF;&#x89E3;&#x51B3;&#x7684;&#x539F;&#x56E0;&#x3002;</p>
<pre><code>2&#xFF1A; self.timer = [NSTimer scheduledTimerWithTimeInterval:2 target:self selector:@selector(changeImage) userInfo:nil repeats:YES];
</code></pre><p>&#x6B64;&#x79CD;&#x521B;&#x5EFA;&#x5B9A;&#x65F6;&#x5668;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x9ED8;&#x8BA4;&#x52A0;&#x5230;&#x4E86;runloop&#xFF0C;&#x4E14;&#x9ED8;&#x8BA4;&#x4E3A;&#x7B2C;&#x4E8C;&#x4E2A;&#x53C2;&#x6570;&#x3002;</p>
<p><strong>main&#x51FD;&#x6570;&#x7684;&#x8FD0;&#x884C;</strong></p>
<p>&#x5728;main.m&#x4E2D;&#xFF1A;</p>
<pre><code>int main(int argc, char *argv[])
{
   @autoreleasepool {
     return UIApplicationMain(argc, argv, nil, NSStringFromClass([appDelegate class]));
  }
}
</code></pre><p>UIApplicationMain() &#x51FD;&#x6570;&#x4F1A;&#x4E3A;main thread &#x8BBE;&#x7F6E;&#x4E00;&#x4E2A;NSRunLoop &#x5BF9;&#x8C61;&#xFF0C;&#x8FD9;&#x5C31;&#x89E3;&#x91CA;&#x4E86;app&#x5E94;&#x7528;&#x53EF;&#x4EE5;&#x5728;&#x65E0;&#x4EBA;&#x64CD;&#x4F5C;&#x7684;&#x65F6;&#x5019;&#x4F11;&#x606F;&#xFF0C;&#x9700;&#x8981;&#x8BA9;&#x5B83;&#x5E72;&#x6D3B;&#x7684;&#x65F6;&#x5019;&#x53C8;&#x80FD;&#x7ACB;&#x9A6C;&#x54CD;&#x5E94;&#x3002;</p>
<p>&#x4EC5;&#x5F53;&#x5728;&#x4E3A;&#x4F60;&#x7684;&#x7A0B;&#x5E8F;&#x521B;&#x5EFA;&#x8F85;&#x52A9;&#x7EBF;&#x7A0B;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4F60;&#x624D;&#x9700;&#x8981;&#x663E;&#x5F0F;&#x8FD0;&#x884C;&#x4E00;&#x4E2A;runloop&#x3002;Runloop&#x662F;&#x7A0B;&#x5E8F;&#x4E3B;&#x7EBF;&#x7A0B;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x5173;&#x952E;&#x90E8;&#x5206;,&#x6240;&#x4EE5;&#xFF0C;Cocoa&#x548C;Carbon&#x7A0B;&#x5E8F;&#x63D0;&#x4F9B;&#x4E86;&#x4EE3;&#x7801;&#x8FD0;&#x884C;&#x4E3B;&#x7A0B;&#x5E8F;&#x7684;&#x5FAA;&#x73AF;&#x5E76;&#x81EA;&#x52A8;&#x542F;&#x52A8;runloop&#x3002;IOS&#x7A0B;&#x5E8F;&#x4E2D;UIApplication&#x7684;run&#x65B9;&#x6CD5;&#xFF08;&#x6216;Mac OS X&#x4E2D;&#x7684;NSApplication&#xFF09;&#x4F5C;&#x4E3A;&#x7A0B;&#x5E8F;&#x542F;&#x52A8;&#x6B65;&#x9AA4;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x5B83;&#x5728;&#x7A0B;&#x5E8F;&#x6B63;&#x5E38;&#x542F;&#x52A8;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x4F1A;&#x542F;&#x52A8;&#x7A0B;&#x5E8F;&#x7684;&#x4E3B;&#x5FAA;&#x73AF;&#x3002;&#x5982;&#x679C;&#x4F60;&#x4F7F;&#x7528;xcode&#x63D0;&#x4F9B;&#x7684;&#x6A21;&#x677F;&#x521B;&#x5EFA;&#x4F60;&#x7684;&#x7A0B;&#x5E8F;&#xFF0C;&#x90A3;&#x4F60;&#x6C38;&#x8FDC;&#x4E0D;&#x9700;&#x8981;&#x81EA;&#x5DF1;&#x53BB;&#x663E;&#x5F0F;&#x7684;&#x8C03;&#x7528;&#x8FD9;&#x4E9B;&#x4F8B;&#x7A0B;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x8F85;&#x52A9;&#x7EBF;&#x7A0B;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x5224;&#x65AD;&#x4E00;&#x4E2A;runloop&#x662F;&#x5426;&#x662F;&#x5FC5;&#x987B;&#x7684;&#x3002;&#x5982;&#x679C;&#x662F;&#x5FC5;&#x987B;&#x7684;&#xFF0C;&#x90A3;&#x4E48;&#x4F60;&#x8981;&#x81EA;&#x5DF1;&#x914D;&#x7F6E;&#x5E76;&#x542F;&#x52A8;&#x5B83;&#x3002;&#x4F60;&#x4E0D;&#x9700;&#x8981;&#x5728;&#x4EFB;&#x4F55;&#x60C5;&#x51B5;&#x4E0B;&#x90FD;&#x53BB;&#x542F;&#x52A8;&#x4E00;&#x4E2A;&#x7EBF;&#x7A0B;&#x7684;runloop&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x4F60;&#x4F7F;&#x7528;&#x7EBF;&#x7A0B;&#x6765;&#x5904;&#x7406;&#x4E00;&#x4E2A;&#x9884;&#x5148;&#x5B9A;&#x4E49;&#x7684;&#x957F;&#x65F6;&#x95F4;&#x8FD0;&#x884C;&#x7684;&#x4EFB;&#x52A1;&#x65F6;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x907F;&#x514D;&#x542F;&#x52A8;runloop&#x3002;Runloop&#x5728;&#x4F60;&#x8981;&#x548C;&#x7EBF;&#x7A0B;&#x6709;&#x66F4;&#x591A;&#x7684;&#x4EA4;&#x4E92;&#x65F6;&#x624D;&#x9700;&#x8981;&#xFF0C;&#x6BD4;&#x5982;&#x4EE5;&#x4E0B;&#x60C5;&#x51B5;&#xFF1A;</p>
<p>1.&#x4F7F;&#x7528;&#x7AEF;&#x53E3;&#x6216;&#x81EA;&#x5B9A;&#x4E49;&#x8F93;&#x5165;&#x6E90;&#x6765;&#x548C;&#x5176;&#x4ED6;&#x7EBF;&#x7A0B;&#x901A;&#x4FE1;;</p>
<p>2.&#x4F7F;&#x7528;&#x7EBF;&#x7A0B;&#x7684;&#x5B9A;&#x65F6;&#x5668;;</p>
<p>3.Cocoa&#x4E2D;&#x4F7F;&#x7528;&#x4EFB;&#x4F55;performSelector&#x2026;&#x7684;&#x65B9;&#x6CD5;;</p>
<p>4.&#x4F7F;&#x7EBF;&#x7A0B;&#x5468;&#x671F;&#x6027;&#x5DE5;&#x4F5C;;</p>
<h3 id="&#x4E8B;&#x4EF6;&#x54CD;&#x5E94;&#x94FE;"><a href="#&#x4E8B;&#x4EF6;&#x54CD;&#x5E94;&#x94FE;" class="headerlink" title="&#x4E8B;&#x4EF6;&#x54CD;&#x5E94;&#x94FE;"></a>&#x4E8B;&#x4EF6;&#x54CD;&#x5E94;&#x94FE;</h3><p>&#x5BF9;&#x4E8E;IOS&#x8BBE;&#x5907;&#x7528;&#x6237;&#x6765;&#x8BF4;&#xFF0C;&#x64CD;&#x4F5C;&#x8BBE;&#x5907;&#x7684;&#x65B9;&#x5F0F;&#x4E3B;&#x8981;&#x6709;&#x4E09;&#x79CD;&#xFF1A;&#x89E6;&#x6478;&#x5C4F;&#x5E55;&#x3001;&#x6643;&#x52A8;&#x8BBE;&#x5907;&#x3001;&#x901A;&#x8FC7;&#x9065;&#x63A7;&#x8BBE;&#x65BD;&#x63A7;&#x5236;&#x8BBE;&#x5907;&#x3002;&#x5BF9;&#x5E94;&#x7684;&#x4E8B;&#x4EF6;&#x7C7B;&#x578B;&#x6709;&#x4EE5;&#x4E0B;&#x4E09;&#x79CD;&#xFF1A;</p>
<p>1&#x3001;&#x89E6;&#x5C4F;&#x4E8B;&#x4EF6;&#xFF08;Touch Event&#xFF09;</p>
<p>2&#x3001;&#x8FD0;&#x52A8;&#x4E8B;&#x4EF6;&#xFF08;Motion Event&#xFF09;</p>
<p>3&#x3001;&#x8FDC;&#x7AEF;&#x63A7;&#x5236;&#x4E8B;&#x4EF6;&#xFF08;Remote-Control Event&#xFF09;</p>
<p>&#x4E8B;&#x4EF6;&#x7684;&#x4F20;&#x9012;&#x548C;&#x54CD;&#x5E94;&#x5206;&#x4E24;&#x4E2A;&#x94FE;&#xFF1A;</p>
<p>&#x4F20;&#x9012;&#x94FE;&#xFF1A;&#x7531;&#x7CFB;&#x7EDF;&#x5411;&#x79BB;&#x7528;&#x6237;&#x6700;&#x8FD1;&#x7684;view&#x4F20;&#x9012;&#x3002;</p>
<blockquote>
<p>UIKit &#x2013;&gt; active app&#x2019;s event queue &#x2013;&gt; window &#x2013;&gt; root view &#x2013;&gt;&#x2026;&#x2026;&#x2013;&gt;lowest view</p>
</blockquote>
<p>&#x54CD;&#x5E94;&#x94FE;&#xFF1A;&#x7531;&#x79BB;&#x7528;&#x6237;&#x6700;&#x8FD1;&#x7684;view&#x5411;&#x7CFB;&#x7EDF;&#x4F20;&#x9012;&#x3002;</p>
<blockquote>
<p>initial view &#x2013;&gt; super view &#x2013;&gt; &#x2026;..&#x2013;&gt; view controller &#x2013;&gt; window &#x2013;&gt; Application</p>
</blockquote>
<p>&#x54CD;&#x5E94;&#x8005;&#x94FE;&#xFF08;Responder Chain&#xFF09;:&#x7531;&#x591A;&#x4E2A;&#x54CD;&#x5E94;&#x8005;&#x5BF9;&#x8C61;&#x8FDE;&#x63A5;&#x8D77;&#x6765;&#x7684;&#x94FE;&#x6761;&#xFF0C;&#x4F5C;&#x7528;&#x662F;&#x80FD;&#x5F88;&#x6E05;&#x695A;&#x7684;&#x770B;&#x89C1;&#x6BCF;&#x4E2A;&#x54CD;&#x5E94;&#x8005;&#x4E4B;&#x95F4;&#x7684;&#x8054;&#x7CFB;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x4EE5;&#x8BA9;&#x4E00;&#x4E2A;&#x4E8B;&#x4EF6;&#x591A;&#x4E2A;&#x5BF9;&#x8C61;&#x5904;&#x7406;&#x3002;</p>
<p>&#x54CD;&#x5E94;&#x8005;&#x5BF9;&#x8C61;&#xFF08;Responder Object&#xFF09;&#xFF0C;&#x6307;&#x7684;&#x662F;&#x6709;&#x54CD;&#x5E94;&#x548C;&#x5904;&#x7406;&#x4E8B;&#x4EF6;&#x80FD;&#x529B;&#x7684;&#x5BF9;&#x8C61;&#x3002;&#x54CD;&#x5E94;&#x8005;&#x94FE;&#x5C31;&#x662F;&#x7531;&#x4E00;&#x7CFB;&#x5217;&#x7684;&#x54CD;&#x5E94;&#x8005;&#x5BF9;&#x8C61;&#x6784;&#x6210;&#x7684;&#x4E00;&#x4E2A;&#x5C42;&#x6B21;&#x7ED3;&#x6784;&#x3002;</p>
<p>UIResponder&#x662F;&#x6240;&#x6709;&#x54CD;&#x5E94;&#x5BF9;&#x8C61;&#x7684;&#x57FA;&#x7C7B;&#xFF0C;&#x5728;UIResponder&#x7C7B;&#x4E2D;&#x5B9A;&#x4E49;&#x4E86;&#x5904;&#x7406;&#x4E0A;&#x8FF0;&#x5404;&#x79CD;&#x4E8B;&#x4EF6;&#x7684;&#x63A5;&#x53E3;&#x3002;&#x6211;&#x4EEC;&#x719F;&#x6089;&#x7684;UIApplication&#x3001; UIViewController&#x3001;UIWindow&#x548C;&#x6240;&#x6709;&#x7EE7;&#x627F;&#x81EA;UIView&#x7684;UIKit&#x7C7B;&#x90FD;&#x76F4;&#x63A5;&#x6216;&#x95F4;&#x63A5;&#x7684;&#x7EE7;&#x627F;&#x81EA;UIResponder&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x4EEC;&#x7684;&#x5B9E;&#x4F8B;&#x90FD;&#x662F;&#x53EF;&#x4EE5;&#x6784;&#x6210;&#x54CD;&#x5E94;&#x8005;&#x94FE;&#x7684;&#x54CD;&#x5E94;&#x8005;&#x5BF9;&#x8C61;&#x3002;</p>
<p><strong>&#x54CD;&#x5E94;&#x8005;&#x94FE;&#x6709;&#x4EE5;&#x4E0B;&#x7279;&#x70B9;&#xFF1A;</strong></p>
<p>1&#x3001;&#x54CD;&#x5E94;&#x8005;&#x94FE;&#x901A;&#x5E38;&#x662F;&#x7531;&#x89C6;&#x56FE;&#xFF08;UIView&#xFF09;&#x6784;&#x6210;&#x7684;&#xFF1B;</p>
<p>2&#x3001;&#x4E00;&#x4E2A;&#x89C6;&#x56FE;&#x7684;&#x4E0B;&#x4E00;&#x4E2A;&#x54CD;&#x5E94;&#x8005;&#x662F;&#x5B83;&#x89C6;&#x56FE;&#x63A7;&#x5236;&#x5668;&#xFF08;UIViewController&#xFF09;&#xFF08;&#x5982;&#x679C;&#x6709;&#x7684;&#x8BDD;&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x8F6C;&#x7ED9;&#x5B83;&#x7684;&#x7236;&#x89C6;&#x56FE;&#xFF08;Super View&#xFF09;&#xFF1B;</p>
<p>3&#x3001;&#x89C6;&#x56FE;&#x63A7;&#x5236;&#x5668;&#xFF08;&#x5982;&#x679C;&#x6709;&#x7684;&#x8BDD;&#xFF09;&#x7684;&#x4E0B;&#x4E00;&#x4E2A;&#x54CD;&#x5E94;&#x8005;&#x4E3A;&#x5176;&#x7BA1;&#x7406;&#x7684;&#x89C6;&#x56FE;&#x7684;&#x7236;&#x89C6;&#x56FE;&#xFF1B;</p>
<p>4&#x3001;&#x5355;&#x4F8B;&#x7684;&#x7A97;&#x53E3;&#xFF08;UIWindow&#xFF09;&#x7684;&#x5185;&#x5BB9;&#x89C6;&#x56FE;&#x5C06;&#x6307;&#x5411;&#x7A97;&#x53E3;&#x672C;&#x8EAB;&#x4F5C;&#x4E3A;&#x5B83;&#x7684;&#x4E0B;&#x4E00;&#x4E2A;&#x54CD;&#x5E94;&#x8005;&#xFF0C;Cocoa Touch&#x5E94;&#x7528;&#x4E0D;&#x50CF;Cocoa&#x5E94;&#x7528;&#xFF0C;&#x5B83;&#x53EA;&#x6709;&#x4E00;&#x4E2A;UIWindow&#x5BF9;&#x8C61;&#xFF0C;&#x56E0;&#x6B64;&#x6574;&#x4E2A;&#x54CD;&#x5E94;&#x8005;&#x94FE;&#x8981;&#x7B80;&#x5355;&#x4E00;&#x70B9;&#xFF1B;</p>
<p>5&#x3001;&#x5355;&#x4F8B;&#x7684;&#x5E94;&#x7528;&#xFF08;UIApplication&#xFF09;&#x662F;&#x4E00;&#x4E2A;&#x54CD;&#x5E94;&#x8005;&#x94FE;&#x7684;&#x7EC8;&#x70B9;&#xFF0C;&#x5B83;&#x7684;&#x4E0B;&#x4E00;&#x4E2A;&#x54CD;&#x5E94;&#x8005;&#x6307;&#x5411;nil&#xFF0C;&#x4EE5;&#x7ED3;&#x675F;&#x6574;&#x4E2A;&#x5FAA;&#x73AF;&#x3002;</p>
<p>iOS&#x7CFB;&#x7EDF;&#x68C0;&#x6D4B;&#x5230;&#x624B;&#x6307;&#x89E6;&#x6478;(Touch)&#x64CD;&#x4F5C;&#x65F6;&#x4F1A;&#x5C06;&#x5176;&#x6253;&#x5305;&#x6210;&#x4E00;&#x4E2A;UIEvent&#x5BF9;&#x8C61;&#xFF0C;&#x5E76;&#x653E;&#x5165;&#x5F53;&#x524D;&#x6D3B;&#x52A8;Application&#x7684;&#x4E8B;&#x4EF6;&#x961F;&#x5217;&#xFF0C;&#x5355;&#x4F8B;&#x7684;UIApplication&#x4F1A;&#x4ECE;&#x4E8B;&#x4EF6;&#x961F;&#x5217;&#x4E2D;&#x53D6;&#x51FA;&#x89E6;&#x6478;&#x4E8B;&#x4EF6;&#x5E76;&#x4F20;&#x9012;&#x7ED9;&#x5355;&#x4F8B;&#x7684;UIWindow&#x6765;&#x5904;&#x7406;&#xFF0C;UIWindow&#x5BF9;&#x8C61;&#x9996;&#x5148;&#x4F1A;&#x4F7F;&#x7528;<code>hitTest:withEvent:</code>&#x65B9;&#x6CD5;&#x5BFB;&#x627E;&#x6B64;&#x6B21;Touch&#x64CD;&#x4F5C;&#x521D;&#x59CB;&#x70B9;&#x6240;&#x5728;&#x7684;&#x89C6;&#x56FE;(View)&#xFF0C;&#x5373;&#x9700;&#x8981;&#x5C06;&#x89E6;&#x6478;&#x4E8B;&#x4EF6;&#x4F20;&#x9012;&#x7ED9;&#x5176;&#x5904;&#x7406;&#x7684;&#x89C6;&#x56FE;&#xFF0C;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x79F0;&#x4E4B;&#x4E3A;hit-test view&#x3002;</p>
<p>UIWindow&#x5B9E;&#x4F8B;&#x5BF9;&#x8C61;&#x4F1A;&#x9996;&#x5148;&#x5728;&#x5B83;&#x7684;&#x5185;&#x5BB9;&#x89C6;&#x56FE;&#x4E0A;&#x8C03;&#x7528;<code>hitTest:withEvent:</code>&#xFF0C;&#x6B64;&#x65B9;&#x6CD5;&#x4F1A;&#x5728;&#x5176;&#x89C6;&#x56FE;&#x5C42;&#x7EA7;&#x7ED3;&#x6784;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x89C6;&#x56FE;&#x4E0A;&#x8C03;&#x7528;<code>pointInside:withEvent:</code>&#xFF08;&#x8BE5;&#x65B9;&#x6CD5;&#x7528;&#x6765;&#x5224;&#x65AD;&#x70B9;&#x51FB;&#x4E8B;&#x4EF6;&#x53D1;&#x751F;&#x7684;&#x4F4D;&#x7F6E;&#x662F;&#x5426;&#x5904;&#x4E8E;&#x5F53;&#x524D;&#x89C6;&#x56FE;&#x8303;&#x56F4;&#x5185;&#xFF0C;&#x4EE5;&#x786E;&#x5B9A;&#x7528;&#x6237;&#x662F;&#x4E0D;&#x662F;&#x70B9;&#x51FB;&#x4E86;&#x5F53;&#x524D;&#x89C6;&#x56FE;&#xFF09;&#xFF0C;&#x5982;&#x679C;<code>pointInside:withEvent:</code>&#x8FD4;&#x56DE;YES&#xFF0C;&#x5219;&#x7EE7;&#x7EED;&#x9010;&#x7EA7;&#x8C03;&#x7528;&#xFF0C;&#x76F4;&#x5230;&#x627E;&#x5230;touch&#x64CD;&#x4F5C;&#x53D1;&#x751F;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x8FD9;&#x4E2A;&#x89C6;&#x56FE;&#x4E5F;&#x5C31;&#x662F;&#x8981;&#x627E;&#x7684;hit-test view&#x3002;</p>
<p><code>hitTest:withEvent:</code>&#x65B9;&#x6CD5;&#x7684;&#x5904;&#x7406;&#x6D41;&#x7A0B;&#x5982;&#x4E0B;:</p>
<p>&#x9996;&#x5148;&#x8C03;&#x7528;&#x5F53;&#x524D;&#x89C6;&#x56FE;&#x7684;<code>pointInside:withEvent:</code>&#x65B9;&#x6CD5;&#x5224;&#x65AD;&#x89E6;&#x6478;&#x70B9;&#x662F;&#x5426;&#x5728;&#x5F53;&#x524D;&#x89C6;&#x56FE;&#x5185;&#xFF1B;&#x82E5;&#x8FD4;&#x56DE;NO,&#x5219;<code>hitTest:withEvent:</code>&#x8FD4;&#x56DE;nil;&#x82E5;&#x8FD4;&#x56DE;YES,&#x5219;&#x5411;&#x5F53;&#x524D;&#x89C6;&#x56FE;&#x7684;&#x6240;&#x6709;&#x5B50;&#x89C6;&#x56FE;(subviews)&#x53D1;&#x9001;<code>hitTest:withEvent:</code>&#x6D88;&#x606F;&#xFF0C;&#x6240;&#x6709;&#x5B50;&#x89C6;&#x56FE;&#x7684;&#x904D;&#x5386;&#x987A;&#x5E8F;&#x662F;&#x4ECE;&#x6700;&#x9876;&#x5C42;&#x89C6;&#x56FE;&#x4E00;&#x76F4;&#x5230;&#x5230;&#x6700;&#x5E95;&#x5C42;&#x89C6;&#x56FE;&#xFF0C;&#x5373;&#x4ECE;subviews&#x6570;&#x7EC4;&#x7684;&#x672B;&#x5C3E;&#x5411;&#x524D;&#x904D;&#x5386;&#xFF0C;&#x76F4;&#x5230;&#x6709;&#x5B50;&#x89C6;&#x56FE;&#x8FD4;&#x56DE;&#x975E;&#x7A7A;&#x5BF9;&#x8C61;&#x6216;&#x8005;&#x5168;&#x90E8;&#x5B50;&#x89C6;&#x56FE;&#x904D;&#x5386;&#x5B8C;&#x6BD5;&#xFF1B;&#x82E5;&#x7B2C;&#x4E00;&#x6B21;&#x6709;&#x5B50;&#x89C6;&#x56FE;&#x8FD4;&#x56DE;&#x975E;&#x7A7A;&#x5BF9;&#x8C61;&#xFF0C;&#x5219;<code>hitTest:withEvent:</code>&#x65B9;&#x6CD5;&#x8FD4;&#x56DE;&#x6B64;&#x5BF9;&#x8C61;&#xFF0C;&#x5904;&#x7406;&#x7ED3;&#x675F;&#xFF1B;&#x5982;&#x6240;&#x6709;&#x5B50;&#x89C6;&#x56FE;&#x90FD;&#x8FD4;&#x56DE;&#x975E;&#xFF0C;&#x5219;<code>hitTest:withEvent:</code>&#x65B9;&#x6CD5;&#x8FD4;&#x56DE;&#x81EA;&#x8EAB;(self)&#x3002;</p>
<h3 id="&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x5668;&#xFF08;ARC-&#x548C;-MRC&#xFF09;"><a href="#&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x5668;&#xFF08;ARC-&#x548C;-MRC&#xFF09;" class="headerlink" title="&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x5668;&#xFF08;ARC &#x548C; MRC&#xFF09;"></a>&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x5668;&#xFF08;ARC &#x548C; MRC&#xFF09;</h3><p>ARC:&#x81EA;&#x52A8;&#x5F15;&#x7528;&#x8BA1;&#x6570;&#x5668;(Automatic Reference Counting)</p>
<p>MRC:&#x624B;&#x52A8;&#x5F15;&#x7528;&#x8BA1;&#x7B97;&#x5668;&#xFF08;&#x7531;&#x4E8E;&#x73B0;&#x5728;&#x51E0;&#x4E4E;&#x4E0D;&#x7528;&#x4E86;&#xFF0C;&#x4E0D;&#x505A;&#x8FC7;&#x591A;&#x89E3;&#x8BF4;&#xFF09;</p>
<p>Objective-c&#x4E2D;&#x63D0;&#x4F9B;&#x4E86;&#x4E24;&#x79CD;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x673A;&#x5236;MRC&#xFF08;MannulReference Counting&#xFF09;&#x548C;ARC(Automatic Reference Counting)&#xFF0C;&#x5206;&#x522B;&#x63D0;&#x4F9B;&#x5BF9;&#x5185;&#x5B58;&#x7684;&#x624B;&#x52A8;&#x548C;&#x81EA;&#x52A8;&#x7BA1;&#x7406;&#xFF0C;&#x6765;&#x6EE1;&#x8DB3;&#x4E0D;&#x540C;&#x7684;&#x9700;&#x6C42;&#x3002;Xcode 4.1&#x53CA;&#x5176;&#x4EE5;&#x524D;&#x7248;&#x672C;&#x6CA1;&#x6709;ARC&#x3002;</p>
<p>&#x5728;MRC&#x7684;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x6A21;&#x5F0F;&#x4E0B;&#xFF0C;&#x4E0E;&#x5BF9;&#x53D8;&#x91CF;&#x7684;&#x7BA1;&#x7406;&#x76F8;&#x5173;&#x7684;&#x65B9;&#x6CD5;&#x6709;&#xFF1A;retain,release&#x548C;autorelease&#x3002;retain&#x548C;release&#x65B9;&#x6CD5;&#x64CD;&#x4F5C;&#x7684;&#x662F;&#x5F15;&#x7528;&#x8BB0;&#x6570;&#xFF0C;&#x5F53;&#x5F15;&#x7528;&#x8BB0;&#x6570;&#x4E3A;&#x96F6;&#x65F6;&#xFF0C;&#x4FBF;&#x81EA;&#x52A8;&#x91CA;&#x653E;&#x5185;&#x5B58;&#x3002;&#x5E76;&#x4E14;&#x53EF;&#x4EE5;&#x7528;NSAutoreleasePool&#x5BF9;&#x8C61;&#xFF0C;&#x5BF9;&#x52A0;&#x5165;&#x81EA;&#x52A8;&#x91CA;&#x653E;&#x6C60;&#xFF08;autorelease&#x8C03;&#x7528;&#xFF09;&#x7684;&#x53D8;&#x91CF;&#x8FDB;&#x884C;&#x7BA1;&#x7406;&#xFF0C;&#x5F53;&#x5185;&#x5B58;&#x7D27;&#x5F20;&#x65F6;&#x56DE;&#x6536;&#x5185;&#x5B58;&#x3002;<br>&#xFF08;1&#xFF09; retain&#xFF0C;&#x8BE5;&#x65B9;&#x6CD5;&#x7684;&#x4F5C;&#x7528;&#x662F;&#x5C06;&#x5185;&#x5B58;&#x6570;&#x636E;&#x7684;&#x6240;&#x6709;&#x6743;&#x9644;&#x7ED9;&#x53E6;&#x4E00;&#x6307;&#x9488;&#x53D8;&#x91CF;&#xFF0C;&#x5F15;&#x7528;&#x6570;&#x52A0;1&#xFF0C;&#x5373;retainCount+= 1;<br>&#xFF08;2&#xFF09; release&#xFF0C;&#x8BE5;&#x65B9;&#x6CD5;&#x662F;&#x91CA;&#x653E;&#x6307;&#x9488;&#x53D8;&#x91CF;&#x5BF9;&#x5185;&#x5B58;&#x6570;&#x636E;&#x7684;&#x6240;&#x6709;&#x6743;&#xFF0C;&#x5F15;&#x7528;&#x6570;&#x51CF;1&#xFF0C;&#x5373;retainCount-= 1;<br>&#xFF08;3&#xFF09; autorelease&#xFF0C;&#x8BE5;&#x65B9;&#x6CD5;&#x662F;&#x5C06;&#x8BE5;&#x5BF9;&#x8C61;&#x5185;&#x5B58;&#x7684;&#x7BA1;&#x7406;&#x653E;&#x5230;autoreleasepool&#x4E2D;&#x3002;</p>
<p>&#x5728;ARC&#x4E2D;&#x4E0E;&#x5185;&#x5B58;&#x7BA1;&#x7406;&#x6709;&#x5173;&#x7684;&#x6807;&#x8BC6;&#x7B26;&#xFF0C;&#x53EF;&#x4EE5;&#x5206;&#x4E3A;&#x53D8;&#x91CF;&#x6807;&#x8BC6;&#x7B26;&#x548C;&#x5C5E;&#x6027;&#x6807;&#x8BC6;&#x7B26;&#xFF0C;&#x5BF9;&#x4E8E;&#x53D8;&#x91CF;&#x9ED8;&#x8BA4;&#x4E3A;<code>__strong</code>&#xFF0C;&#x800C;&#x5BF9;&#x4E8E;&#x5C5E;&#x6027;&#x9ED8;&#x8BA4;&#x4E3A;<code>unsafe_unretained</code>&#x3002;&#x4E5F;&#x5B58;&#x5728;autoreleasepool&#x3002;</p>
<p>&#x5176;&#x4E2D;assign/retain/copy&#x4E0E;MRC&#x4E0B;property&#x7684;&#x6807;&#x8BC6;&#x7B26;&#x610F;&#x4E49;&#x76F8;&#x540C;&#xFF0C;strong&#x7C7B;&#x4F3C;&#x4E0E;retain,assign&#x7C7B;&#x4F3C;&#x4E8E;<code>unsafe_unretained</code>&#xFF0C;<code>strong/weak/unsafe_unretained</code>&#x4E0E;ARC&#x4E0B;&#x53D8;&#x91CF;&#x6807;&#x8BC6;&#x7B26;&#x610F;&#x4E49;&#x76F8;&#x540C;&#xFF0C;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x7528;&#x4E8E;&#x5C5E;&#x6027;&#x7684;&#x6807;&#x8BC6;&#xFF0C;&#x4E00;&#x4E2A;&#x7528;&#x4E8E;&#x53D8;&#x91CF;&#x7684;&#x6807;&#x8BC6;(&#x5E26;&#x4E24;&#x4E2A;&#x4E0B;&#x5212;&#x77ED;&#x7EBF;__)&#x3002;</p>
<h3 id="&#x751F;&#x547D;&#x5468;&#x671F;"><a href="#&#x751F;&#x547D;&#x5468;&#x671F;" class="headerlink" title="&#x751F;&#x547D;&#x5468;&#x671F;"></a>&#x751F;&#x547D;&#x5468;&#x671F;</h3><p><strong>app&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6709;5&#x79CD;&#x72B6;&#x6001;&#xFF1A;</strong></p>
<p>Not running&#x672A;&#x8FD0;&#x884C;&#xFF1A;&#x7A0B;&#x5E8F;&#x6CA1;&#x542F;&#x52A8;&#x3002;</p>
<p>Inactive&#x672A;&#x6FC0;&#x6D3B;&#xFF1A;&#x7A0B;&#x5E8F;&#x5728;&#x524D;&#x53F0;&#x8FD0;&#x884C;&#xFF0C;&#x4E0D;&#x8FC7;&#x6CA1;&#x6709;&#x63A5;&#x6536;&#x5230;&#x4E8B;&#x4EF6;&#x3002;&#x5728;&#x6CA1;&#x6709;&#x4E8B;&#x4EF6;&#x5904;&#x7406;&#x60C5;&#x51B5;&#x4E0B;&#x7A0B;&#x5E8F;&#x901A;&#x5E38;&#x505C;&#x7559;&#x5728;&#x8FD9;&#x4E2A;&#x72B6;&#x6001;&#x3002;</p>
<p>Active&#x6FC0;&#x6D3B;&#xFF1A;&#x7A0B;&#x5E8F;&#x5728;&#x524D;&#x53F0;&#x8FD0;&#x884C;&#x800C;&#x4E14;&#x63A5;&#x6536;&#x5230;&#x4E86;&#x4E8B;&#x4EF6;&#x3002;&#x8FD9;&#x4E5F;&#x662F;&#x524D;&#x53F0;&#x7684;&#x4E00;&#x4E2A;&#x6B63;&#x5E38;&#x7684;&#x6A21;&#x5F0F;&#x3002;</p>
<p>Backgroud&#x540E;&#x53F0;&#xFF1A;&#x7A0B;&#x5E8F;&#x5728;&#x540E;&#x53F0;&#x800C;&#x4E14;&#x80FD;&#x6267;&#x884C;&#x4EE3;&#x7801;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x7A0B;&#x5E8F;&#x8FDB;&#x5165;&#x8FD9;&#x4E2A;&#x72B6;&#x6001;&#x540E;&#x4F1A;&#x5728;&#x5728;&#x8FD9;&#x4E2A;&#x72B6;&#x6001;&#x4E0A;&#x505C;&#x7559;&#x4E00;&#x4F1A;&#x3002;&#x65F6;&#x95F4;&#x5230;&#x4E4B;&#x540E;&#x4F1A;&#x8FDB;&#x5165;&#x6302;&#x8D77;&#x72B6;&#x6001;(Suspended)&#x3002;&#x6709;&#x7684;&#x7A0B;&#x5E8F;&#x7ECF;&#x8FC7;&#x7279;&#x6B8A;&#x7684;&#x8BF7;&#x6C42;&#x540E;&#x53EF;&#x4EE5;&#x957F;&#x671F;&#x5904;&#x4E8E;Backgroud&#x72B6;&#x6001;&#x3002;</p>
<p>Suspended&#x6302;&#x8D77;&#xFF1A;&#x7A0B;&#x5E8F;&#x5728;&#x540E;&#x53F0;&#x4E0D;&#x80FD;&#x6267;&#x884C;&#x4EE3;&#x7801;&#x3002;&#x7CFB;&#x7EDF;&#x4F1A;&#x81EA;&#x52A8;&#x628A;&#x7A0B;&#x5E8F;&#x53D8;&#x6210;&#x8FD9;&#x4E2A;&#x72B6;&#x6001;&#x800C;&#x4E14;&#x4E0D;&#x4F1A;&#x53D1;&#x51FA;&#x901A;&#x77E5;&#x3002;&#x5F53;&#x6302;&#x8D77;&#x65F6;&#xFF0C;&#x7A0B;&#x5E8F;&#x8FD8;&#x662F;&#x505C;&#x7559;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#x7684;&#xFF0C;&#x5F53;&#x7CFB;&#x7EDF;&#x5185;&#x5B58;&#x4F4E;&#x65F6;&#xFF0C;&#x7CFB;&#x7EDF;&#x5C31;&#x628A;&#x6302;&#x8D77;&#x7684;&#x7A0B;&#x5E8F;&#x6E05;&#x9664;&#x6389;&#xFF0C;&#x4E3A;&#x524D;&#x53F0;&#x7A0B;&#x5E8F;&#x63D0;&#x4F9B;&#x66F4;&#x591A;&#x7684;&#x5185;&#x5B58;&#x3002;</p>
<p>iOS&#x7684;&#x5165;&#x53E3;&#x5728;main.m&#x6587;&#x4EF6;&#x7684;main&#x51FD;&#x6570;&#xFF0C;&#x6839;&#x636E;UIApplicationMain&#x51FD;&#x6570;&#xFF0C;&#x7A0B;&#x5E8F;&#x5C06;&#x8FDB;&#x5165;AppDelegate.m&#xFF0C;&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#x662F;xcode&#x65B0;&#x5EFA;&#x5DE5;&#x7A0B;&#x65F6;&#x81EA;&#x52A8;&#x751F;&#x6210;&#x7684;&#x3002;AppDelegate.m&#x6587;&#x4EF6;&#xFF0C;&#x5173;&#x4E4E;&#x7740;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x751F;&#x547D;&#x5468;&#x671F;&#x3002;</p>
<p>1&#x3001;application didFinishLaunchingWithOptions&#xFF1A;&#x5F53;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x542F;&#x52A8;&#x65F6;&#x6267;&#x884C;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x542F;&#x52A8;&#x5165;&#x53E3;&#xFF0C;&#x53EA;&#x5728;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x542F;&#x52A8;&#x65F6;&#x6267;&#x884C;&#x4E00;&#x6B21;&#x3002;&#x82E5;&#x7528;&#x6237;&#x76F4;&#x63A5;&#x542F;&#x52A8;&#xFF0C;lauchOptions&#x5185;&#x65E0;&#x6570;&#x636E;,&#x82E5;&#x901A;&#x8FC7;&#x5176;&#x4ED6;&#x65B9;&#x5F0F;&#x542F;&#x52A8;&#x5E94;&#x7528;&#xFF0C;lauchOptions&#x5305;&#x542B;&#x5BF9;&#x5E94;&#x65B9;&#x5F0F;&#x7684;&#x5185;&#x5BB9;&#x3002;</p>
<p>2&#x3001;applicationWillResignActive&#xFF1A;&#x5728;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5C06;&#x8981;&#x7531;&#x6D3B;&#x52A8;&#x72B6;&#x6001;&#x5207;&#x6362;&#x5230;&#x975E;&#x6D3B;&#x52A8;&#x72B6;&#x6001;&#x65F6;&#x5019;&#xFF0C;&#x8981;&#x6267;&#x884C;&#x7684;&#x59D4;&#x6258;&#x8C03;&#x7528;&#xFF0C;&#x5982; &#x6309;&#x4E0B; home &#x6309;&#x94AE;&#xFF0C;&#x8FD4;&#x56DE;&#x4E3B;&#x5C4F;&#x5E55;&#xFF0C;&#x6216;&#x5168;&#x5C4F;&#x4E4B;&#x95F4;&#x5207;&#x6362;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7B49;&#x3002;</p>
<p>3&#x3001;applicationDidEnterBackground&#xFF1A;&#x5728;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5DF2;&#x8FDB;&#x5165;&#x540E;&#x53F0;&#x7A0B;&#x5E8F;&#x65F6;&#xFF0C;&#x8981;&#x6267;&#x884C;&#x7684;&#x59D4;&#x6258;&#x8C03;&#x7528;&#x3002;</p>
<p>4&#x3001;applicationWillEnterForeground&#xFF1A;&#x5728;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5C06;&#x8981;&#x8FDB;&#x5165;&#x524D;&#x53F0;&#x65F6;(&#x88AB;&#x6FC0;&#x6D3B;)&#xFF0C;&#x8981;&#x6267;&#x884C;&#x7684;&#x59D4;&#x6258;&#x8C03;&#x7528;&#xFF0C;&#x521A;&#x597D;&#x4E0E;applicationWillResignActive &#x65B9;&#x6CD5;&#x76F8;&#x5BF9;&#x5E94;&#x3002;</p>
<p>5&#x3001;applicationDidBecomeActive&#xFF1A;&#x5728;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5DF2;&#x88AB;&#x6FC0;&#x6D3B;&#x540E;&#xFF0C;&#x8981;&#x6267;&#x884C;&#x7684;&#x59D4;&#x6258;&#x8C03;&#x7528;&#xFF0C;&#x521A;&#x597D;&#x4E0E;applicationDidEnterBackground &#x65B9;&#x6CD5;&#x76F8;&#x5BF9;&#x5E94;&#x3002;</p>
<p>6&#x3001;applicationWillTerminate&#xFF1A;&#x5728;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8981;&#x5B8C;&#x5168;&#x63A8;&#x51FA;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8981;&#x6267;&#x884C;&#x7684;&#x59D4;&#x6258;&#x8C03;&#x7528;&#xFF0C;&#x8FD9;&#x4E2A;&#x9700;&#x8981;&#x8981;&#x8BBE;&#x7F6E;UIApplicationExitsOnSuspend&#x7684;&#x952E;&#x503C;&#x3002;</p>
<p>&#x521D;&#x6B21;&#x542F;&#x52A8;&#xFF1A;</p>
<p>iOS_didFinishLaunchingWithOptions</p>
<p>iOS_applicationDidBecomeActive</p>
<p>&#x6309;&#x4E0B;home&#x952E;&#xFF1A;</p>
<p>iOS_applicationWillResignActive</p>
<p>iOS_applicationDidEnterBackground</p>
<p>&#x70B9;&#x51FB;&#x7A0B;&#x5E8F;&#x56FE;&#x6807;&#x8FDB;&#x5165;&#xFF1A;</p>
<p>iOS_applicationWillEnterForeground</p>
<p>iOS_applicationDidBecomeActive</p>
<p>&#x5F53;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8FDB;&#x5165;&#x540E;&#x53F0;&#x65F6;,&#x5E94;&#x8BE5;&#x4FDD;&#x5B58;&#x7528;&#x6237;&#x6570;&#x636E;&#x6216;&#x72B6;&#x6001;&#x4FE1;&#x606F;&#xFF0C;&#x6240;&#x6709;&#x6CA1;&#x5199;&#x5230;&#x78C1;&#x76D8;&#x7684;&#x6587;&#x4EF6;&#x6216;&#x4FE1;&#x606F;&#xFF0C;&#x5728;&#x8FDB;&#x5165;&#x540E;&#x53F0;&#x65F6;&#xFF0C;&#x6700;&#x540E;&#x90FD;&#x5199;&#x5230;&#x78C1;&#x76D8;&#x53BB;&#xFF0C;&#x56E0;&#x4E3A;&#x7A0B;&#x5E8F;&#x53EF;&#x80FD;&#x5728;&#x540E;&#x53F0;&#x88AB;&#x6740;&#x6B7B;&#x3002;&#x91CA;&#x653E;&#x5C3D;&#x53EF;&#x80FD;&#x91CA;&#x653E;&#x7684;&#x5185;&#x5B58;&#x3002;</p>
<pre><code>- (void)applicationDidEnterBackground:(UIApplication *)application
</code></pre><p>&#x65B9;&#x6CD5;&#x6709;&#x5927;&#x6982;5&#x79D2;&#x7684;&#x65F6;&#x95F4;&#x8BA9;&#x4F60;&#x5B8C;&#x6210;&#x8FD9;&#x4E9B;&#x4EFB;&#x52A1;&#x3002;&#x5982;&#x679C;&#x8D85;&#x8FC7;&#x65F6;&#x95F4;&#x8FD8;&#x6709;&#x672A;&#x5B8C;&#x6210;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x4F60;&#x7684;&#x7A0B;&#x5E8F;&#x5C31;&#x4F1A;&#x88AB;&#x7EC8;&#x6B62;&#x800C;&#x4E14;&#x4ECE;&#x5185;&#x5B58;&#x4E2D;&#x6E05;&#x9664;&#x3002;</p>
<p>&#x5982;&#x679C;&#x8FD8;&#x9700;&#x8981;&#x957F;&#x65F6;&#x95F4;&#x7684;&#x8FD0;&#x884C;&#x4EFB;&#x52A1;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x8BE5;&#x65B9;&#x6CD5;&#x4E2D;&#x8C03;&#x7528;</p>
<pre><code>[application beginBackgroundTaskWithExpirationHandler:^{ 

NSLog(@&quot;begin Background Task With Expiration Handler&quot;); 

}];
</code></pre><p>&#x7A0B;&#x5E8F;&#x7EC8;&#x6B62;</p>
<p>&#x7A0B;&#x5E8F;&#x53EA;&#x8981;&#x7B26;&#x5408;&#x4EE5;&#x4E0B;&#x60C5;&#x51B5;&#x4E4B;&#x4E00;&#xFF0C;&#x53EA;&#x8981;&#x8FDB;&#x5165;&#x540E;&#x53F0;&#x6216;&#x6302;&#x8D77;&#x72B6;&#x6001;&#x5C31;&#x4F1A;&#x7EC8;&#x6B62;&#xFF1A;</p>
<p>&#x2460;iOS4.0&#x4EE5;&#x524D;&#x7684;&#x7CFB;&#x7EDF;</p>
<p>&#x2461;app&#x662F;&#x57FA;&#x4E8E;iOS4.0&#x4E4B;&#x524D;&#x7CFB;&#x7EDF;&#x5F00;&#x53D1;&#x7684;&#x3002;</p>
<p>&#x2462;&#x8BBE;&#x5907;&#x4E0D;&#x652F;&#x6301;&#x591A;&#x4EFB;&#x52A1;</p>
<p>&#x2463;&#x5728;Info.plist&#x6587;&#x4EF6;&#x4E2D;&#xFF0C;&#x7A0B;&#x5E8F;&#x5305;&#x542B;&#x4E86; UIApplicationExitsOnSuspend &#x952E;&#x3002;</p>
<p>&#x7CFB;&#x7EDF;&#x5E38;&#x5E38;&#x662F;&#x4E3A;&#x5176;&#x4ED6;app&#x542F;&#x52A8;&#x65F6;&#x7531;&#x4E8E;&#x5185;&#x5B58;&#x4E0D;&#x8DB3;&#x800C;&#x56DE;&#x6536;&#x5185;&#x5B58;&#x6700;&#x540E;&#x9700;&#x8981;&#x7EC8;&#x6B62;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x4F46;&#x6709;&#x65F6;&#x4E5F;&#x4F1A;&#x662F;&#x7531;&#x4E8E;app&#x5F88;&#x957F;&#x65F6;&#x95F4;&#x624D;&#x54CD;&#x5E94;&#x800C;&#x7EC8;&#x6B62;&#x3002;&#x5982;&#x679C;app&#x5F53;&#x65F6;&#x8FD0;&#x884C;&#x5728;&#x540E;&#x53F0;&#x5E76;&#x4E14;&#x6CA1;&#x6709;&#x6682;&#x505C;&#xFF0C;&#x7CFB;&#x7EDF;&#x4F1A;&#x5728;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7EC8;&#x6B62;&#x4E4B;&#x524D;&#x8C03;&#x7528;app&#x7684;&#x4EE3;&#x7406;&#x7684;&#x65B9;&#x6CD5; <code>- (void)applicationWillTerminate:(UIApplication *)application</code>&#xFF0C;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x8BA9;&#x4F60;&#x53EF;&#x4EE5;&#x505A;&#x4E00;&#x4E9B;&#x6E05;&#x7406;&#x5DE5;&#x4F5C;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x4FDD;&#x5B58;&#x4E00;&#x4E9B;&#x6570;&#x636E;&#x6216;app&#x7684;&#x72B6;&#x6001;&#x3002;&#x8FD9;&#x4E2A;&#x65B9;&#x6CD5;&#x4E5F;&#x6709;5&#x79D2;&#x949F;&#x7684;&#x9650;&#x5236;&#x3002;&#x8D85;&#x65F6;&#x540E;&#x65B9;&#x6CD5;&#x4F1A;&#x8FD4;&#x56DE;&#x7A0B;&#x5E8F;&#x4ECE;&#x5185;&#x5B58;&#x4E2D;&#x6E05;&#x9664;&#x3002;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x624B;&#x5DE5;&#x5173;&#x95ED;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;</p>
<h3 id="&#x548C;&#x5176;&#x4ED6;&#x52A8;&#x6001;&#x8BED;&#x8A00;&#x7684;&#x533A;&#x522B;"><a href="#&#x548C;&#x5176;&#x4ED6;&#x52A8;&#x6001;&#x8BED;&#x8A00;&#x7684;&#x533A;&#x522B;" class="headerlink" title="&#x548C;&#x5176;&#x4ED6;&#x52A8;&#x6001;&#x8BED;&#x8A00;&#x7684;&#x533A;&#x522B;"></a>&#x548C;&#x5176;&#x4ED6;&#x52A8;&#x6001;&#x8BED;&#x8A00;&#x7684;&#x533A;&#x522B;</h3><p>OC&#x4E2D;&#x65B9;&#x6CD5;&#x7684;&#x5B9E;&#x73B0;&#x53EA;&#x80FD;&#x5199;&#x5728;<code>@implementation&#xB7;&#xB7;@end</code>&#x4E2D;&#xFF0C;&#x5BF9;&#x8C61;&#x65B9;&#x6CD5;&#x7684;&#x58F0;&#x660E;&#x53EA;&#x80FD;&#x5199;&#x5728;<code>@interface&#xB7;&#xB7;&#xB7;@end</code>&#x4E2D;&#x95F4;&#xFF1B;&#x5BF9;&#x8C61;&#x65B9;&#x6CD5;&#x90FD;&#x4EE5;-&#x53F7;&#x5F00;&#x5934;&#xFF0C;&#x7C7B;&#x65B9;&#x6CD5;&#x90FD;&#x4EE5;+&#x53F7;&#x5F00;&#x5934;&#xFF1B;&#x51FD;&#x6570;&#x5C5E;&#x4E8E;&#x6574;&#x4E2A;&#x6587;&#x4EF6;&#xFF0C;&#x53EF;&#x4EE5;&#x5199;&#x5728;&#x6587;&#x4EF6;&#x4E2D;&#x7684;&#x4EFB;&#x4F55;&#x4F4D;&#x7F6E;&#xFF0C;&#x5305;&#x62EC;<code>@interface&#xB7;&#xB7;@end</code>&#x4E2D;&#xFF0C;&#x4F46;&#x5199;&#x5728;<code>@interface&#xB7;&#xB7;&#xB7;@end</code>&#x4F1A;&#x65E0;&#x6CD5;&#x8BC6;&#x522B;&#xFF1B;</p>
<p>&#x5BF9;&#x8C61;&#x65B9;&#x6CD5;&#x53EA;&#x80FD;&#x7531;&#x5BF9;&#x8C61;&#x6765;&#x8C03;&#x7528;&#xFF0C;&#x7C7B;&#x65B9;&#x6CD5;&#x53EA;&#x80FD;&#x7531;&#x7C7B;&#x6765;&#x8C03;&#x7528;&#xFF0C;&#x4E0D;&#x80FD;&#x5F53;&#x505A;&#x51FD;&#x6570;&#x4E00;&#x6837;&#x8C03;&#x7528;&#xFF0C;&#x5BF9;&#x8C61;&#x65B9;&#x6CD5;&#x5F52;&#x7C7B;\\&#x5BF9;&#x8C61;&#x6240;&#x6709;&#xFF1B;&#x7C7B;&#x65B9;&#x6CD5;&#x8C03;&#x7528;&#x4E0D;&#x4F9D;&#x8D56;&#x4E8E;&#x5BF9;&#x8C61;&#xFF1B;&#x7C7B;&#x65B9;&#x6CD5;&#x5185;&#x90E8;&#x4E0D;&#x80FD;&#x76F4;&#x63A5;&#x901A;&#x8FC7;&#x6210;&#x5458;&#x53D8;&#x91CF;&#x540D;&#x8BBF;&#x95EE;&#x5BF9;&#x8C61;&#x7684;&#x6210;&#x5458;&#x53D8;&#x91CF;&#x3002;OC&#x53EA;&#x652F;&#x6301;&#x5355;&#x7EE7;&#x627F;&#xFF0C;&#x6CA1;&#x6709;&#x63A5;&#x53E3;&#xFF0C;&#x4F46;&#x53EF;&#x4EE5;&#x7528;delegate&#x4EE3;&#x66FF;&#x3002;</p>
<p>Objective-C&#x4E0E;&#x5176;&#x4ED6;&#x8BED;&#x8A00;&#x6700;&#x5927;&#x7684;&#x533A;&#x522B;&#x662F;&#x5176;&#x8FD0;&#x884C;&#x65F6;&#x7684;&#x52A8;&#x6001;&#x6027;&#xFF0C;&#x5B83;&#x80FD;&#x8BA9;&#x4F60;&#x5728;&#x8FD0;&#x884C;&#x65F6;&#x4E3A;&#x7C7B;&#x6DFB;&#x52A0;&#x65B9;&#x6CD5;&#x6216;&#x8005;&#x53BB;&#x9664;&#x65B9;&#x6CD5;&#x4EE5;&#x53CA;&#x4F7F;&#x7528;&#x53CD;&#x5C04;&#x3002;&#x6781;&#x5927;&#x7684;&#x65B9;&#x4FBF;&#x4E86;&#x7A0B;&#x5E8F;&#x7684;&#x6269;&#x5C55;&#x3002;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1170656-103f66199e930d9d.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt=""></p>

            <div class="clearfix"></div>
            <hr class="nogutter">
        </div>


        <nav class="pagination" role="pagination">


<div class="ds-share flat" data-thread-key="2014/08/30/如何优雅的谈论OC/" data-title="如何优雅的谈论OC" data-images="https://avatars0.githubusercontent.com/u/10378248?v=3&s=460" data-content="如何优雅的谈论OC 是最近写的文章，希望能帮到您！" data-url="https://dangdangfeng.github.io/2014/08/30/如何优雅的谈论OC/">
    <div class="ds-share-inline">
      <ul  class="ds-share-icons-16">
        
        <li data-toggle="ds-share-icons-more"><a class="ds-more" href="javascript:void(0);">分享到：</a></li>
        <li><a class="ds-weibo" href="javascript:void(0);" data-service="weibo">微博</a></li>
        <li><a class="ds-qzone" href="javascript:void(0);" data-service="qzone">QQ空间</a></li>
        <li><a class="ds-qqt" href="javascript:void(0);" data-service="qqt">腾讯微博</a></li>
        <li><a class="ds-wechat" href="javascript:void(0);" data-service="wechat">微信</a></li>
        
      </ul>
      <div class="ds-share-icons-more">
      </div>
    </div>
 </div>

 <br/>

    
    <a class="pull-left" href="/2014/08/31/从代码看一个程序员的笔力/" style="float: left;">
        ← 从代码看一个程序员的笔力
    </a>
    
    
    <a class="pull-right" href="/2014/07/24/那些著名或非著名的iOS面试题－后编/">
        那些著名或非著名的iOS面试题－后编 →
    </a>
    

    
</nav>



        
        <div class="duoshuo">


<div class="ds-thread" data-thread-key="2014/08/30/如何优雅的谈论OC/" data-title="如何优雅的谈论OC" data-url="https://dangdangfeng.github.io/2014/08/30/如何优雅的谈论OC/"></div>



<script type="text/javascript">
var duoshuoQuery = {short_name:"deter"};
(function() {
	var ds = document.createElement('script');
	ds.type = 'text/javascript';ds.async = true;
	ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
	ds.charset = 'UTF-8';
	(document.getElementsByTagName('head')[0] 
	 || document.getElementsByTagName('body')[0]).appendChild(ds);
})();
</script>
</div>
    </div>
</section>


      
<!-- ============================ Footer =========================== -->

<footer>
    <div class="container">
            <div class="copy">
                <p>
                    &copy; 2010<script>new Date().getFullYear()>2010&&document.write("-"+new Date().getFullYear());</script>, Content By 吴白. All Rights Reserved.
                </p>
                <p>Theme By <a href="//go.kieran.top" style="color: #767D84">Kieran</a></p>
            </div>
            <div class="social">
                <ul>
                    
                    <li><a href="https://github.com/" title="Github" target="_blank"><i class="icon-github"></i></a>&nbsp;</li>
                    
                    
                    <li><a href="https://twitter.com/" title="Twitter" target="_blank"><i class="icon-twitter"></i></a>&nbsp;</li>
                    
                    
                    <li><a href="https://www.facebook.com/" title="Facebook" target="_blank"><i class="icon-facebook"></i></a>&nbsp;</li>
                    
                    
                    <li><a href="https://google.com/" title="Google-Plus" target="_blank"><i class="icon-google-plus"></i></a>&nbsp;</li>
                    
                    
                    <li><a href="http://weibo.com/" title="Sina-Weibo" target="_blank"><i class="icon-sina-weibo"></i></a>&nbsp;</li>
                    
                </ul>
            </div>
            <div class="clearfix"> </div>
        </div>
</footer>

<!-- ============================ END Footer =========================== -->
      <!-- Load our scripts -->
        
<!-- Resizable 'on-demand' full-height hero -->
<script type="text/javascript">
    
    var resizeHero = function () {
        var hero = $(".cover,.heightblock"),
            window1 = $(window);
        hero.css({
            "height": window1.height()
        });
    };
    
    resizeHero();
    
    $(window).resize(function () {
        resizeHero();
    });
</script>
<script src="/js/plugins.min.js"></script><!-- Bootstrap core and concatenated plugins always load here -->
<script src="/js/jquery.flexslider-min.js"></script><!-- Flexslider plugin -->
<script src="/js/scripts.js"></script><!-- Theme scripts -->

<!-- Initiate flexslider plugin -->
<script type="text/javascript">
    $(document).ready(function($) {
      $('.flexslider').flexslider({
        animation: "fade",
        prevText: "",
        nextText: "",
        directionNav: true
      });
    });
</script>

</body>
</html>
