<!DOCTYPE html>
<!--[if lte IE 8 ]>
<html class="ie" xmlns="http://www.w3.org/1999/xhtml" xml:lang="en-US" lang="en-US">
<![endif]-->
<!--[if (gte IE 9)|!(IE)]><!-->
<!--
***************  *      *     *
      8          *    *       *
      8          *  *         *
      8          **           *
      8          *  *         *
      8          *    *       *
      8          *      *     *
      8          *        *   ***********    -----Theme By Kieran(http://go.kieran.top)
-->
<html xmlns="http://www.w3.org/1999/xhtml" xml:lang="en-US" lang="en-US">
<!--<![endif]-->

<head>
  <title>如何编写稳定流畅的iOS移动端应用 | 流城</title>
  <!-- Meta data -->
    <meta http-equiv="Content-Type" content="text/html" charset="UTF-8" >
    <meta http-equiv="X-UA-Compatible" content="IE=edge"/>
    <meta name="viewport" content="width=device-width, initial-scale=1.0" />
    <meta name="generator" content="流城">
    <meta name="author" content="吴白">
    <meta name="description" content="" />
    <meta name="keywords" content="" />

    <!-- Favicon, (keep icon in root folder) -->
    <link rel="Shortcut Icon" href="/img/favicon.ico" type="image/ico">

    <link rel="alternate" href="/atom.xml" title="流城" type="application/atom+xml">
    <link rel="stylesheet" href="/css/all.css" media="screen" type="text/css">
	
    <link rel="stylesheet" href="/highlightjs/vs.css" type="text/css">
    
    

    <!-- Custom stylesheet, (add custom styles here, always load last) -->
    <!-- Load our stylesheet for IE8 -->
    <!--[if IE 8]>
    <link rel="stylesheet" type="text/css" href="/css/ie8.css" />
    <![endif]-->

    <!-- Google Webfonts (Monserrat 400/700, Open Sans 400/600) -->
    <!--<link href='//fonts.useso.com/css?family=Montserrat:400,700' rel='stylesheet' type='text/css'>-->
    <!--<link href='//fonts.useso.com/css?family=Open+Sans:400,600' rel='stylesheet' type='text/css'>-->

    <!-- Load our fonts individually if IE8+, to avoid faux bold & italic rendering -->
    <!--[if IE]>
    <!--<link href='http://fonts.useso.com/css?family=Montserrat:400' rel='stylesheet' type='text/css'> -->
    <!--<link href='http://fonts.useso.com/css?family=Montserrat:700' rel='stylesheet' type='text/css'> -->
    <!--<link href='http://fonts.useso.com/css?family=Open+Sans:400' rel='stylesheet' type='text/css'>-->
    <!--<link href='http://fonts.useso.com/css?family=Open+Sans:600' rel='stylesheet' type='text/css'>-->
    <![endif]-->

    <!-- jQuery | Load our jQuery, with an alternative source fallback to a local version if request is unavailable -->
    <script src="/js/jquery-1.11.1.min.js"></script>
    <script>window.jQuery || document.write('<script src="js/jquery-1.11.1.min.js"><\/script>')</script>

    <!-- Load these in the <head> for quicker IE8+ load times -->
    <!-- HTML5 shim and Respond.js IE8 support of HTML5 elements and media queries -->
    <!--[if lt IE 9]>
    <script src="/js/html5shiv.min.js"></script>
    <script src="/js/respond.min.js"></script>
    <![endif]-->










  
  
  <link rel="alternate" type="application/atom+xml" title="Atom 0.3" href="atom.xml">
  
  

  
  <style>.col-md-8.col-md-offset-2.opening-statement img{display:none;}</style>
</head>

<!--
<body class="post-template">
-->
<body id="index" class="lightnav animsition">

      <!-- ============================ Off-canvas navigation =========================== -->

    <div class="sb-slidebar sb-right sb-style-overlay sb-momentum-scrolling">
        <div class="sb-close" aria-label="Close Menu" aria-hidden="true">
            <img src="/img/close.png" alt="Close"/>
        </div>
        <!-- Lists in Slidebars -->
        <ul class="sb-menu">
            <li><a href="/" class="animsition-link" title="Home">Home</a></li>
            <li><a href="/archives" class="animsition-link" title="archive">archives</a></li>
            <!-- Dropdown Menu -->
			 
            <li>
                <a class="sb-toggle-submenu">Works<span class="sb-caret"></span></a>
                <ul class="sb-submenu">
                    
                        <li><a href="http://www.gome.com.cn" target="_BLANK" class="animsition-link">Gome</a></li>
                    
                        <li><a href="http://www.yintai.com" target="_BLANK" class="animsition-link">YinTai</a></li>
                    
                </ul>
            </li>
            
            
            
            <li>
                <a class="sb-toggle-submenu">Links<span class="sb-caret"></span></a>
                <ul class="sb-submenu">
                    
                    <li><a href="http://www.jianshu.com/users/211925b3ca7c/latest_articles" class="animsition-link">吴白</a></li>
                    
                    <li><a href="http://www.jianshu.com/users/19f4bf67c705/latest_articles" class="animsition-link">吴禅</a></li>
                    
                </ul>
            </li>
            
        </ul>
        <!-- Lists in Slidebars -->
        <ul class="sb-menu secondary">
            <li><a href="/about" class="animsition-link" title="about">About</a></li>
            <li><a href="/atom.xml" class="animsition-link" title="rss">RSS</a></li>
        </ul>
    </div>
    
    <!-- ============================ END Off-canvas navigation =========================== -->

    <!-- ============================ #sb-site Main Page Wrapper =========================== -->

    <div id="sb-site">
        <!-- #sb-site - All page content should be contained within this id, except the off-canvas navigation itself -->

        <!-- ============================ Header & Logo bar =========================== -->

        <div id="navigation" class="navbar navbar-fixed-top">
            <div class="navbar-inner">
                <div class="container">
                    <!-- Nav logo -->
                    <div class="logo">
                        <a href="/" title="Logo" class="animsition-link">
                         <img src="/img/logo.png" alt="Logo" width="35px;"/> 
                        </a>
                    </div>
                    <!-- // Nav logo -->
                    <!-- Info-bar -->
                    <nav>
                        <ul class="nav">
                            <li><a href="/" class="animsition-link">流城</a></li>
                            <li class="nolink"><span>Always </span>Creative.</li>
                            
                            <li><a href="https://github.com/" title="Github" target="_blank"><i class="icon-github"></i></a></li>
                            
                            
                            <li><a href="https://twitter.com/" title="Twitter" target="_blank"><i class="icon-twitter"></i></a></li>
                            
                            
                            <li><a href="https://www.facebook.com/" title="Facebook" target="_blank"><i class="icon-facebook"></i></a></li>
                            
                            
                            <li><a href="https://google.com/" title="Google-Plus" target="_blank"><i class="icon-google-plus"></i></a></li>
                            
                            
                            <li><a href="http://weibo.com/" title="Sina-Weibo" target="_blank"><i class="icon-sina-weibo"></i></a></li>
                            
                            <li class="nolink"><span>Welcome!</span></li>
                        </ul>
                    </nav>
                    <!--// Info-bar -->
                </div>
                <!-- // .container -->
                <div class="learnmore sb-toggle-right">More</div>
                <button type="button" class="navbar-toggle menu-icon sb-toggle-right" title="More">
                <span class="sr-only">Toggle navigation</span>
                <span class="icon-bar before"></span>
                <span class="icon-bar main"></span>
                <span class="icon-bar after"></span>
                </button>
            </div>
            <!-- // .navbar-inner -->
        </div>

        <!-- ============================ Header & Logo bar =========================== -->


      
<section id="intro">
    <div class="container">
        <div class="row col-md-offset-2">
            <div class="col-md-8">
    			<span class="post-meta">
      <time datetime="2013-11-30T16:53:32.000Z" itemprop="datePublished">
          2013-12-01
      </time>
    
    
    | 
    <a href='/tags/technology/'>technology</a>
    
    
</span>
                <h1>如何编写稳定流畅的iOS移动端应用</h1>
            </div>
        </div>
        <!--<div class="col-md-8 col-md-offset-2">-->
        <div class="col-md-offset-2">
      		<h4 id="&#x4E0D;&#x5FD8;&#x521D;&#x5FC3;"><a href="#&#x4E0D;&#x5FD8;&#x521D;&#x5FC3;" class="headerlink" title="&#x4E0D;&#x5FD8;&#x521D;&#x5FC3;"></a>&#x4E0D;&#x5FD8;&#x521D;&#x5FC3;</h4><p>&#x5728;&#x8FC7;&#x53BB;&#x51E0;&#x5E74;&#x95F4;&#xFF0C;&#x79FB;&#x52A8;&#x5E94;&#x7528;&#x4EE5;&#x96F7;&#x9706;&#x4E4B;&#x52BF;&#x5E2D;&#x5377;&#x5168;&#x7403;&#x3002;&#x6211;&#x4EEC;&#x5728;&#x5DE5;&#x4F5C;&#x548C;&#x4F11;&#x95F2;&#x65F6;&#x95F4;&#x4E2D;&#x4F7F;&#x7528;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x5DF2;&#x7ECF;&#x968F;&#x7740;&#x79FB;&#x52A8;&#x5E94;&#x7528;&#x7684;&#x524D;&#x8FDB;&#x811A;&#x6B65;&#x53D1;&#x751F;&#x4E86;&#x53D8;&#x9769;&#x3002;&#x5728;&#x5F00;&#x53D1;&#x5E94;&#x7528;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4EBA;&#x4EEC;&#x4E5F;&#x5F00;&#x59CB;&#x8003;&#x8651;&#x201C;&#x79FB;&#x52A8;&#x4F18;&#x5148;&#x201D;&#x7684;&#x505A;&#x6CD5;&#x3002;&#x6211;&#x4EEC;&#x6B63;&#x5728;&#x9762;&#x5BF9;&#x5168;&#x65B0;&#x4E00;&#x4EE3;&#x7684;&#x79FB;&#x52A8;&#x8BBE;&#x5907;&#xFF0C;&#x8BF8;&#x5982;&#x53EF;&#x7A7F;&#x6234;&#x8BBE;&#x5907;&#x6216;&#x4F17;&#x591A;&#x79FB;&#x52A8;&#x914D;&#x4EF6;&#x2014;&#x2014;&#x6B63;&#x662F;&#x5B83;&#x4EEC;&#x6784;&#x6210;&#x4E86;&#x201C;&#x4E07;&#x7269;&#x4E92;&#x8054;&#x201D;&#x7684;&#x4E16;&#x754C;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x9762;&#x5BF9;&#x5168;&#x65B0;&#x7684;&#x7528;&#x6237;&#x754C;&#x9762;&#xFF0C;&#x901A;&#x8FC7;&#x5B83;&#x4EEC;&#x6570;&#x636E;&#x5C55;&#x793A;&#x53CA;&#x6307;&#x4EE4;&#x63A5;&#x6536;&#x5904;&#x7406;&#x3002;&#x540C;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x5C06;&#x770B;&#x5230;&#xFF0C;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x7684;&#x516C;&#x53F8;&#x5C06;&#x771F;&#x6B63;&#x5730;&#x8DF5;&#x884C;&#x201C;&#x79FB;&#x52A8;&#x4F18;&#x5148;&#x201D;&#x7684;&#x601D;&#x8DEF;&#x3002;&#x800C;&#x5728;&#x672A;&#x6765;&#x6570;&#x5E74;&#x4E2D;&#xFF0C;&#x8FD9;&#x4E00;&#x5207;&#x90FD;&#x5C06;&#x5F71;&#x54CD;&#x6211;&#x4EEC;&#x8BBE;&#x8BA1;&#x3001;&#x5F00;&#x53D1;&#x548C;&#x6D4B;&#x8BD5;&#x8F6F;&#x4EF6;&#x7684;&#x65B9;&#x5F0F;&#x3002;</p>
<p>&#x628A;&#x4E00;&#x4E2A;&#x5BA2;&#x6237;&#x7AEF;&#x505A;&#x5F97;&#x7A33;&#x5B9A;&#x3001;&#x65E0;&#x5954;&#x6E83;&#x3001;&#x6D41;&#x7545;&#xFF0C;&#x662F;&#x5199;&#x5BA2;&#x6237;&#x7AEF;&#x670B;&#x53CB;&#x7684;&#x68A6;&#x60F3;&#xFF0C;&#x4F46;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x9762;&#x4E34;&#x7684;&#x7ED3;&#x679C;&#x5F80;&#x5F80;&#x662F;&#x4E0D;&#x5982;&#x4EBA;&#x610F;&#x7684;&#x3002;&#x5929;&#x4E0B;&#x6B66;&#x529F;&#xFF0C;&#x552F;&#x5FEB;&#x4E0D;&#x7834;&#x3002;&#x5F88;&#x591A;&#x516C;&#x53F8;&#x90FD;&#x4FE1;&#x5949;&#x8FD9;&#x4E2A;&#x6559;&#x6761;&#x3002;&#x6068;&#x4E0D;&#x5F97;&#x628A;app&#x5F00;&#x53D1;&#x5468;&#x671F;&#x538B;&#x7F29;&#x5230;&#x6700;&#x4F4E;,&#x8FD9;&#x5C31;&#x5BFC;&#x81F4;&#x4E86;&#x5F00;&#x53D1;&#x4E2D;&#x9690;&#x85CF;&#x4E86;&#x5F88;&#x591A;&#x95EE;&#x9898;&#x3002;&#x6709;&#x70B9;&#x7ECF;&#x9A8C;&#x7684;&#x5DE5;&#x7A0B;&#x5E08;&#x8349;&#x7387;&#x7684;&#x4F18;&#x5316;&#x4E00;&#x4E0B;,&#x66F4;&#x7CDF;&#x7684;&#x60C5;&#x51B5;&#x662F;&#x90A3;&#x4E9B;&#x6CA1;&#x6709;&#x7ECF;&#x9A8C;&#x7684;&#x5DE5;&#x7A0B;&#x5E08;&#x751A;&#x81F3;&#x4E0D;&#x4F1A;&#x5BF9;app&#x8FDB;&#x884C;&#x4EFB;&#x4F55;&#x4F18;&#x5316;&#xFF0C;&#x8FD9;&#x5C06;&#x4F1A;&#x4F7F;&#x60C5;&#x51B5;&#x53D8;&#x7684;&#x66F4;&#x7CDF;&#x3002;</p>
<p>&#x5341;&#x5E74;&#x524D;,&#x79FB;&#x52A8;&#x8BBE;&#x5907;&#x7684;&#x786C;&#x4EF6;&#x8D44;&#x6E90;&#x662F;&#x975E;&#x5E38;&#x6709;&#x9650;&#x7684;.&#x751A;&#x81F3;&#x8FDE;&#x6D6E;&#x70B9;&#x6570;&#x90FD;&#x662F;&#x88AB;&#x7981;&#x6B62;&#x7684;.&#x56E0;&#x4E3A;&#x6D6E;&#x70B9;&#x6570;&#x80FD;&#x5BFC;&#x81F4;&#x8BA1;&#x7B97;&#x7684;&#x901F;&#x5EA6;&#x53D8;&#x6162;&#x3002;&#x79D1;&#x6280;&#x53D1;&#x5C55;&#x5982;&#x6B64;&#x8FC5;&#x901F;&#x7684;&#x4ECA;&#x5929;,&#x786C;&#x4EF6;&#x5F88;&#x5927;&#x7A0B;&#x5EA6;&#x4E0A;&#x53EF;&#x4EE5;&#x5F25;&#x8865;&#x8F6F;&#x4EF6;&#x7684;&#x77ED;&#x677F;&#x3002;&#x4F46;&#x662F;&#x786C;&#x4EF6;&#x7684;&#x8FDB;&#x6B65;&#x7EC8;&#x7A76;&#x65E0;&#x6CD5;&#x63A9;&#x9970;&#x8F6F;&#x4EF6;&#x7684;&#x4E0D;&#x8DB3;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x5199;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x7684;&#x521D;&#x5FC3;&#x3002;</p>
<h4 id="&#x79FB;&#x52A8;&#x7AEF;&#x5173;&#x6CE8;&#x8981;&#x70B9;"><a href="#&#x79FB;&#x52A8;&#x7AEF;&#x5173;&#x6CE8;&#x8981;&#x70B9;" class="headerlink" title="&#x79FB;&#x52A8;&#x7AEF;&#x5173;&#x6CE8;&#x8981;&#x70B9;"></a>&#x79FB;&#x52A8;&#x7AEF;&#x5173;&#x6CE8;&#x8981;&#x70B9;</h4><p>&#x5728;&#x7A0B;&#x5E8F;&#x5F00;&#x53D1;&#x4E2D;&#xFF0C;&#x6D4B;&#x8BD5;&#x662F;&#x5FC5;&#x4E0D;&#x53EF;&#x5C11;&#x7684;&#x3002;&#x79FB;&#x52A8;&#x7AEF;&#x6D4B;&#x8BD5;&#x6309;&#x5927;&#x7684;&#x7C7B;&#x578B;&#x5212;&#x5206;&#x53EF;&#x4EE5;&#x5206;&#x4E3A;&#x767D;&#x76D2;&#x6D4B;&#x8BD5;&#x548C;&#x9ED1;&#x76D2;&#x6D4B;&#x8BD5;&#x3002;</p>
<p>&#x767D;&#x76D2;&#x6D4B;&#x8BD5;&#x4E00;&#x822C;&#x662F;&#x7531;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x4F7F;&#x7528;&#x7F16;&#x7801;&#x7684;&#x65B9;&#x5F0F;&#x8FDB;&#x884C;&#x3002;&#x6D4B;&#x8BD5;&#x8005;&#x9700;&#x8981;&#x63A5;&#x89E6;&#x7A0B;&#x5E8F;&#x7684;&#x5185;&#x90E8;&#x4EE3;&#x7801;&#xFF1B;&#x800C;&#x9ED1;&#x76D2;&#x6D4B;&#x8BD5;&#x53EF;&#x4EE5;&#x5728;&#x4E0D;&#x77E5;&#x9053;&#x7A0B;&#x5E8F;&#x5185;&#x90E8;&#x7ED3;&#x6784;&#x548C;&#x4EE3;&#x7801;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x8FDB;&#x884C;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x662F;&#x4E3B;&#x8981;&#x7684;&#x6D4B;&#x8BD5;&#x6D41;&#x7A0B;&#x4E86;&#xFF1A;<br>&#x5192;&#x70DF;&#x6D4B;&#x8BD5;&#xFF1A;&#x5728;&#x8F6F;&#x4EF6;&#x6D4B;&#x8BD5;&#x4E2D;&#xFF0C;&#x5192;&#x70DF;&#x6D4B;&#x8BD5;&#x662F;&#x6307;&#x5FEB;&#x901F;&#x9A8C;&#x8BC1;APP&#x7684;&#x4E3B;&#x8981;&#x529F;&#x80FD;&#xFF08;&#x4F8B;&#x5982;&#xFF1A;&#x5FAE;&#x4FE1;&#x7684;&#x767B;&#x9646;&#x3001;&#x9000;&#x51FA;&#x3001;&#x53D1;&#x6D88;&#x606F;&#x7B49;&#x529F;&#x80FD;&#xFF09; &#x3002;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x53D1;&#x73B0;&#x95EE;&#x9898;&#xFF0C;&#x518D;&#x8FDB;&#x884C;&#x66F4;&#x52A0;&#x6DF1;&#x5165;&#x7684;&#x6D4B;&#x8BD5;&#x5DE5;&#x4F5C;&#xFF1B;&#x5982;&#x679C;&#x53D1;&#x73B0;&#x6709;&#x95EE;&#x9898;&#xFF0C;&#x5C31;&#x8BF4;&#x660E;APP&#x6709;&#x91CD;&#x5927;&#x7F3A;&#x9677;&#x3002;</p>
<p>&#x529F;&#x80FD;&#x6D4B;&#x8BD5;&#xFF1A;&#x529F;&#x80FD;&#x6D4B;&#x8BD5;&#x4E5F;&#x53EB;&#x884C;&#x4E3A;&#x6D4B;&#x8BD5;&#xFF0C;&#x9700;&#x8981;&#x6839;&#x636E;&#x6D4B;&#x8BD5;&#x7528;&#x4F8B;&#x6765;&#x9A8C;&#x8BC1;&#x5E94;&#x7528;&#x9884;&#x671F;&#x7684;&#x529F;&#x80FD;&#x6709;&#x6CA1;&#x6709;&#x5B9E;&#x73B0;&#x3002;</p>
<p>&#x81EA;&#x7531;&#x63A2;&#x7D22;&#x5F0F;&#x6D4B;&#x8BD5;&#xFF1A;&#x5C1D;&#x8BD5;&#x8FB9;&#x754C;&#x6761;&#x4EF6;&#x3001;&#x8F93;&#x5165;&#x7279;&#x6B8A;&#x7B26;&#x53F7;&#x3001;&#x5F02;&#x5E38;&#x7F51;&#x7EDC;&#x73AF;&#x5883;&#x3001;&#x7A81;&#x7136;&#x4E2D;&#x65AD;&#x7A0B;&#x5E8F;&#x7B49;&#x64CD;&#x4F5C; &#x3002;&#x529F;&#x80FD;&#x6D4B;&#x8BD5;&#x7684;&#x76EE;&#x7684;&#x662F;&#x9A8C;&#x8BC1;&#x6B63;&#x5E38;&#x7684;&#x529F;&#x80FD;&#x6709;&#x6CA1;&#x6709;&#x5B9E;&#x73B0;&#xFF0C;&#x800C;&#x81EA;&#x7531;&#x63A2;&#x7D22;&#x6D4B;&#x8BD5;&#x7684;&#x76EE;&#x7684;&#x5C31;&#x662F;&#x4E3A;&#x4E86;&#x8BD5;&#x8BD5;&#x5E94;&#x7528;&#x5728;&#x6781;&#x7AEF;&#x7684;&#x64CD;&#x4F5C;&#x4E0B;&#x4F1A;&#x4E0D;&#x4F1A;&#x51FA;&#x73B0;&#x95EE;&#x9898;&#x3002;&#x63A2;&#x7D22;&#x5F0F;&#x6D4B;&#x8BD5;&#x5C31;&#x662F;&#x8981;&#x627E;&#x5230;&#x80FD;&#x8BA9;&#x5E94;&#x7528;&#x51FA;&#x9519;&#x7684;&#x64CD;&#x4F5C;&#x3002;</p>
<p>&#x56DE;&#x5F52;&#x6D4B;&#x8BD5;&#xFF1A;&#x5BF9;&#x4E4B;&#x524D;&#x4F7F;&#x7528;&#x6211;&#x4EEC;&#x7684;&#x670D;&#x52A1;&#x6D4B;&#x8BD5;&#x8FC7;&#x7684;&#x5E94;&#x7528;&#xFF0C;&#x5C06;&#x6848;&#x4F8B;&#x590D;&#x6D4B;&#x4E00;&#x904D;&#x3002;</p>
<p><strong>&#x79FB;&#x52A8;&#x7AEF;&#x5173;&#x6CE8;&#x7684;&#x4E00;&#x4E9B;&#x6307;&#x6807;</strong><br>&#x8FD0;&#x884C;&#x591A;&#x5C11;&#x5C0F;&#x65F6;&#x4E0D;&#x5D29;&#x6E83;&#xFF1B;<br>&#x591A;&#x6B21;&#x6253;&#x5F00;&#x9875;&#x9762;&#xFF0C;&#x63A7;&#x5236;&#x5D29;&#x6E83;&#x7387;&#xFF1B;<br>&#x754C;&#x9762;&#x4F18;&#x5316;&#xFF0C;&#x5982;&#x4F55;&#x624D;&#x80FD;&#x8BA9;&#x7528;&#x6237;&#x4E0D;&#x6025;&#x8E81;&#x3001;&#x4E0D;&#x70E6;&#x8E81;&#xFF1B;<br>&#x670D;&#x52A1;&#x5668;&#x6CA1;&#x6709;&#x8FD4;&#x56DE;&#x6570;&#x636E;&#xFF0C;&#x662F;&#x5426;&#x4F1A;&#x5BFC;&#x81F4;&#x5954;&#x6E83;&#xFF1B;<br>&#x7F51;&#x7EDC;&#x4E0D;&#x597D;&#xFF0C;&#x6570;&#x636E;&#x6765;&#x7684;&#x592A;&#x6162;&#xFF0C;&#x754C;&#x9762;&#x662F;&#x5426;&#x4E0D;&#x6D41;&#x7545;&#xFF1B;<br>&#x4ECE;&#x6570;&#x636E;&#x5E93;&#x8BFB;&#x7684;&#x6570;&#x636E;&#x592A;&#x6162;&#x5982;&#x4F55;&#x89E3;&#x51B3;&#x7B49;&#x3002;</p>
<p>&#x79FB;&#x52A8;&#x7AEF;&#x754C;&#x9762;&#x5E94;&#x8BE5;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x903B;&#x8F91;&#xFF0C;&#x9700;&#x8981;&#x7F51;&#x7EDC;&#x6570;&#x636E;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x5E94;&#x8BE5;&#x6709;&#x9ED8;&#x8BA4;&#x503C;&#xFF0C;&#x8FD9;&#x6837;&#x5728;&#x7F51;&#x7EDC;&#x6570;&#x636E;&#x6CA1;&#x6709;&#x8FD4;&#x56DE;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8BA9;&#x7528;&#x6237;&#x6709;&#x6570;&#x636E;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x3002;&#x6536;&#x5230;&#x7684;&#x7F51;&#x7EDC;&#x6570;&#x636E;&#x5E94;&#x8BE5;&#x662F;&#x901A;&#x8FC7;&#x67D0;&#x79CD;&#x65B9;&#x5F0F;&#x5237;&#x65B0;&#x5230;&#x754C;&#x9762;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x7B49;&#x5230;&#x6570;&#x636E;&#x8FD4;&#x56DE;&#x624D;&#x5237;&#x65B0;&#x9875;&#x9762;&#x3002;&#x5F53;&#x6CA1;&#x6709;&#x7F51;&#x7EDC;&#x6570;&#x636E;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x754C;&#x9762;&#x5E94;&#x8BE5;&#x53EF;&#x4EE5;&#x81EA;&#x6210;&#x4E00;&#x4F53;&#xFF0C;&#x8D70;&#x7684;&#x901A;&#x6D41;&#x7A0B;&#xFF0C;&#x4E0D;&#x5F3A;&#x4F9D;&#x8D56;&#x7F51;&#x7EDC;&#x6570;&#x636E;&#x3002;</p>
<p>&#x5728;&#x5F31;&#x7F51;&#x6A21;&#x5F0F;&#x4E0B;&#x8C03;&#x8BD5;&#x662F;&#x6211;&#x4EEC;&#x5FC5;&#x5907;&#x7684;&#x529F;&#x529B;&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x8981;&#x8003;&#x8651;&#x7528;&#x6237;&#x7684;&#x5B9E;&#x65BD;&#x73AF;&#x5883;&#x901A;&#x5E38;&#x90FD;&#x4E0D;&#x4F1A;&#x5F88;&#x597D;&#x3002;&#x628A;&#x7ECF;&#x5E38;&#x4F7F;&#x7528;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x5B58;&#x5230;&#x7F13;&#x5B58;&#xFF0C;&#x63D0;&#x9AD8;APP&#x7684;&#x8FD0;&#x884C;&#x6548;&#x7387;&#x3001;&#x754C;&#x9762;&#x6D41;&#x7A0B;&#x5EA6;&#x3002;&#x540C;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5177;&#x5907;&#x6536;&#x96C6;&#x5954;&#x6E83;&#x65E5;&#x5FD7;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x8FD9;&#x6837;&#x624D;&#x80FD;&#x66F4;&#x597D;&#x7684;&#x51CF;&#x5C11;&#x5D29;&#x6E83;&#xFF0C;&#x63D0;&#x9AD8;&#x7528;&#x6237;&#x4F53;&#x9A8C;&#x3002;</p>
<h4 id="&#x754C;&#x9762;&#x5361;&#x987F;&#x4EA7;&#x751F;&#x7684;&#x539F;&#x56E0;&#x548C;&#x89E3;&#x51B3;&#x65B9;&#x6848;"><a href="#&#x754C;&#x9762;&#x5361;&#x987F;&#x4EA7;&#x751F;&#x7684;&#x539F;&#x56E0;&#x548C;&#x89E3;&#x51B3;&#x65B9;&#x6848;" class="headerlink" title="&#x754C;&#x9762;&#x5361;&#x987F;&#x4EA7;&#x751F;&#x7684;&#x539F;&#x56E0;&#x548C;&#x89E3;&#x51B3;&#x65B9;&#x6848;"></a>&#x754C;&#x9762;&#x5361;&#x987F;&#x4EA7;&#x751F;&#x7684;&#x539F;&#x56E0;&#x548C;&#x89E3;&#x51B3;&#x65B9;&#x6848;</h4><p>iOS&#x754C;&#x9762;&#x5904;&#x7406;&#x662F;&#x5728;&#x4E3B;&#x7EBF;&#x7A0B;&#x4E0B;&#x8FDB;&#x884C;&#x7684;&#xFF0C;&#x7CFB;&#x7EDF;&#x56FE;&#x5F62;&#x670D;&#x52A1;&#x901A;&#x8FC7; CADisplayLink &#x7B49;&#x673A;&#x5236;&#x901A;&#x77E5; App&#xFF0C;App &#x4E3B;&#x7EBF;&#x7A0B;&#x5F00;&#x59CB;&#x5728; CPU &#x4E2D;&#x8BA1;&#x7B97;&#x663E;&#x793A;&#x5185;&#x5BB9;&#xFF0C;&#x6BD4;&#x5982;&#x89C6;&#x56FE;&#x7684;&#x521B;&#x5EFA;&#x3001;&#x5E03;&#x5C40;&#x8BA1;&#x7B97;&#x3001;&#x56FE;&#x7247;&#x89E3;&#x7801;&#x3001;&#x6587;&#x672C;&#x7ED8;&#x5236;&#x7B49;&#x3002;&#x968F;&#x540E; CPU &#x4F1A;&#x5C06;&#x8BA1;&#x7B97;&#x597D;&#x7684;&#x5185;&#x5BB9;&#x63D0;&#x4EA4;&#x5230; GPU &#x53BB;&#xFF0C;&#x7531; GPU &#x8FDB;&#x884C;&#x53D8;&#x6362;&#x3001;&#x5408;&#x6210;&#x3001;&#x6E32;&#x67D3;&#x3002;&#x968F;&#x540E; GPU &#x4F1A;&#x628A;&#x6E32;&#x67D3;&#x7ED3;&#x679C;&#x63D0;&#x4EA4;&#x5230;&#x5E27;&#x7F13;&#x51B2;&#x533A;&#x53BB;&#xFF0C;&#x7B49;&#x5F85;&#x4E0B;&#x4E00;&#x6B21;&#x5237;&#x65B0;&#x4FE1;&#x53F7;&#x5230;&#x6765;&#x65F6;&#x663E;&#x793A;&#x5230;&#x5C4F;&#x5E55;&#x4E0A;&#x3002;&#x663E;&#x793A;&#x5668;&#x901A;&#x5E38;&#x4EE5;&#x56FA;&#x5B9A;&#x9891;&#x7387;&#x8FDB;&#x884C;&#x5237;&#x65B0;&#xFF0C;&#x5982;&#x679C;&#x5728;&#x4E00;&#x4E2A;&#x5237;&#x65B0;&#x65F6;&#x95F4;&#x5185;&#xFF0C;CPU &#x6216;&#x8005; GPU &#x6CA1;&#x6709;&#x5B8C;&#x6210;&#x5185;&#x5BB9;&#x63D0;&#x4EA4;&#xFF0C;&#x5219;&#x90A3;&#x4E00;&#x5E27;&#x5C31;&#x4F1A;&#x88AB;&#x4E22;&#x5F03;&#xFF0C;&#x7B49;&#x5F85;&#x4E0B;&#x4E00;&#x6B21;&#x673A;&#x4F1A;&#x518D;&#x663E;&#x793A;&#xFF0C;&#x800C;&#x8FD9;&#x65F6;&#x663E;&#x793A;&#x5C4F;&#x4F1A;&#x4FDD;&#x7559;&#x4E4B;&#x524D;&#x7684;&#x5185;&#x5BB9;&#x4E0D;&#x53D8;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x754C;&#x9762;&#x5361;&#x987F;&#x7684;&#x539F;&#x56E0;&#x3002;CPU &#x548C; GPU &#x4E0D;&#x8BBA;&#x54EA;&#x4E2A;&#x963B;&#x788D;&#x4E86;&#x663E;&#x793A;&#x6D41;&#x7A0B;&#xFF0C;&#x90FD;&#x4F1A;&#x9020;&#x6210;&#x6389;&#x5E27;&#x73B0;&#x8C61;&#x3002;</p>
<p>CPU &#x9020;&#x6210;&#x7684;&#x8D44;&#x6E90;&#x6D88;&#x8017;&#x6709;&#x4EE5;&#x4E0B;&#x51E0;&#x79CD;&#xFF1A;</p>
<ul>
<li>&#x5BF9;&#x8C61;&#x521B;&#x5EFA;</li>
<li>&#x5BF9;&#x8C61;&#x8C03;&#x6574;</li>
<li>&#x5BF9;&#x8C61;&#x9500;&#x6BC1;</li>
<li>&#x5E03;&#x5C40;&#x8BA1;&#x7B97;</li>
<li>Autolayout</li>
<li>&#x6587;&#x672C;&#x8BA1;&#x7B97;</li>
<li>&#x6587;&#x672C;&#x6E32;&#x67D3;</li>
<li>&#x56FE;&#x7247;&#x7684;&#x7ED8;&#x5236;&#x548C;&#x89E3;&#x7801;</li>
</ul>
<p>GPU &#x8D44;&#x6E90;&#x6D88;&#x8017;&#x6709;&#x4E0B;&#x9762;&#x51E0;&#x79CD;&#x60C5;&#x51B5;&#xFF1A;</p>
<ul>
<li>&#x7EB9;&#x7406;&#x7684;&#x6E32;&#x67D3;</li>
<li>&#x89C6;&#x56FE;&#x7684;&#x6DF7;&#x5408; (Composing)</li>
<li>&#x56FE;&#x5F62;&#x7684;&#x751F;&#x6210;&#x7B49;</li>
</ul>
<p>&#x5177;&#x4F53;&#x53EF;&#x4EE5;&#x53C2;&#x8003;<a href="http://blog.ibireme.com/2015/11/12/smooth_user_interfaces_for_ios/" target="_blank" rel="external">&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;</a></p>
<h4 id="&#x7528;-Instruments-&#x6765;&#x68C0;&#x9A8C;&#x4F60;&#x7684;app"><a href="#&#x7528;-Instruments-&#x6765;&#x68C0;&#x9A8C;&#x4F60;&#x7684;app" class="headerlink" title="&#x7528; Instruments &#x6765;&#x68C0;&#x9A8C;&#x4F60;&#x7684;app"></a>&#x7528; Instruments &#x6765;&#x68C0;&#x9A8C;&#x4F60;&#x7684;app</h4><p><strong>&#x65F6;&#x95F4;&#x4E8B;&#x4EF6;&#x67E5;&#x770B;&#x5668;-Time Profiler</strong><br>&#x5728;xcode&#x7684;&#x83DC;&#x5355;&#x4E2D;&#x9009;&#x62E9; product-&gt;Profile<br>&#x6211;&#x4EEC;&#x4F1A;&#x770B;&#x5230;&#x4E0B;&#x9762;&#x7684;&#x754C;&#x9762;&#xFF1A;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1170656-11be1e08fd9ed911.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="Instruments"><br>&#x70B9;&#x51FB;Time Profiler&#x8FDB;&#x5165;&#x3002;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1170656-40bdb36ac65cdc9f.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="Time Profiler"><br>&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x6765;&#x6DF1;&#x7A76;&#x5982;&#x4E0B;&#x7684;&#x63A7;&#x5236;&#x9762;&#x677F;&#xFF1A;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1170656-d6755d42a68acf4d.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="&#x63A7;&#x5236;&#x9762;&#x677F;"></p>
<p>&#x4EE5;&#x4E0B;&#x4ECB;&#x7ECD;&#x4E0B;&#x914D;&#x7F6E;&#x9009;&#x9879;&#xFF1A;</p>
<ol>
<li>Separate by Thread: &#x6BCF;&#x4E2A;&#x7EBF;&#x7A0B;&#x5E94;&#x8BE5;&#x5206;&#x5F00;&#x8003;&#x8651;&#x3002;&#x53EA;&#x6709;&#x8FD9;&#x6837;&#x4F60;&#x624D;&#x80FD;&#x63EA;&#x51FA;&#x90A3;&#x4E9B;&#x5927;&#x91CF;&#x5360;&#x7528;CPU&#x7684;&#x201D;&#x91CD;&#x201D;&#x7EBF;&#x7A0B;&#x3002;</li>
<li>Invert Call Tree: &#x4ECE;&#x4E0A;&#x5012;&#x4E0B;&#x8DDF;&#x8E2A;&#x5806;&#x6808;,&#x8FD9;&#x610F;&#x5473;&#x7740;&#x4F60;&#x770B;&#x5230;&#x7684;&#x8868;&#x4E2D;&#x7684;&#x65B9;&#x6CD5;,&#x5C06;&#x5DF2;&#x4ECE;&#x7B2C;0&#x5E27;&#x5F00;&#x59CB;&#x53D6;&#x6837;,&#x8FD9;&#x901A;&#x5E38;&#x4F60;&#x662F;&#x60F3;&#x8981;&#x7684;,&#x53EA;&#x6709;&#x8FD9;&#x6837;&#x4F60;&#x624D;&#x80FD;&#x770B;&#x5230;CPU&#x4E2D;&#x8BDD;&#x8D39;&#x65F6;&#x95F4;&#x6700;&#x6DF1;&#x7684;&#x65B9;&#x6CD5;.&#x4E5F;&#x5C31;&#x662F;&#x8BF4;FuncA{FunB{FunC}} &#x52FE;&#x9009;&#x6B64;&#x9879;&#x540E;&#x5806;&#x6808;&#x4EE5;C-&gt;B-A &#x628A;&#x8C03;&#x7528;&#x5C42;&#x7EA7;&#x6700;&#x6DF1;&#x7684;C&#x663E;&#x793A;&#x5728;&#x6700;&#x5916;&#x9762;&#x3002;</li>
<li>Hide System Libraries: &#x52FE;&#x9009;&#x6B64;&#x9879;&#x4F60;&#x4F1A;&#x663E;&#x793A;&#x4F60;app&#x7684;&#x4EE3;&#x7801;,&#x8FD9;&#x662F;&#x975E;&#x5E38;&#x6709;&#x7528;&#x7684;. &#x56E0;&#x4E3A;&#x901A;&#x5E38;&#x4F60;&#x53EA;&#x5173;&#x5FC3;cpu&#x82B1;&#x5728;&#x81EA;&#x5DF1;&#x4EE3;&#x7801;&#x4E0A;&#x7684;&#x65F6;&#x95F4;&#x4E0D;&#x662F;&#x7CFB;&#x7EDF;&#x4E0A;&#x7684;&#x3002;</li>
<li>Flatten Recursion: &#x9012;&#x5F52;&#x51FD;&#x6570;, &#x6BCF;&#x4E2A;&#x5806;&#x6808;&#x8DDF;&#x8E2A;&#x4E00;&#x4E2A;&#x6761;&#x76EE;&#x3002;</li>
<li>Top Functions: &#x4E00;&#x4E2A;&#x51FD;&#x6570;&#x82B1;&#x8D39;&#x7684;&#x65F6;&#x95F4;&#x76F4;&#x63A5;&#x5728;&#x8BE5;&#x51FD;&#x6570;&#x4E2D;&#x7684;&#x603B;&#x548C;&#xFF0C;&#x4EE5;&#x53CA;&#x5728;&#x51FD;&#x6570;&#x8C03;&#x7528;&#x8BE5;&#x51FD;&#x6570;&#x6240;&#x82B1;&#x8D39;&#x7684;&#x65F6;&#x95F4;&#x7684;&#x603B;&#x65F6;&#x95F4;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5982;&#x679C;&#x51FD;&#x6570;A&#x8C03;&#x7528;B&#xFF0C;&#x90A3;&#x4E48;A&#x7684;&#x65F6;&#x95F4;&#x62A5;&#x544A;&#x5728;A&#x82B1;&#x8D39;&#x7684;&#x65F6;&#x95F4;&#x52A0;&#x4E0A;B.&#x82B1;&#x8D39;&#x7684;&#x65F6;&#x95F4;,&#x8FD9;&#x975E;&#x5E38;&#x771F;&#x6709;&#x7528;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x53EF;&#x4EE5;&#x8BA9;&#x4F60;&#x6BCF;&#x6B21;&#x4E0B;&#x5230;&#x8C03;&#x7528;&#x5806;&#x6808;&#x65F6;&#x6311;&#x6700;&#x5927;&#x7684;&#x65F6;&#x95F4;&#x6570;&#x5B57;&#xFF0C;&#x5F52;&#x96F6;&#x5728;&#x4F60;&#x6700;&#x8017;&#x65F6;&#x7684;&#x65B9;&#x6CD5;&#x3002;</li>
</ol>
<p>&#x627E;&#x5230;Detail&#x9762;&#x677F;&#x91CC;&#x6700;&#x8017;&#x65F6;&#x7684;&#x8FDB;&#x7A0B;&#xFF0C;&#x70B9;&#x51FB;&#x8FDB;&#x53BB;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x4EE3;&#x7801;&#xFF0C;&#x89C2;&#x5BDF;&#x662F;&#x5426;&#x6709;&#x5F02;&#xFF0C;&#x5982;&#x6B64;&#x4FBF;&#x53EF;&#x9010;&#x6B65;&#x4F18;&#x5316;&#x5E94;&#x7528;&#x7684;&#x8FD0;&#x884C;&#x6548;&#x679C;&#x4E86;&#x3002;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1170656-709a8715b9a6c191.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="&#x4FEE;&#x6539;"></p>
<p>&#x4FEE;&#x6539;&#x597D;&#x540E;,&#x5728;&#x4EEA;&#x5668;&#x91CD;&#x65B0;&#x8FD0;&#x884C;&#x8BE5;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;Product&#x2014;Profile&#xFF08;&#x6216;&#x2318;I-&#x8BB0;&#x4F4F;&#xFF0C;&#x8FD9;&#x4E9B;&#x5FEB;&#x6377;&#x952E;&#x771F;&#x7684;&#x4F1A;&#x4E3A;&#x60A8;&#x8282;&#x7701;&#x4E00;&#x4E9B;&#x65F6;&#x95F4;&#xFF09;&#x3002;<br><strong>&#x5206;&#x914D;&#x5DE5;&#x5177;</strong></p>
<p><img src="http://upload-images.jianshu.io/upload_images/1170656-c1f214001adad7e2.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="&#x5206;&#x914D;&#x5DE5;&#x5177;"></p>
<p><img src="http://upload-images.jianshu.io/upload_images/1170656-e1619715fecd3f4b.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="&#x70B9;&#x51FB;&#x8FDB;&#x5165;"></p>
<p>&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x4F60;&#x4F1A;&#x53D1;&#x73B0;&#x4E24;&#x4E2A;&#x66F2;&#x76EE;&#x3002;&#x4E00;&#x4E2A;&#x53EB;(&#x5206;&#x914D;)Allocations&#xFF0C;&#x4EE5;&#x53CA;&#x4E00;&#x4E2A;&#x88AB;&#x79F0;&#x4E3A;VM Tracker(&#x865A;&#x62DF;&#x673A;&#x8DDF;&#x8E2A;)&#x3002;</p>
<p>&#x5185;&#x5B58;&#x6CC4;&#x6F0F;&#x6709;&#x4E24;&#x79CD;&#x6CC4;&#x6F0F;&#x3002;&#x7B2C;&#x4E00;&#x4E2A;&#x662F;&#x771F;&#x6B63;&#x7684;&#x5185;&#x5B58;&#x6CC4;&#x6F0F;&#xFF0C;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x5C1A;&#x672A;&#x88AB;&#x91CA;&#x653E;&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x518D;&#x88AB;&#x5F15;&#x7528;&#x7684;&#x4E86;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5B58;&#x50A8;&#x5668;&#x4E0D;&#x80FD;&#x88AB;&#x91CD;&#x65B0;&#x4F7F;&#x7528;&#x3002;&#x7B2C;&#x4E8C;&#x7C7B;&#x6CC4;&#x6F0F;&#x662F;&#x6BD4;&#x8F83;&#x9EBB;&#x70E6;&#x4E00;&#x4E9B;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x6240;&#x8C13;&#x7684;&#x201C;&#x65E0;&#x754C;&#x5185;&#x5B58;&#x589E;&#x957F;&#x201D;&#x3002;&#x8FD9;&#x53D1;&#x751F;&#x5728;&#x5185;&#x5B58;&#x7EE7;&#x7EED;&#x5206;&#x914D;&#xFF0C;&#x5E76;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x6709;&#x673A;&#x4F1A;&#x88AB;&#x91CA;&#x653E;&#x3002;&#x5982;&#x679C;&#x6C38;&#x8FDC;&#x8FD9;&#x6837;&#x4E0B;&#x53BB;&#x4F60;&#x7684;&#x7A0B;&#x5E8F;&#x5360;&#x7528;&#x7684;&#x5185;&#x5B58;&#x4F1A;&#x65E0;&#x9650;&#x5927;,&#x5F53;&#x8D85;&#x8FC7;&#x4E00;&#x5B9A;&#x5185;&#x5B58;&#x7684;&#x8BDD; &#x4F1A;&#x88AB;&#x7CFB;&#x7EDF;&#x7684;&#x770B;&#x95E8;&#x72D7;&#x7ED9;kill&#x6389;&#x3002;</p>
<p>&#x5185;&#x5B58;&#x8B66;&#x544A;&#x662F;ios&#x5904;&#x7406;app&#x6700;&#x597D;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x5728;&#x5185;&#x5B58;&#x8D8A;&#x6765;&#x8D8A;&#x5403;&#x7D27;&#x7684;&#x65F6;&#x5019;,&#x4F60;&#x9700;&#x8981;&#x6E05;&#x9664;&#x4E00;&#x4E9B;&#x5185;&#x5B58;&#x3002;&#x5185;&#x5B58;&#x4E00;&#x76F4;&#x589E;&#x957F;&#x5176;&#x5B9E;&#x4E5F;&#x4E0D;&#x4E00;&#x5B9A;&#x662F;&#x4F60;&#x7684;&#x4EE3;&#x7801;&#x51FA;&#x4E86;&#x95EE;&#x9898;,&#x4E5F;&#x6709;&#x53EF;&#x80FD;&#x662F;UIKit &#x7CFB;&#x7EDF;&#x6846;&#x67B6;&#x672C;&#x8EAB;&#x5BFC;&#x81F4;&#x7684;&#x3002;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1170656-a22007e5806c3b75.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="&#x5C1D;&#x8BD5;"><br>&#x81EA;&#x5DF1;&#x52A8;&#x624B;&#x89C2;&#x5BDF;&#x4E0B;&#xFF0C;&#x4E00;&#x5207;&#x81EA;&#x7136;&#x660E;&#x4E86;&#x3002;</p>
<p><strong>&#x5185;&#x5B58;&#x6CC4;&#x9732;</strong><br>&#x8FD9;&#x4E00;&#x7C7B;&#x6CC4;&#x6F0F;&#x662F;&#x524D;&#x9762;&#x63D0;&#x5230;&#x7684; - &#x5F53;&#x4E00;&#x4E2A;&#x5BF9;&#x8C61;&#x4E0D;&#x518D;&#x88AB;&#x5F15;&#x7528;&#x65F6;&#x51FA;&#x73B0;&#x7684;&#x90A3;&#x79CD;,&#x68C0;&#x6D4B;&#x6CC4;&#x6F0F;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x4E3A;&#x4E00;&#x4E2A;&#x5F88;&#x590D;&#x6742;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x4F46;&#x6CC4;&#x6F0F;&#x7684;&#x5DE5;&#x5177;&#x8BB0;&#x5F97;&#x5DF2;&#x5206;&#x914D;&#x7684;&#x6240;&#x6709;&#x5BF9;&#x8C61;&#xFF0C;&#x901A;&#x8FC7;&#x5B9A;&#x671F;&#x626B;&#x63CF;&#x6BCF;&#x4E2A;&#x5BF9;&#x8C61;&#x4EE5;&#x786E;&#x5B9A;&#x662F;&#x5426;&#x6709;&#x4EFB;&#x4F55;&#x4E0D;&#x80FD;&#x4ECE;&#x4EFB;&#x4F55;&#x5176;&#x4ED6;&#x5BF9;&#x8C61;&#x8BBF;&#x95EE;&#x7684;&#x3002;</p>
<p>&#x5173;&#x95ED;&#x4EEA;&#x5668;&#xFF0C;&#x56DE;&#x5230;Xcode&#x548C;&#x9009;&#x62E9;Product-&gt;Profile</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1170656-46943f0933d55df1.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="&#x5185;&#x5B58;&#x6CC4;&#x9732;"></p>
<p>&#x70B9;&#x51FB;&#x8FDB;&#x5165;&#xFF0C;&#x8FD0;&#x884C;&#xFF1A;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1170656-f69162d70c7f254a.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="&#x8FD0;&#x884C;"></p>
<p>&#x81EA;&#x5DF1;&#x52A8;&#x624B;&#x5C1D;&#x8BD5;&#x4E0B;&#xFF0C;&#x627E;&#x5230;&#x53F3;&#x8FB9;&#x9762;&#x677F;&#x91CC;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x9ED1;&#x8272;&#x6807;&#x8BC6;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x8FDB;&#x5165;&#x770B;&#x770B;&#x3002;&#x5B66;&#x4E60;&#x5C31;&#x662F;&#x591A;&#x5C1D;&#x8BD5;&#x3002;</p>
<p>&#x7BC7;&#x5E45;&#x6709;&#x9650;&#xFF0C;&#x66F4;&#x591A;&#x7684;&#x5185;&#x5BB9;&#x6211;&#x4EEC;&#x4E0B;&#x6B21;&#x518D;&#x804A;&#x3002;</p>

            <div class="clearfix"></div>
            <hr class="nogutter">
        </div>


        <nav class="pagination" role="pagination">


<div class="ds-share flat" data-thread-key="2013/12/01/如何编写稳定流畅的iOS移动端应用/" data-title="如何编写稳定流畅的iOS移动端应用" data-images="https://avatars0.githubusercontent.com/u/10378248?v=3&s=460" data-content="如何编写稳定流畅的iOS移动端应用 是最近写的文章，希望能帮到您！" data-url="https://dangdangfeng.github.io/2013/12/01/如何编写稳定流畅的iOS移动端应用/">
    <div class="ds-share-inline">
      <ul  class="ds-share-icons-16">
        
        <li data-toggle="ds-share-icons-more"><a class="ds-more" href="javascript:void(0);">分享到：</a></li>
        <li><a class="ds-weibo" href="javascript:void(0);" data-service="weibo">微博</a></li>
        <li><a class="ds-qzone" href="javascript:void(0);" data-service="qzone">QQ空间</a></li>
        <li><a class="ds-qqt" href="javascript:void(0);" data-service="qqt">腾讯微博</a></li>
        <li><a class="ds-wechat" href="javascript:void(0);" data-service="wechat">微信</a></li>
        
      </ul>
      <div class="ds-share-icons-more">
      </div>
    </div>
 </div>

 <br/>

    
    <a class="pull-left" href="/2013/12/13/OC中的Class/" style="float: left;">
        ← OC中的Class
    </a>
    
    
    <a class="pull-right" href="/2013/10/01/从0开始看一个项目/">
        从0开始看一个项目 →
    </a>
    

    
</nav>



        
        <div class="duoshuo">


<div class="ds-thread" data-thread-key="2013/12/01/如何编写稳定流畅的iOS移动端应用/" data-title="如何编写稳定流畅的iOS移动端应用" data-url="https://dangdangfeng.github.io/2013/12/01/如何编写稳定流畅的iOS移动端应用/"></div>



<script type="text/javascript">
var duoshuoQuery = {short_name:"deter"};
(function() {
	var ds = document.createElement('script');
	ds.type = 'text/javascript';ds.async = true;
	ds.src = (document.location.protocol == 'https:' ? 'https:' : 'http:') + '//static.duoshuo.com/embed.js';
	ds.charset = 'UTF-8';
	(document.getElementsByTagName('head')[0] 
	 || document.getElementsByTagName('body')[0]).appendChild(ds);
})();
</script>
</div>
    </div>
</section>


      
<!-- ============================ Footer =========================== -->

<footer>
    <div class="container">
            <div class="copy">
                <p>
                    &copy; 2010<script>new Date().getFullYear()>2010&&document.write("-"+new Date().getFullYear());</script>, Content By 吴白. All Rights Reserved.
                </p>
                <p>Theme By <a href="//go.kieran.top" style="color: #767D84">Kieran</a></p>
            </div>
            <div class="social">
                <ul>
                    
                    <li><a href="https://github.com/" title="Github" target="_blank"><i class="icon-github"></i></a>&nbsp;</li>
                    
                    
                    <li><a href="https://twitter.com/" title="Twitter" target="_blank"><i class="icon-twitter"></i></a>&nbsp;</li>
                    
                    
                    <li><a href="https://www.facebook.com/" title="Facebook" target="_blank"><i class="icon-facebook"></i></a>&nbsp;</li>
                    
                    
                    <li><a href="https://google.com/" title="Google-Plus" target="_blank"><i class="icon-google-plus"></i></a>&nbsp;</li>
                    
                    
                    <li><a href="http://weibo.com/" title="Sina-Weibo" target="_blank"><i class="icon-sina-weibo"></i></a>&nbsp;</li>
                    
                </ul>
            </div>
            <div class="clearfix"> </div>
        </div>
</footer>

<!-- ============================ END Footer =========================== -->
      <!-- Load our scripts -->
        
<!-- Resizable 'on-demand' full-height hero -->
<script type="text/javascript">
    
    var resizeHero = function () {
        var hero = $(".cover,.heightblock"),
            window1 = $(window);
        hero.css({
            "height": window1.height()
        });
    };
    
    resizeHero();
    
    $(window).resize(function () {
        resizeHero();
    });
</script>
<script src="/js/plugins.min.js"></script><!-- Bootstrap core and concatenated plugins always load here -->
<script src="/js/jquery.flexslider-min.js"></script><!-- Flexslider plugin -->
<script src="/js/scripts.js"></script><!-- Theme scripts -->

<!-- Initiate flexslider plugin -->
<script type="text/javascript">
    $(document).ready(function($) {
      $('.flexslider').flexslider({
        animation: "fade",
        prevText: "",
        nextText: "",
        directionNav: true
      });
    });
</script>

</body>
</html>
